{"summary": "Write a detailed summary of Hurricane Ana's impact and trajectory in 2014. Explain how it formed, its intensification into a hurricane, and the threat it posed to Hawaii. Discuss the weather conditions it encountered, and describe its closest approach and subsequent weakening.", "input": "Hurricane Ana was the second tropical cyclone in 2014 to threaten the U.S. state of Hawaii with a direct hit, after Iselle in August. The twenty-first named storm and fifteenth hurricane of the 2014 Pacific hurricane season, Ana formed from a disturbance that formed in the Central Pacific in mid-October. It rapidly consolidated, and a tropical depression developed by October 13. Aided by favorable conditions, Ana gradually strengthened while moving westward, threatening to pass over the island chain of Hawaii once or several times as indicated by early forecasts. By October 17, it had strengthened to a hurricane south of Hawaii and reached its peak intensity shortly afterwards while also making its closest approach. Afterwards, Ana weakened and began to fluctuate in intensity as it turned to the", "label": 1}
{"summary": "Write a detailed explanation about the referendum held on 6 February 2023 in the Wolayita, Gamo, Gofa, South Omo, Gedeo, and Konso Zones, as well as the Dirashe, Amaro, Burji, Ale, and Basketo special woredas of the Southern Nations, Nationalities, and Peoples' Region (SNNP) of Ethiopia. Include information about the purpose of the referendum, connections to previous referendums in 2019 and 2021, irregularities found in the Wolayita Zone voting process, and the resulting resolutions passed in July 2023 to split off into a new region. Discuss the implications of this decision and its conveyance to the national House of Federation.", "input": "On 6 February 2023 a referendum was held in the Wolayita, Gamo, Gofa, South Omo, Gedeo, and Konso Zones, as well as the Dirashe, Amaro, Burji, Ale, and Basketo special woredas of the Southern Nations, Nationalities, and Peoples' Region (SNNP) of Ethiopia, on whether the included areas should leave SNNP and form their own Region. This referendum follows two previous referendums from 2019 and 2021 in other areas of the then-SNNP, both of which resulted in votes to split off into new regions. The referendum was tentatively approved, although Wolayita Zone must rehold voting after it was found that irregularities were present. The other zones and woredas involved passed resolutions to split off in July 2023, and this was conveyed to the national House of Federation by the", "label": 0}
{"summary": "Discuss the global impact and response to the 2013–2016 Ebola virus epidemic, which primarily affected Western Africa. How did the outbreak affect the socio-economic landscape in Guinea, Liberia, and Sierra Leone, and what measures were taken internationally to curb the spread of the virus? Include the consequences of secondary infections in countries like the United States and Spain, as well as the international cooperative efforts that led to the decline in cases by late 2014.", "input": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the region, mainly in Guinea, Liberia and Sierra Leone. The first cases were recorded in Guinea in December 2013; later, the disease spread to neighbouring Liberia and Sierra Leone, with minor outbreaks occurring in Nigeria and Mali. Secondary infections of medical workers occurred in the United States and Spain. In addition, isolated cases were recorded in Senegal, the United Kingdom and Italy. The number of cases peaked in October 2014 and then began to decline gradually, following the commitment of substantial international resources. It caused significant mortality, with a considerable case fatality rate. By the end of", "label": 1}
{"summary": "Write a detailed summary about the case of Ashya King, a young boy with a brain tumour, whose parents' disagreement with doctors over his treatment led to notable events. Include information about Ashya's condition, the medical procedures he underwent, his parents' preferred treatment choice of proton therapy, and any details surrounding the NHS's stance on proton therapy during that time.", "input": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in August 2014 over a disagreement with doctors regarding his treatment.Ashya had a medulloblastoma, which was successfully removed through surgery on 24 July 2014. He received further neurosurgery on 22 August.His parents desired their son be treated with proton therapy, which they felt was less harmful than conventional radiotherapy. At that time, the National Health Service (NHS) did not provide proton therapy in the United Kingdom. However, it has funded treatment abroad since April 2008 where evidence has shown there to be benefit. In this case, the doctors did not support moving the boy so that he", "label": 1}
{"summary": "Generate a detailed summary of the 67th British Academy Film Awards that took place on 16 February 2014 at the Royal Opera House in London. Include key highlights such as the films and individuals who received top honours, like Gravity and its multiple wins, as well as 12 Years a Slave’s major achievements. Discuss the significance of the awards presented by the British Academy of Film and Television Arts and the criteria for winning these accolades.", "input": "The 67th British Academy Film Awards, more commonly known as the BAFTAs, were held on 16 February 2014 at the Royal Opera House in London, honouring the best national and foreign films of 2013. The nominations were announced on 8 January 2014 by actor Luke Evans and actress Helen McCrory. Presented by the British Academy of Film and Television Arts, accolades were handed out for the best feature-length film and documentaries of any nationality that were screened at British cinemas in 2013.Gravity won six of its eleven nominations, including Best Director for Alfonso Cuarón, Outstanding British Film, Best Cinematography, Best Original Music, Best Sound, and Best Special Visual Effects. 12 Years a Slave won Best Film and Best Actor in a Leading Role for Chiwetel Ejiofor. Cate Blanchett", "label": 1}
{"summary": "Write a comprehensive summary of the significant events and outcomes of the 16th Houston Film Critics Society Awards, highlighting the key award winners, nominations, and notable moments from the ceremony held at the Midtown Arts & Theater Center Houston in Texas on February 18, 2023. Discuss the major films that led the nominations and secured the most awards, including Everything Everywhere All at Once and The Banshees of Inisherin, and detail the special performances and categories such as the Texas Independent Film Award.", "input": "The 16th Houston Film Critics Society Awards were announced on February 18, 2023, at the Midtown Arts & Theater Center Houston (MATCH) in Texas. The nominations were announced on January 10, 2023, with The Banshees of Inisherin and Everything Everywhere All at Once leading the nominations with nine each. Both films won the most awards with three each, with Everything Everywhere All at Once winning Best Picture. The nominees for the Texas Independent Film Award were announced on December 7, 2022.Hosted by local film critics and film industry notables, the event featured live, abridged performances of the five Best Original Song nominees, which went to \"Naatu Naatu\" from RRR, and the awarding of the Texas Independent Film Award. \"As the industry continues to debate how we should experience", "label": 0}
{"summary": "Generate an informative article discussing the Cuban thaw, detailing the normalization of relations between Cuba and the United States that began in December 2014. Provide historical context on the 54-year hostility, highlight significant events such as Barack Obama's 2016 visit to Cuba (the first by a U.S. president since 1928), and explain the key aspects of the agreement announced by Barack Obama and Raúl Castro on December 17, 2014. Include the role of Pope Francis and the Government of Canada in facilitating the negotiations, as well as the specific changes introduced, such as eased travel restrictions, reduced remittance regulations, U.S. banks gaining access to Cuba's financial system, and the reopening of diplomatic channels.", "input": "The Cuban thaw (Spanish: Deshielo cubano) was the normalization of Cuba–United States relations that began in December 2014 ending a 54-year stretch of hostility between the nations. In March 2016, Barack Obama became the first U.S. president to visit Cuba since Calvin Coolidge, in 1928.On December 17, 2014, U.S. President Barack Obama and Cuban leader Raúl Castro announced the beginning of the process of normalizing relations between Cuba and the United States. The normalization agreement was secretly negotiated in preceding months, facilitated by Pope Francis and largely hosted by the Government of Canada. Meetings were held in both Canada and Vatican City. The agreement would see the lifting of some U.S. travel restrictions, fewer restrictions on remittances, U.S. banks' access to the Cuban financial system, and the reopening", "label": 1}
{"summary": "Write a news article about the 2014 Berlin Marathon, detailing the significant achievements and records set during the event. Highlight the performance of Dennis Kimetto and how he set a new world record in the men's category. Include details about the runner-up Emmanuel Mutai's remarkable finish and his record-setting pace at the 30K mark. Also, mention Tirfi Tsegaye's victory in the women's race and any other notable highlights from the marathon.", "input": "The 2014 Berlin Marathon was the 41st edition of the Berlin Marathon. The marathon took place in Berlin, Germany, on 28 September 2014 and was the fourth World Marathon Majors race of the year. The men's race was won by Kenyan athlete Dennis Kimetto in a world record time of 2:02:57, breaking the previous record of Wilson Kipsang by 26 seconds. Kimetto's performance means that the last six men's world records at the distance have all been set at the Berlin Marathon. Runner-up Emmanuel Mutai also surpassed Kipsang's old mark, finishing in 2:03:13. En route to his second-place finish, Mutai set a world record at the 30K distance (1:27:37).The women's race was won by Tirfi Tsegaye of Ethiopia in a time of 2:20:18 hours. Finishing third in a", "label": 1}
{"summary": "Generate a summary of the 28th Critics' Choice Awards, highlighting the key details such as the date, location, host, and notable nominations. Be sure to include information on the broadcasting details and the records set by nominated films.", "input": "The 28th Critics' Choice Awards were presented on January 15, 2023, at the Fairmont Century Plaza Hotel in Los Angeles, California, honoring the finest achievements of filmmaking and television programming in 2022. The ceremony was broadcast on The CW and hosted by Chelsea Handler, taking over the reins from Taye Diggs who had hosted the show consecutively in the previous four years.Like in the previous two years, film and television nominations were announced separately. The television nominations were announced on December 6, 2022. The film nominations were announced on December 14, 2022.Everything Everywhere All at Once led the film nominations with 14—a record shared with The Shape of Water (2017), The Favourite (2018), and The Irishman (2019)—followed by The Fabelmans with 11. ABC's first-year mockumentary comedy Abbott Elementary", "label": 0}
{"summary": "Based on the information provided about Operation Full Disclosure, compose a detailed article discussing how this military operation was carried out by the Israel Defense Forces in the Red Sea on March 5, 2014. Analyze the strategic importance of intercepting the Iranian-owned Klos C vessel and uncovering long-range missiles hidden within containers marked as Portland cement. Explore the implications of the operation on regional security dynamics, especially concerning Gaza Strip and Sinai. Additionally, examine the role of international surveillance and intelligence in confirming the shipment's origin from Iran aimed at Sudan, while considering the impact of such findings from a UN panel of experts.", "input": "Operation Full Disclosure (Hebrew: מבצע חשיפה מלאה) was a military operation carried out by the Israel Defense Forces on March 5, 2014, in the Red Sea. After days of surveillance far out to sea, Israeli Navy Shayetet 13 commandos seized the Iranian-owned and Panamanian-registered merchant vessel Klos C that had set sail from Iran, heading for Port Sudan via Iraq. On board, the commandos found long-range missiles suspected to be destined for the Gaza Strip concealed in containers full of Iranian bags marked as Portland cement. An unnamed senior Egyptian security official reportedly confirmed that the arms shipment was headed for militants in either Gaza or Sinai. A UN panel of experts concluded that the weapons came from Iran and were being sent to Sudan, accusing Iran of", "label": 1}
{"summary": "Write a detailed summary of the 13N demonstration in Argentina against President Cristina Fernández de Kirchner on November 13, 2014. Include information about the reasons for the protest, the organization via social networks, the key locations where demonstrators gathered, the security measures in place, and comparison with previous demonstrations such as 8N and 18A. Also, mention the reaction of the chief of the cabinet of ministers, Jorge Capitanich.", "input": "The 13N was a Cacerolazo against President Cristina Fernández de Kirchner that took place in Argentina on November 13, 2014. It was organized by social networks. The people in the demonstration protested against the high crime rate, the high inflation and the corruption scandals. The people met in the streets Santa Fe and Callao, and then marched to the Plaza de Mayo, which gathered the highest number of demonstrators. There was a strong security network at the Plaza de Mayo and the Congressional Plaza. The demonstration a lower number of demonstrators than previous ones such as the 8N and the 18A.Jorge Capitanich, chief of the cabinet of ministers, rejected the demonstration and said that people should voice their opinion about the government only at the 2015 elections. ==", "label": 1}
{"summary": "Generate a detailed summary of the 2014 Paris Municipal elections, focusing on the main candidates, the election process, and the significant outcomes. Include information about Anne Hidalgo's historic win as the first female mayor of Paris, the voting statistics, and the role of opinion polls in forecasting the election results. Highlight the transition from Bertrand Delanoë's term and how control over Paris' arrondissements was determined during the elections.", "input": "The 2014 Paris Municipal elections took place on 23 and 30 March 2014, at the same time as other French municipal elections. Anne Hidalgo of the Socialist Party was elected mayor of Paris, becoming the first woman to hold that position. She had been the city's deputy mayor. Hidalgo won with around 55% of the vote in the second round. Her principal opponent was Nathalie Kosciusko-Morizet of the UMP who had finished ahead of Hidalgo in first round of voting on 23 March. Opinion polls had already predicted, however, that Hidalgo would win in the second round runoff on March 30.The outgoing mayor was the Socialists' Bertrand Delanoë, who did not run for a third term. Control of Paris' twenty arrondissements was also decided in the elections. Ten", "label": 1}
{"summary": "Generate a detailed news report narrative based on the following information: On 22 February 2023, a concert and rally were held at Luzhniki Stadium in Moscow. The rally was reported by TASS to commemorate Defender of the Fatherland Day, while Ukrainska Pravda suggested that the date was chosen due to its proximity to 24 February 2022, marking the start of the 2022 Russian invasion of Ukraine. RBC mentioned that Russian President Vladimir Putin was expected to attend, and RIA Novosti cited a parliamentary source confirming that Putin would deliver a speech at the event. Ukrainska Pravda indicated that historical exhibits and Russian military equipment would be featured. Argumenty i Fakty projected an attendance of around 200,000 people. Radio Liberty noted that individuals were being offered 500 RUB to participate in a rally in Moscow, speculating that this could be for the same event. Compile the details into a cohesive article, providing context and synthesizing the sources provided.", "input": "A concert and rally took place on 22 February 2023 at Luzhniki Stadium in Moscow. TASS reported that the rally commemorated Defender of the Fatherland Day. Ukrainska Pravda stated that the date was selected in reference to the starting date of the 2022 Russian invasion of Ukraine, 24 February 2022.RBC reported that President Vladimir Putin was expected to make an appearance, and RIA Novosti reported that a parliamentary source stated that Putin would speak at the rally. Ukrainska Pravda added that historical exhibits and Russian military equipment would also be on display. Argumenty i Fakty reported that around 200,000 people were expected to attend. Radio Liberty stated that people were being offered 500 RUB to attend a rally in Moscow, and presumed that the offer was for this", "label": 0}
{"summary": "On January 19, 2023, the United States hit its debt ceiling, initiating an ongoing debt-ceiling crisis. Janet Yellen, the secretary of the treasury, implemented temporary 'extraordinary measures' in response. This crisis stems from a political debate within Congress about federal government spending and the national debt accrued by the U.S. government. In the United States, the debt ceiling is a limit set by Congress on how much national debt the Treasury Department may incur. While the debt ceiling does not authorize new government spending, it provides the Treasury with broader authority over financial endeavors selected by Congress. Provide a detailed analysis of the implications of hitting the debt ceiling and explain how extraordinary measures work. Additionally, compare the current debt-ceiling crisis to the 2013 crisis that persisted until the Continuing Appropriations Act of 2014 was passed in October 2013. Highlight key similarities and differences between the two scenarios and discuss their political, economic, and social impacts.", "input": "On January 19, 2023, the United States hit its debt ceiling, beginning an ongoing debt-ceiling crisis. In response, Janet Yellen, the secretary of the treasury, began enacting temporary \"extraordinary measures\". The crisis is part of a political debate within Congress about federal government spending and the national debt that the U.S. government accrues.In the United States, the debt ceiling is a limit on how much national debt the Treasury Department may incur, defined by Congress. Although the debt ceiling does not authorize new spending, it grants the Treasury greater power over financial endeavors Congress may choose to take. In January 2013, the United States hit the debt ceiling, causing a crisis that persisted until that October, when the Continuing Appropriations Act of 2014 was signed into law by", "label": 0}
{"summary": "Write a detailed article explaining the key events, background, and outcomes of the 2014 Gaza War (also known as Operation Protective Edge). The article should discuss the reasons for the conflict, including the kidnapping and murder of three Israeli teenagers by Hamas-affiliated militants, Israel's response through Operation Brother's Keeper, and the subsequent escalation of violence. Highlight the role of Hamas, the Israel Defense Forces (IDF), and other political or military stakeholders involved. Additionally, describe the human and geopolitical consequences of this seven-week-long conflict. Ensure the article is well-structured, clear, and informative.", "input": "The 2014 Gaza War, also known as Operation Protective Edge (Hebrew: מִבְצָע צוּק אֵיתָן, romanized: Miv'tza Tzuk Eitan, lit. 'Operation Strong Cliff'), was a military operation launched by Israel on 8 July 2014 in the Gaza Strip, a Palestinian territory that has been governed by Hamas since 2007. Following the kidnapping and murder of three Israeli teenagers in the West Bank by Hamas-affiliated Palestinian militants, the Israel Defense Forces (IDF) initiated Operation Brother's Keeper, in which some 350 Palestinians, including nearly all of the active Hamas militants in the West Bank, were arrested. Hamas subsequently fired a greater number of rockets into Israel from the Gaza Strip, triggering a seven-week-long conflict between the two sides. It was one of the deadliest outbreaks of open conflict between Israel and", "label": 1}
{"summary": "Based on the tragic events on the morning of 18 November 2014, in Jerusalem's Har Nof neighborhood, when two Palestinian men entered the Kehilat Bnei Torah synagogue and perpetrated a violent attack, describe the aftermath and the subsequent investigations. Discuss the differing claims of responsibility from various groups and the response from Israeli authorities, highlighting the complexity and challenges in determining the motivations and organizational affiliations behind such incidents.", "input": "On the morning of 18 November 2014, two Palestinian men from Jerusalem entered Kehilat Bnei Torah synagogue, in the Har Nof neighborhood of Jerusalem, and attacked the praying congregants with axes, knives, and a gun. They killed four dual-nationality worshippers, and critically wounded a responding Druze Israeli police officer, who later died of his wounds. They also injured seven male worshippers, one of whom never woke up from a coma and died 11 months later. The two attackers were then shot dead by the police. Several initial reports claimed that the Popular Front for the Liberation of Palestine (PFLP) had declared responsibility for the attack; Other sources say declarations by PFLP militants were either confused or that the group itself disclaimed responsibility. Israeli authorities stated that 'it seemed", "label": 1}
{"summary": "Write a detailed article explaining the political controversy surrounding the removal of Indonesia as the host of the FIFA U-20 World Cup 2023. Include the reasons behind FIFA's decision, the opposition to Israel's participation due to Indonesia's pro-Palestine stance, the financial sanction imposed on the Football Association of Indonesia (PSSI), and the reactions from Indonesian football fans and players. Explore the broader implications of this decision on sports diplomacy and international relations.", "input": "The removal of Indonesia as FIFA U-20 World Cup 2023 hosts was a political controversy that occurred in March 2023, when FIFA, the world governing body of association football, decided to strip Indonesia of its hosting rights for the 2023 FIFA U-20 World Cup, a youth football tournament that was scheduled to take place in May 2023. The decision was made due to the \"current circumstances\" that arose from Indonesia's opposition to Israel's participation in the tournament, citing Indonesia's pro-Palestine stance and lack of diplomatic ties with Israel. FIFA also imposed a financial sanction on the Football Association of Indonesia (PSSI) for breaching its obligations as a host country. The decision was met with disappointment and anger by many Indonesian football fans and players, who had hoped to", "label": 0}
{"summary": "Describe the 2023 Chinese military exercises surrounding Taiwan, including the context of Taiwanese President Tsai Ing-wen's visit to the U.S., the reaction by the People's Liberation Army (PLA), and key events such as combat readiness patrols and military deployments. Explain the geopolitical tensions and the significance of these developments in the broader framework of international relations.", "input": "The 2023 Chinese military exercises around Taiwan (simplified Chinese: 2023年环台军事演练; traditional Chinese: 2023年環台軍事演練) are a series of ongoing military exercises by the People's Liberation Army (PLA) of the People's Republic of China (PRC) encircling Taiwan (the Republic of China, ROC). On 8 April 2023, the PLA announced the start of \"combat readiness patrols\" and dispatched dozens of fighter jets and several warships toward Taiwan. The exercises occurred in response to Taiwanese president Tsai Ing-wen's visit to US Speaker of the House Kevin McCarthy.On 4 March 2023, McCarthy announced he had planned a meeting with president Tsai, which was scheduled for early April. In response, the PLA made multiple threats toward the Taiwanese government. Tsai arrived in the U.S. on 4 April and met with prominent lawmakers, including McCarthy.", "label": 0}
{"summary": "Describe the impact of the FATCA agreement between Canada and the United States on American citizens residing in Canada and their financial reporting obligations. Consider how this agreement affects not only these individuals but also their families and business associations.", "input": "The FATCA agreement is an international agreement signed between Canada and the United States that allows the implementation of the Foreign Account Tax Compliance Act (an Act of the U.S. Congress) in Canada. It is one of 30 intergovernmental agreements the US has concluded with other countries to implement the FATCA.FATCA requires United States persons, including individuals who live outside the United States, and financial institutions outside the United States, to report the principal amount held in their financial accounts outside of the United States to the Internal Revenue Service (IRS). According to the Canadian Broadcasting Corporation (CBC) there are about one million American citizens living in Canada. This treaty also affects their spouses, children, or anyone with whom they own property, share a business connection, or hold", "label": 1}
{"summary": "Generate a detailed report discussing the floods in South Africa during February-March 2023, which were caused by heavy rainfall linked to the La Niña weather phenomenon. Include information on the seven affected provinces (Eastern Cape, Northern Cape, Mpumalanga, KwaZulu-Natal, and North West), the casualties reported, damages to homes, infrastructure, roads, bridges, crops, and livestock. Highlight specific incidents, such as the fatalities in King Sabata Dalindyebo Local Municipality (Eastern Cape Province) and Komani Town (formerly Queenstown), as well as evacuation efforts in Lekwa Local Municipality and areas near the Vaal, Vanderkloof, and Bloemhof dams along the Orange River (Northern Cape Province).", "input": "The floods in South Africa in February-March 2023 were caused by heavy rainfall as a result of the La Niña weather phenomenon, affecting seven provinces, including Eastern Cape, Northern Cape, Mpumalanga, KwaZulu-Natal, and North West. The floods have caused casualties and damage to homes, businesses, basic infrastructure, roads, bridges and affected crops and livestock. At least twelve people have died across the provinces and others are missing. In addition to that, two more fatalities have been reported in King Sabata Dalindyebo Local Municipality (Eastern Cape Province), and one person in Komani Town (formerly Queenstown). Several people have been evacuated in Lekwa Local Municipality and residents in the area of Vaal, Vanderkloof, and Bloemhof dams along the Orange River (Northern Cape Province) were invited to evacuate after controlled water", "label": 0}
{"summary": "Write a detailed summary about the 'March in March' movement that took place in Australia in March 2014. Highlight the dates, locations, attendance numbers, purpose of the marches, key figures involved, government response, and how the movement was organized.", "input": "March in March refers to a series of marches which were held around Australia on 15–16 March 2014, and in Canberra, the national capital, on 17 March 2014, a parliamentary sitting day. The marches were attended by at least eighty thousand people across Australia and were peaceful (The Sydney Morning Herald reported 112,000). Senator Scott Ludlam tabled the statement of no confidence in the Australian government produced by the organisation in the Australian Senate. Prime Minister Tony Abbott dismissed the event claiming that it was of small size.The movement is in general opposition to the Liberal-National Coalition government led by Tony Abbott, who was elected at the 2013 federal election held on 7 September. It has mostly been organised on social media. The March in March movement has", "label": 1}
{"summary": "Write about the 2023 Backlash professional wrestling event produced by WWE. Include details such as it being the 18th Backlash event, its association with the Raw and SmackDown brand divisions, and its date and location—Saturday, May 6, 2023, at the Coliseo de Puerto Rico José Miguel Agrelot in San Juan, Puerto Rico. Mention its significance as the first WWE event in Puerto Rico since New Year's Revolution in January 2005 and the second Backlash event held outside the continental United States since 2004. Also, explain that the 2023 event marks the return to the original 'Backlash' name, moving away from the 'WrestleMania Backlash' branding of the past two years, but maintaining the post-WrestleMania theme connected to WrestleMania 39.", "input": "The 2023 Backlash is the upcoming 18th Backlash professional wrestling pay-per-view (PPV) and livestreaming event produced by WWE. It will be held for wrestlers from the promotion's Raw and SmackDown brand divisions. The event will take place on Saturday, May 6, 2023, at the Coliseo de Puerto Rico José Miguel Agrelot in San Juan, Puerto Rico. This will be the first WWE event held in Puerto Rico since New Year's Revolution in January 2005, and the second Backlash event ever held outside the continental United States since the 2004 event. After the previous two years were titled \"WrestleMania Backlash\", the 2023 event reverted to its original name while still maintaining its post-WrestleMania concept, with the 2023 event based around the backlash from WrestleMania 39. Puerto Rico native and", "label": 0}
{"summary": "Describe the impact and characteristics of the 2013–2014 Atlantic winter storms in Europe, focusing on the regions most affected and the factors contributing to the severity of these weather events. Include details about the atmospheric conditions that led to the storm surges, large waves, and flooding, as well as the role of high-pressure systems and astronomical tides.", "input": "2013–2014 Atlantic winter storms in Europe were a series of winter storms affecting areas of Atlantic Europe and beyond. The French Atlantic coastal regions (chiefly Brittany), South West and Southern England, West Wales, Ireland, Spanish Atlantic coastal regions (particularly Galicia) were especially affected by a \"conveyor belt\" series of high-precipitation storms (mostly not exceptional for their winds) and by high tides. Many storms were explosively deepened by a strong jet stream, many deepening below 950 hPa. The repeated formation of large deep lows over the Atlantic brought storm surges and large waves which coincided with some of the highest astronomical tides of the year and caused coastal damage. The low pressure areas brought heavy rainfalls which led to flooding, which became most severe over parts of England such", "label": 1}
{"summary": "Write a detailed summary of the 2014 Conference of Western Balkan States, including the reasons for its organization, the key figures involved, and the intended continuity of the conference in future years as part of the Berlin Process.", "input": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of conference came in light of the celebration of the 100th anniversary of the beginning of World War I. It is the first conference in this framework and organizers expressed their desire to continue it in future with Vienna and Paris mentioned as a potential next hosts after Berlin (so called Berlin Process). Günther Oettinger confirmed at conference that event will be organised annually with Vienna as a host city in 2015 and Paris in 2016.The German chancellor announced intention to organize a conference on 7 June 2014. Invitation for participation was sent to all the countries", "label": 1}
{"summary": "Provide a detailed summary of the 2014 Kalbajar incident, including the crossing of Azerbaijanis into Kalbajar district, the disappearance and murder of 17-year-old Smbat Tsakanyan, evidence presented during the trial, and the convictions handed down by the Republic of Artsakh. Discuss the broader context of the Nagorno-Karabakh conflict and any implications or international reactions that may have arisen from this incident.", "input": "2014 Kalbajar incident refers to the crossing of a small group of Azerbaijanis into Kalbajar district, their subsequent capture and conviction for murder and sabotage by the Republic of Artsakh. In July 2014, three ethnic Azerbaijanis crossed Nagorno-Karabakh Line of Contact in to Kalbajar District, then controlled by breakaway Republic of Artsakh forces. This was followed by disappearance of 17-year-old local Smbat Tsakanyan who was later found dead from gunshot wounds and who was last seen walking with the Azerbaijanis in a video used as evidence in the trial. The Azerbaijanis were detained for \"reconnaissance operations in the area on orders from Azerbaijan’s intelligence service,\" as well as kidnapping and killing of Tsakanyan. One of the Azerbaijanis named Hasanov attacked Major Sargis Abrahamyan and his companion Karine Davtyan", "label": 1}
{"summary": "Generate a comprehensive summary of the 35th Lo Nuestro Awards, including details about the event location, date, purpose, broadcast network, hosts, key nominees, and the newly added categories. Highlight significant facts such as the leading nominees and the total number of categories.", "input": "The 35th Lo Nuestro Awards were held at the Dade Arena in Miami on February 23, 2023, to recognize the most popular Spanish-language music of 2022. The ceremony will be broadcast on Univisión and will be hosted by television presenters Alejandra Espinoza and Adrián Uribe and singers Sebastián Yatra and Paulina Rubio.The nominees were announced on January 23, 2023, with Colombian singer Sebastián Yatra leading with ten nominations, followed by Bad Bunny, Becky G, Camilo and Grupo Firme, all with nine. Seven new categories were added increasing the number of categories to thirty-nine, these categories are: Regional Mexican New Artist of the Year, Tour of the Year, Male Pop Artist of the Year, Female Pop Artist of the Year, Tropical Album of the Year, Male Regional Mexican Artist", "label": 0}
{"summary": "Generate a detailed summary and analysis of Banksy's graffiti artwork 'Art Buff,' including its creation, meaning, and subsequent events, such as vandalism and removal, as well as its cultural significance and how it reflects on the broader dynamics of street art.", "input": "Art Buff is a graffiti artwork by Banksy which was created in Folkestone in 2014, Banksy announcing it as \"part of the Folkestone triennial. Kind of\". The work depicts a woman wearing headphones and staring at a plinth, upon which rests a patch of painted-out graffiti. The name of the piece is a play on words, \"buff\" being a slang term for the painting over of graffiti.Reported on 13 October 2014, Art Buff was vandalized with the spray painting of a penis sitting on top of the plinth.During early November 2014 Robin Barton and Bankrobber London organized the removal of Art Buff from its Folkestone location following requests from the owners of the wall, and announced plans to put it up for sale in aid of a cancer", "label": 1}
{"summary": "Write a detailed summary about the 6th Hollywood Critics Association Film Awards and the 1st Hollywood Critics Association Creative Arts Awards, including the event dates, locations, nomination announcements, hosts, top nominated films, and any notable highlights, such as Everything Everywhere All at Once leading the nominations with a total of sixteen.", "input": "The 6th Hollywood Critics Association Film Awards, presented by the Hollywood Critics Association, took place on the evening of February 24, 2023 at the Beverly Wilshire Hotel, Beverly Hills, while the winners of the 1st Hollywood Critics Association Creative Arts Awards were announced earlier in the day on social media platforms. The nominations for both events were announced on the HCA official YouTube channel and app on December 8 and December 15, 2022, respectively; Jalyn Hall, Jude Hill, and Madeleine McGraw announced the December 15 nominations. Comedian Tig Notaro hosted the ceremony.Everything Everywhere All at Once led the nominations with 10, followed by The Banshees of Inisherin with seven. The former also received six HCA Creative Arts Awards nominations, bringing the film's total to sixteen nominations. Everything Everywhere", "label": 0}
{"summary": "Write a comprehensive overview of the Global War on Terrorism (GWOT), focusing on its origins, primary targets, notable military campaigns, and key events. Discuss the September 11 attacks as the catalyst, the involvement of militant Islamist and Salafi jihadist organizations, the fall of the Ba'athist regime in Iraq, and the Iraqi insurgency. Address the official declarations marking the end of the 'war on terror' and explore subsequent American military campaigns in the 2010s.", "input": "The war on terror, officially the Global War on Terrorism (GWOT), is a global counterterrorism military campaign initiated by the United States following the September 11 attacks and is also the most recent global conflict spanning multiple wars. The main targets of the campaign were militant Islamist and Salafi jihadist armed organisations such as Al-Qaeda, the Islamic State, and their international affiliates, which were waging military insurgencies to overthrow governments of various Muslim-majority countries. Other major targets included the Ba'athist regime in Iraq, which was toppled during an invasion in 2003, and various militant factions that fought during the ensuing Iraqi insurgency. The \"war on terror\" was officially declared over in May 2010 and again in May 2013. Other American military campaigns during the 2010s have also been", "label": 1}
{"summary": "Generate a detailed summary of the 2023 Rey de Reyes event, including key matches, winners, the venue, and its significance within professional wrestling. Highlight the main event, notable debuts, and outcomes of other prominent matches.", "input": "The 2023 Rey de Reyes (Spanish for \"2023 King of Kings\") was a professional wrestling tournament and supercard event produced by the Mexican Lucha Libre AAA Worldwide (AAA) promotion. The event was held on February 5, 2023, at Poliforum Zamna in Merida, Yucatan, Mexico. The 2023 event was the 26th Rey de Reyes show and tournament. In the main event match, Sam Adonis defeated Bandido, Pagano, and Hijo del Vikingo to become the 2023 Rey de Reyes. In other prominent matches, Sexy Star II defeated Chik Tormenta, Lady Shani, La Hiedra, and Dalys in a five-way match to become the 2023 Reina de Reinas and Negro Casas made his AAA in-ring debut, losing to Hijo del Vikingo in a Rey de Reyes qualifier that also involved Myzteziz Jr.", "label": 0}
{"summary": "Explain Marchetti's constant and its significance in urban planning and human commuting patterns. Discuss its historical origins, including its attribution to Cesare Marchetti and Yacov Zahavi, and how advancements in transportation have influenced the distance people travel while maintaining a relatively constant travel time.", "input": "Marchetti's constant is the average time spent by a person for commuting each day. Its value is approximately one hour, or half an hour for a one-way trip. It is named after Italian physicist Cesare Marchetti, though Marchetti himself attributed the \"one hour\" finding to transportation analyst and engineer Yacov Zahavi.Marchetti posits that although forms of urban planning and transport may change, and although some live in villages and others in cities, people gradually adjust their lives to their conditions (including location of their homes relative to their workplace) such that the average travel time stays approximately constant. Ever since Neolithic times, people have kept the average time spent per day for travel the same, even though the distance may increase due to the advancements in the means", "label": 0}
{"summary": "Write a detailed summary about the 2023 DFB-Pokal Final, describing its significance, the implications for qualification in other competitions, and how hosting rights for the DFL-Supercup are determined based on the outcome of the match.", "input": "The 2023 DFB-Pokal Final will decide the winner of the 2022–23 DFB-Pokal, the 80th season of the annual German football cup competition. The match will be played on 3 June 2023 at the Olympiastadion in Berlin.The winner will host the 2023 edition of the DFL-Supercup at the start of the following season, and will face the champion of the 2022–23 edition of the Bundesliga, unless the same team wins the Bundesliga and the DFB-Pokal, completing a double. In that case, the runner-up of the Bundesliga will take the spot and host instead. The winner of the DFB-Pokal also earns automatic qualification for the group stage of the 2023–24 edition of the UEFA Europa League. However, if the winner has already qualified for the 2023–24 edition of the UEFA", "label": 0}
{"summary": "Write a detailed summary of the Abkhazian Revolution of 2014, including the key events, reasons behind the uprising, and the consequences such as the resignation of President Aleksandr Ankvab, public unrest in Sukhumi, and the subsequent election of Raul Khajimba. Highlight the role of ethnic tensions and policies regarding ethnic Georgians in Abkhazia.", "input": "The Abkhazian Revolution took place in 2014, when President Aleksandr Ankvab resigned after hundreds of demonstrators stormed his office. After mass protests in the capital Sukhumi and the occupation of his office on 27 May, Ankvab fled to his hometown of Gudauta and ultimately resigned on 1 June, after previously denouncing the demonstration as an attempted coup d'état.The uprising was attributed to public anger with Ankvab over his perceived liberal policy toward ethnic Georgians in Abkhazia, a breakaway republic with limited recognition. Although Abkhazia seceded from Georgia in 1992, the Ankvab administration allowed ethnic Georgians to register as voters and receive Abkhazian passports.The revolution led to an early presidential election being called in August 2014. Opposition leader Raul Khajimba was elected president with a narrow majority of the", "label": 1}
{"summary": "Describe the 2014 Chinese internet failure, detailing its impact, the role of DNS infrastructure, the IP address involved, and the potential causes debated by Chinese officials and independent researchers.", "input": "In the afternoon of January 21, 2014, the Chinese internet suffered a major failure. The country's DNS infrastructure, which is responsible for translating domain names into IP addresses, started directing unrelated domains from various TLDs to the completely unresponsive IP address 65.49.2.178 at 15:10 (UTC+8). As a result, two-thirds of all domestic websites became non-functional, including such high-traffic sites as Baidu and Sina.It is debated what caused this incident. Chinese officials point to the fact that the IP address is owned by Dynamic Internet Technology, an American Falun Gong-affiliated corporation most known for developing the Great Firewall circumvention tool Freegate, and argue that it was caused by external hacking. Independent researchers, however, argue that the incident is more likely caused by a misconfiguration in Great Firewall's DNS poisoning", "label": 1}
{"summary": "Provide an overview of Japanese whaling, covering its historical origins, industrial development, involvement in the global whaling industry, and its evolution under international regulations such as the IWC moratorium. Include details about Japan's resumption of commercial whaling in 2019 and explain the role of the Institute of Cetacean Research in the context of scientific research provisions.", "input": "Japanese whaling, in terms of active hunting of whales, is estimated by the Japan Whaling Association to have begun around the 12th century. However, Japanese whaling on an industrial scale began around the 1890s when Japan started to participate in the modern whaling industry, at that time an industry in which many countries participated. Japan resumed commercial whaling in July 2019, and since then whaling activities have been confined to its territorial waters and exclusive economic zone.During the 20th century, Japan was heavily involved in commercial whaling. This continued until the International Whaling Commission (IWC) moratorium on commercial whaling went into effect in 1986. Japan continued to hunt whales using the scientific research provision in the agreement and Japanese whaling was conducted by the Institute of Cetacean Research.", "label": 1}
{"summary": "Write a detailed summary of the results and structure of the general elections held in Bosnia and Herzegovina on 12 October 2014, including information about the voter turnout, election outcomes for the Presidency, and the composition of the House of Representatives. Highlight the divisions across the Federation of Bosnia and Herzegovina and Republika Srpska, as well as the key elected officials and party performances.", "input": "General elections were held in Bosnia and Herzegovina on 12 October 2014. They decided the makeup of Bosnia and Herzegovina's Presidency as well as national, entity, and cantonal governments. Voter turnout was 54.4%.The elections for the House of Representatives were divided into two; one for the Federation of Bosnia and Herzegovina and one for Republika Srpska. In the presidential election, voters in the Federation re-elected Bosniak Bakir Izetbegović and elected Croat Dragan Čović, while voters in Republika Srpska elected Serb Mladen Ivanić. The Party of Democratic Action emerged as the largest party in the House of Representatives, winning 10 of the 42 seats. While the Bosniak member Bakir Izetbegović was the only member of the tripartite Presidency to be re-elected, Serb member Mladen Ivanić was chosen as the", "label": 1}
{"summary": "Provide a detailed summary of the Berlin 2030 climate-neutral citizens' initiative. Include information about its inception, goals, the referendum process, legal implications, and voter requirements for passing the proposal.", "input": "Berlin 2030 klimaneutral (English: Berlin 2030 climate-neutral) was a citizens' initiative launched in Berlin in 2018. It was the subject of a city-wide referendum scheduled for 26 March 2023, commonly called the Klima-Volksentscheid (English: climate referendum). Voters will be asked whether the Climate Protection and Energy Transition Act of 2016 should be amended. The primary goal of the referendum is to legislate a goal of carbon neutrality by the year 2030, rather than the existing goal of 2045. Since the referendum proposes specific amendments to the law, its result will be legally binding. In order to pass, the proposal must be approved by a majority on the day and receive approval from a quorum of over 25% of registered voters. While there were a majority of votes in", "label": 0}
{"summary": "Write a detailed article about Simon Hall, a British murderer who was initially supported by 'miscarriage of justice' campaigners and advocacy programmes but later confessed to the crime he was convicted of, proving his guilt. Include information about the crime, the victim, the wrongful campaigning efforts on his behalf, and the broader implications of such cases for organizations like Rough Justice and the Criminal Cases Review Commission.", "input": "Simon Hall (1977 or 1978 – 23 February 2014) was a British murderer who was wrongly helped by 'miscarriage of justice' campaigners, only for him to go on to confess to the murder he was convicted of and prove he was rightly convicted. Hall stabbed 79-year-old pensioner Joan Albert to death in her home in Capel St Mary, Suffolk in 2001, and was convicted of her murder two years later. Subsequently, the high-profile miscarriage of justice programme Rough Justice took up his case and aired a programme campaigning for him. Several MPs, Bristol University's 'Innocence Project' campaign group, his mother and girlfriend were also deceived into campaigning for him, and the Criminal Cases Review Commission (which had itself been set up in response to Rough Justice in 1997)", "label": 1}
{"summary": "Write a comprehensive and detailed article about the ongoing Battle of Khartoum, outlining the key events, including the beginning of the battle on 15 April 2023, the role of the Rapid Support Forces (RSF) and the Sudanese Armed Forces (SAF), as well as the escalation of tensions on 13 and 14 April 2023. Discuss the capture of key locations, including Khartoum International Airport, military bases, and the presidential palace, and explore the fears of a widening conflict in the region. Include historical context, the strategic significance of Khartoum, and potential implications of this battle for Sudan and the wider region.", "input": "The Battle of Khartoum is an ongoing battle for control of Khartoum, the capital of Sudan, between the paramilitary Rapid Support Forces (RSF), and the Sudanese Armed Forces. The battle began on 15 April 2023, after the RSF allegedly captured Khartoum International Airport, several military bases, and the presidential palace, starting an escalating series of clashes. It was initially reported that tensions rose in Khartoum and Merowe on 13 April 2023, when RSF forces mobilized. In response, the SAF issued a statement saying \"There is a possibility of confrontation between SAF and RSF forces\" introducing fears of a wider conflict. In the evening of 14 April 2023, RSF forces assaulted the Khartoum International Airport, a military base, and the presidential palace. The fighting spread from Khartoum into its", "label": 0}
{"summary": "Imagine you are exploring a city renowned for its historical monuments and statues. Suddenly, your smartphone buzzes, alerting you to an intriguing feature nearby - a Talking Statue! With just a scan of a QR code, you can listen to pre-recorded voiceovers bringing these statues to life. As you approach the statue of Hans Christian Andersen in Copenhagen, your phone rings, inviting you to hear his story. Considering this innovative project, envisioned by David Peter Fox and expanding across cities like New York, London, and Dublin, describe the experience of interacting with these statues using the Talking Statues app. How does hearing their stories enhance your understanding of history and culture? Share the unique insights and emotions that arise as these monuments 'speak' directly to you through your smartphone.", "input": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian Andersen in the King's Garden in Copenhagen was the first talking statue in the world. Later the idea was applied in Helsinki, New York, London, San Diego, Chicago, Vilnius, Parma, Dublin, Berlin, Manchester, and others. The project works with mobile technology and activated through a QR code found on the statue, when you scan it you will be called. You can also download our app, then you can find the Talking Statues in the world and have it talk to GPS so that they call you on your smartphone when you get close to the statue.", "label": 1}
{"summary": "Write a summary of William Tyrrell's disappearance, including details about his age, location, circumstances, investigation milestones, and subsequent developments in the case.", "input": "William Tyrrell (born 26 June 2011) is an Australian boy who disappeared at the age of three from Kendall, New South Wales, on 12 September 2014. He had been playing at his foster grandmother's house with his sister, and was wearing a Spider-Man suit at the time of his disappearance. For the first seven years of the investigation, Tyrrell was believed to have been abducted. On 12 September 2016, a reward of A$1 million was offered for the recovery of Tyrrell and did not require the arrest, charging or conviction of any person or persons.On 15 November 2021, after receiving new evidence, the New South Wales Police Force renewed the search for Tyrrell in three areas surrounding Kendall, assuming that they were searching for human remains. On 17", "label": 1}
{"summary": "Write a detailed summary of the 95th Academy Awards, including key information such as the date, location, producers, director, host, and notable winners and nominations. Mention the achievements of 'Everything Everywhere All at Once' and other significant winners from the ceremony.", "input": "The 95th Academy Awards was a ceremony held by the Academy of Motion Picture Arts and Sciences (AMPAS) on March 12, 2023, at the Dolby Theatre in Los Angeles, which honored films released in 2022.The event was televised in the U.S. by ABC and was produced by Ricky Kirshner and Glenn Weiss. Weiss was also the director. Comedian and late-night talk show host Jimmy Kimmel hosted the show for the third time, after emceeing the 89th and 90th editions of the ceremony in 2017 and 2018, respectively.Everything Everywhere All at Once led the ceremony with eleven nominations and seven wins, including Best Picture, Best Director and Best Original Screenplay for Daniel Kwan and Daniel Scheinert, and three of the four acting awards. Other winners included All Quiet on", "label": 0}
{"summary": "Write a detailed and factual summary discussing the humanitarian and human rights situation during the early years of the Russo-Ukrainian War (starting in April 2014), with a focus on reports from international organizations. Include information about the actions of pro-Russian separatists in the Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR), as well as documentation of lawlessness, targeted killings, torture, abductions, and attacks on journalists, observers, and Ukrainian unity supporters. Reference findings from the United Nations and Human Rights Monitoring Mission in Ukraine (HRMMU).", "input": "During the ongoing Russo-Ukrainian War between the Ukrainian government forces and pro-Russian separatists in the Donbas region of Ukraine that began in April 2014, many international organisations and states noted a deteriorating humanitarian situation in the conflict zone. A May 2014 report by the United Nations said there had been an \"alarming deterioration\" in human rights in territory held by Russian separatists affiliated with the Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). The UN Human Rights Monitoring Mission in Ukraine (HRMMU) reported growing lawlessness in the region, documenting cases of targeted killings, torture, and abduction. HRMMU also reported threats against, attacks on, and abductions of journalists and international observers, as well as the beatings and attacks on supporters of Ukrainian unity. A report by Human Rights", "label": 1}
{"summary": "Write a detailed article about the American thrash metal band Dark Angel, covering their origins, lineup history, musical style, notable achievements, and their influence in the metal music scene. Include information about their formation in 1981 in Downey, California, and discuss their current lineup, which features drummer Gene Hoglan, guitarists Eric Meyer and Laura Christine, frontman Ron Rinehart, and bassist Mike Gonzalez. Mention the band's numerous lineup changes over the years, noting that with the passing of guitarist Jim Durkin in March 2023, no original members remain in the current lineup. Highlight Meyer’s role as the only member to appear on all their albums, and describe their unique musical style, which earned them the nickname 'The L.A. Caffeine Machine.' Explore their influence on the thrash metal genre despite not achieving mainstream success.", "input": "Dark Angel is an American thrash metal band from Downey, California, that formed in 1981. The band's current lineup includes drummer Gene Hoglan, guitarists Eric Meyer and Laura Christine, frontman Ron Rinehart and bassist Mike Gonzalez. In its history, they have gone through many lineup changes, and as of guitarist Jim Durkin's death in March 2023, there are no original members left in the current lineup of Dark Angel. Meyer, who joined in 1984, is the only member to appear on all of their albums. Dark Angel's over-the-top style (extremely fast, heavy and lengthy songs with many tempo changes, lyrics, and extended instrumental parts) earned them the nickname \"The L.A. Caffeine Machine\". Despite never achieving mainstream success, the band is often credited as one of the leaders of", "label": 0}
{"summary": "Write a detailed article explaining the Operation Car Wash (Operação Lava Jato) in Brazil, which was a major criminal investigation by the Federal Police of Brazil's Curitiba branch. Discuss its origins in March 2014 under investigative judge Sérgio Moro, its transition to Judge Luiz Antônio Bonat in 2019, and its significance as the largest corruption investigation in Brazilian history. Include details on its impact, involving Petrobras officials, politicians (including presidents, legislative leaders, and state governors), and top businessmen from influential companies. Describe the findings, the scope of the investigation with over a thousand warrants, and the eventual disbandment of the task force on February 1, 2021. Explore how the investigation evolved from a money laundering case into exposing systemic corruption at the highest levels of power.", "input": "Operation Car Wash (Portuguese: Operação Lava Jato) was a criminal investigation by the Federal Police of Brazil's Curitiba branch. It began in March 2014 and was initially headed by investigative judge Sérgio Moro, and in 2019 by Judge Luiz Antônio Bonat. It has resulted in more than a thousand warrants of various types. According to the Operation Car Wash task force, investigations implicate administrative members of the state-owned oil company Petrobras, politicians from Brazil's largest parties (including presidents of the Republic), presidents of the Chamber of Deputies and the Federal Senate, state governors, and businessmen from large Brazilian companies. The Federal Police consider it the largest corruption investigation in the country's history. The taskforce was officially disbanded on 1 February 2021.Originally a money laundering investigation, it expanded to", "label": 1}
{"summary": "Explain the events and causes of the Euromaidan protests in Ukraine, starting with the initial decision by President Viktor Yanukovych not to sign the European Union–Ukraine Association Agreement. Include details about the role of Russia, the demands of the protesters, and the issues they opposed such as government corruption, abuse of power, and human rights violations.", "input": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with large protests in Maidan Nezalezhnosti (Independence Square) in Kyiv. The protests were sparked by President Viktor Yanukovych's sudden decision not to sign the European Union–Ukraine Association Agreement, instead choosing closer ties to Russia and the Eurasian Economic Union. Ukraine's parliament had overwhelmingly approved of finalizing the Agreement with the EU, but Russia had put pressure on Ukraine to reject it. The scope of the protests widened, with calls for the resignation of Yanukovych and the Azarov government. Protesters opposed what they saw as widespread government corruption, abuse of power, human rights violations, and the influence of", "label": 1}
{"summary": "Provide a detailed summary of the 8th Annual Latin American Music Awards, held on April 20, 2023. Include information about the event's purpose, location, broadcasting details, notable hosts, and any significant changes in network partnerships. Also, discuss the timeline including when the nominations were announced.", "input": "The 8th Annual Latin American Music Awards was held on April 20, 2023, to recognize outstanding achievements for artists in the Latin music industry of 2022, voted by the public.The ceremony will took place at the MGM Grand Arena in Las Vegas, United States, and was broadcast simultaneously on Univision, UniMás and Galavisión in the United States, and Canal 5 in México. This marks the first time in the history of the awards that the ceremony was broadcast on Univision instead of Telemundo, this was the result of TelevisaUnivision acquiring rights to the ceremony from Dick Clark Productions in September 2022. It was hosted by Argentine-Puerto Rican actor Julián Gil, Mexican presenter Galilea Montijo, Dominican actor and model Clarissa Molina and Dominican singer Natti Natasha.The nominations were announced", "label": 0}
{"summary": "Write a detailed summary of the 2013–2014 Israeli–Palestinian peace talks, covering key events, individuals involved, and the role of various parties. Include details about the start of the negotiations, the attempts made by U.S. Secretary of State John Kerry to restart the peace process, Martin Indyk's role as U.S. envoy, and the opposition from Hamas. Also, discuss the proposed timeline for the negotiations and their intended goal of reaching a final resolution by mid-2014.", "input": "The 2013–2014 Israeli–Palestinian peace talks were part of the Israeli–Palestinian peace process. Direct negotiations between Israel and the Palestinians began on 29 July 2013 following an attempt by United States Secretary of State John Kerry to restart the peace process. Martin Indyk of the Brookings Institution in Washington, D.C. was appointed by the US to oversee the negotiations. Indyk served as U.S. ambassador to Israel and assistant secretary of state for Near East affairs during the Clinton administration. Hamas, the Palestinian government in Gaza, rejected Kerry's announcement, stating that Palestinian president Mahmoud Abbas has no legitimacy to negotiate in the name of the Palestinian people.The negotiations were scheduled to last up to nine months to reach a final status to the Palestinian-Israeli conflict by mid-2014. The Israeli negotiating", "label": 1}
{"summary": "Analyze the influence of the Arab Spring on protest movements in Arab-majority countries in North Africa and the Middle East. Discuss how these protests have varied in their objectives, from minor policy changes to efforts to overthrow existing political systems. Provide examples of countries where protests led to significant national changes and contrast them with nations where protests were quickly suppressed.", "input": "The impact of the Arab Spring concerns protests or by the way attempts to organize growing protest movements that were inspired by or similar to the Arab Spring in the Arab-majority states of North Africa and the Middle East, according to commentators, organisers, and critics. These demonstrations and protest efforts have all been critical of the government in their respective countries, though they have ranged from calls for the incumbent government to make certain policy changes to attempts to bring down the current political system in its entirety. In some countries, protests have become large or widespread enough to effect change at the national level, as in Armenia, while in others, such as Djibouti, were swiftly suppressed.Protests considered to be inspired by the Arab Spring have taken place", "label": 1}
{"summary": "Continue the narrative focusing on the developments following the announcement regarding Serbian citizens receiving entry and exit documents when entering Kosovo. Describe the political and social impact these changes had on the region, the responses from both the Kosovan and Serbian governments, and any international reactions or involvement in addressing the tensions. Additionally, explore the historical context of Kosovo's declaration of independence and the impact of prior agreements on current relations.", "input": "Beginning on 31 July 2022, tensions between Serbia and Kosovo heightened due to the expiration of the eleven-year validity period of documents for cars on 1 August 2022, between the government of Kosovo and the Serbs in North Kosovo. Kosovo, which declared independence in 2008, signed an agreement with Serbia in 2011 that concluded on the use of license plates in North Kosovo. This agreement was supposed to change license plates from the ones that were issued by Serbia to neutral ones. The agreement was extended in 2016 and it expired in 2021 after which a crisis occurred and it ended with an agreement that ended the ban of Kosovo-issued license plates in Serbia. After the announcement that Serbian citizens who enter Kosovo will receive entry and exit", "label": 0}
{"summary": "Write a detailed narrative describing the mysterious disappearance of Atsumi Yoshikubo, a 45-year-old Japanese woman, during her trip to Yellowknife in the Northwest Territories, Canada in October 2014. Include key details such as her last known sighting by a passing motorist, her unclaimed luggage at the hotel, and footage from the hotel's security camera that sheds light on her final days. Explore the atmosphere surrounding the investigation and the impact it had on the local community.", "input": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later, after seeing stories in the local media that 45-year old Atsumi Yoshikubo (吉窪昌美) who had been visiting the city from her home in southern Japan, had gone missing, she reported the sighting. It was the last time she was seen alive. Yoshikubo's absence was first noted five days after that sighting, when staff at her hotel noticed she had not checked out two days after her stay was due to have ended. In her room they found her luggage, still packed; she had apparently never boarded her flight home. Footage from the hotel's security camera showed", "label": 1}
{"summary": "Compose a detailed account of the third edition of the Champs-Élysées Film Festival, held from June 11 to June 17, 2014. Include key details such as the Honorary Presidents Jacqueline Bisset and Bertrand Tavernier, and Guests of Honor like Keanu Reeves, Agnès Varda, Whit Stillman, and Mike Figgis. Highlight the attendance figures, number of films screened, and notable film presentations, including Ronit Elkabetz and Shlomi Elkabetz's Gett: The Trial of Viviane Amsalem at the Closing Ceremony. Discuss the competitive categories, including American feature-length films, American Shorts, and French Shorts, as well as the premieres and special selections such as TCM Cinema Essentials and Great French Classics. Note any masterclasses held by the Honorary Presidents and presentations by the Guests of Honor.", "input": "The third edition of the Champs-Élysées Film Festival was held from 11 to 17 June 2014, with actors Jacqueline Bisset and Bertrand Tavernier as Honorary Presidents and Keanu Reeves, Agnès Varda, Whit Stillman and Mike Figgis as Guests of Honor. More than 120,000 people attended the Festival, with more than 110 films screened. Ronit Elkabetz and Shlomi Elkabetz's Gett: The Trial of Viviane Amsalem was shown at the Closing Ceremony. Along with its competitive Official Selections for American feature-length films, American Shorts and French Shorts, the Festival presented a wide selection of important American and French movie premieres, the TCM Cinema Essentials, a thirteen-film selection of American classics, and the Great French Classics, a five-film selection. Both Honorary Presidents held masterclasses, and the Guests of Honor presented each", "label": 1}
{"summary": "Write a detailed and factual overview of the 2023 Las Anod conflict, highlighting the key parties involved, the timeline of events, the humanitarian impact, and the geographical regions affected. Include information on the causes of the conflict, the response from local and international actors, and the ongoing consequences of the fighting, as seen in the violent crackdown on civil protests, the declaration by the supreme Garad of Dhulbahante, and the displacement of thousands of refugees, as well as the shelling of civilians by Somaliland troops as reported on March 16.", "input": "The 2023 Las Anod conflict is an ongoing armed conflict between the Somaliland National Army and militias of the Dhulbahante, Majeerteen and Warsangali clans that ensued in Las Anod, the capital of the Sool region. Fighting erupted on February 6 after Somaliland security forces held a violent crackdown on civil protests. On February 8, the supreme Garad of Dhulbahante, Garad Jama Garad Ali, declared an intent to secede and reunite with the Federal Government of Somalia.The conflict has killed over 300 people and displaced 153,000-203,000 refugees, either externally to Buuhodle and the Ethiopian border or internally to SSC-Khatumo Forces controlled districts like Taleex, Xudun, Buuhodle etc. and Garowe, Galkacyo, Burtinle and other cities in Puntland. On March 16, Somaliland troops were reported to be shelling civilians from the", "label": 0}
{"summary": "Write a detailed and comprehensive analysis of the events in Northern Afghanistan between April 2009 and 2014, focusing on the evolving security situation, the involvement of German forces, and their response to the rising insurgency. Include specifics about how tensions escalated, key attacks such as the one following Angela Merkel's visit, and the strategic decisions leading to increased troop deployments and coordinated operations involving the German-led Regional Command North and the American ISAF contingent.", "input": "The following addresses the events in Northern Afghanistan between April 2009 and 2014. While this part of the country had long been relatively peaceful compared to the all-out war zones of the south and east, tensions would flare up again in 2008 when the German soldiers deployed to the area came under attack more often, leading to the deaths of the several soldiers. Previously hindered by national caveats, the deteroriating security situation prompted the German-led Regional Command North to launch a series of operations to take on the rising insurgency. Concerted operations began after an insurgent attack on PRT Kunduz within minutes of German Chancellor Angela Merkel's departure from a visit. Within two years, the German presence would be doubled and additional reinforcements from the American ISAF contingent", "label": 1}
{"summary": "Write a detailed prediction and analysis for the 2023 Night of Champions event, focusing on how the shift to a Saturday in Saudi Arabia might impact the dynamics. Discuss the significance of this event within WWE's ongoing partnership with Saudi Vision 2030 and speculate whether the traditional theme of having all main roster championships contested will continue this year.", "input": "The 2023 Night of Champions is the upcoming 10th Night of Champions professional wrestling pay-per-view (PPV) and livestreaming event produced by the American promotion WWE. It will be held for wrestlers from the promotion's Raw and SmackDown brand divisions. The event is scheduled to be held on Saturday, May 27, 2023, at the Jeddah Super Dome in Jeddah, Saudi Arabia. This will be the first Night of Champions held on a Saturday and the first held in Saudi Arabia, subsequently being the ninth event that WWE will hold in the country under a 10-year partnership in support of Saudi Vision 2030. The previous theme of Night of Champions was that all main roster championships were contested at the event, but it is unclear if that theme will carry", "label": 0}
{"summary": "Provide a concise summary of the 2014 Australian federal budget, highlighting the key features, including its focus on deficit reduction, changes to welfare, investments in infrastructure, and public reception following its release.", "input": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since the Coalition's victory in the 2013 Australian federal election. Treasurer Joe Hockey presented the budget to the House of Representatives on 13 May 2014.The budget featured significant changes to address a perceived deficit crisis. This included a proposed dramatic downsizing of government bureaucracy, and contained significant changes to welfare, new initiatives for a medical research fund and spending on roads. A budget surplus exceeding 1% of GDP was not expected until 2023.The austere budget faced widespread criticism and was overwhelmingly rejected by the Australian public as reflected in all opinion polls after its release. Opposition to", "label": 1}
{"summary": "Write a detailed description of the COVID-19 Response Recognition Award, explaining its purpose, recipient eligibility, and the form in which the awards are presented. Include information about the number of anticipated recipients, the role of Mayer and Toye in the award design, and the criteria for individual and organizational recognition.", "input": "The COVID-19 Response Recognition Award is a service award established by the New Zealand government in 2022 to recognise individuals and organisations who contributed to New Zealand’s frontline workforce COVID-19 response. The awards will be distributed from late January 2023, and it is expected that there will be about 80,000 individual recipients.Awards to individuals will take the form of a lapel pin and certificate, designed and manufactured by Mayer and Toye of Wellington. People eligible to receive the award include those who worked for at least a month in total as part of the managed isolation and quarantine (MIQ) system, at the border, in COVID-19 testing, vaccination or contact tracing, or as medical staff caring for COVID-19 patients.The organisational award, in the form of a digital certificate, will", "label": 0}
{"summary": "Provide a comprehensive summary of the essential findings and conclusions of the Report of the Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea, focusing on the systematic violations of human rights and the determination of crimes against humanity by the North Korean government.", "input": "The Report of the Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea is the landmark document resulting from the investigations on human rights in North Korea commissioned by the United Nations Human Rights Council in 2013 and concluded in 2014.The report unequivocally concluded that the North Korean government systematically violated human rights including freedom of thought, expression and religion; freedom from discrimination; freedom of movement and residence; and the right to food.The Commission further determined that North Korea had committed crimes against humanity and manifestly failed to uphold its responsibility to protect. These crimes entail \"extermination, murder, enslavement, torture, imprisonment, rape, forced abortions and other sexual violence, persecution on political, religious, racial and gender grounds, the forcible transfer of populations, the enforced disappearance", "label": 1}
{"summary": "Generate a detailed summary of the professional wrestling event series Fantastica Mania 2014, highlighting its co-production by NJPW and CMLL, the significance of hosting five events in one year, and the venues where the events were held.", "input": "Fantastica Mania 2014 was a series of five professional wrestling events co-produced by Japanese promotion New Japan Pro-Wrestling (NJPW) and Mexican promotion Consejo Mundial de Lucha Libre (CMLL) taking place between January 15 and 19, 2014. 2014 was the fourth year in which NJPW and CMLL come together to produce Fantastica Mania events, but the first time they held five events in one year, compared to two events in 2011 and 2012 and three in 2013. 2014 also marked the first time Fantasticamania events were held outside of Tokyo's Korakuen Hall, with the January 14 taking place in Osaka, Osaka at the Bodymaker Colosseum, the January 15 event in Kyoto, Kyoto at the KBS Hall and the January 17 event in Tokyo's Shin-Kiba 1st Ring, while the January", "label": 1}
{"summary": "Discuss the circumstances surrounding the two motions of no confidence against the French minority government led by Prime Minister Élisabeth Borne in March 2023. Include details about the parties involved in proposing the motions, the constitutional mechanism used by the government that prompted these motions, and the outcome of the vote in the National Assembly. Highlight the significance of the narrow margin by which the cross-party motion was defeated.", "input": "Two motions of no confidence in the minority government of Prime Minister Élisabeth Borne were tabled on 17 March 2023 in the French National Assembly. One motion was proposed by a cross-party alliance that included the left-wing NUPES and the regionalist LIOT (introduced by Bertrand Pancher and defended by Charles de Courson); the other by the right-wing populist National Rally (introduced by Marine Le Pen and defended by Laure Lavalette). The two motions were introduced in response to the government's use of constitutional article 49.3 to pass a controversial law that raised the retirement age from 62 to 64. On 20 March, both motions were voted down. The cross-party motion failed by a margin of 9 votes, the slimmest since 1990.The National Rally (RN) voted in favour of", "label": 0}
{"summary": "Write a detailed summary of the Toronto Rock's 2014 lacrosse season in the National Lacrosse League (NLL), highlighting key events such as their acquisition of goaltender Brandon Miller at the trade deadline, Garrett Billings' ACL injury and its impact, and the team's performance in the Eastern division, including their late-season four-game winning streak and their positioning relative to the Buffalo Bandits.", "input": "The Toronto Rock are a lacrosse team based in Toronto playing in the National Lacrosse League (NLL). The 2014 season was the 17th in franchise history, and 16th as the Rock. After an up-and-down start to the season, the Rock acquired goaltender Brandon Miller from the Philadelphia Wings at the trade deadline hoping to revitalize their shaky defense. On April 5, star forward Garrett Billings tore his ACL during a game against the Vancouver Stealth and was lost for the remainder of the season. Despite losing the league's scoring leader, the Rock won that game, which started a four-game winning streak to finish the regular season and clinch second place in the Eastern division ahead of the slumping Buffalo Bandits. But the Bandits ended their 8-game losing streak", "label": 1}
{"summary": "Based on the provided information, generate a detailed analysis of the West and Central African cholera outbreak declared in June 2014, focusing on its impact and spread up to January 25, 2015. Include statistics such as the number of registered deaths, reported cases, and the case fatality rate (CFR) across 11 countries. Examine the regions with high CFRs, particularly in the Sahelian area, and identify the most affected countries, highlighting Ghana's severe outbreak since 1982. Discuss the ongoing situations in specific regions like Greater Accra and Volta in Ghana, and summarize the status of the outbreak by January 11, referencing the positions of the Democratic Republic of the Congo, Ghana, and Nigeria.", "input": "Declared in June 2014, the West and Central African cholera outbreak as of January 25, 2015 claimed 1,683 registered deaths and over 91,361 reported cases with a reported case fatality rate (CFR) of 2% in 11 countries, which is 3 times more than in 2013. The case fatality ratio is high in the Sahelian area, equal or greater than 2%, especially in Nigeria, Chad, Cameroon and Niger. Nigeria, Ghana and Democratic Republic of the Congo being the most affected countries with Ghana reporting its worst outbreak since 1982.In January 2015 the Greater Accra Region and Volta region still reported cases of Cholera while in the rest of Ghana the outbreak was declared over. As of January 11 the Democratic Republic of the Congo, Ghana and Nigeria are the", "label": 1}
{"summary": "Generate a detailed narrative on Arturo, a polar bear who led a controversial life in Mendoza Zoological Park in Argentina. Include aspects such as his birth in the United States, relocation to Argentina, and the tragic loss of his companion Pelusa. Highlight the controversy regarding his living conditions, especially the extreme temperatures he endured and the inadequate depth of his cage pool. Discuss the campaign by animal rights activists led by Laura Morales, aiming to relocate Arturo to Assiniboine Park Zoo in Canada, and the impact of the petition to change his fate.", "input": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United States and transferred to Argentina in 1993. His companion, a female named Pelusa, died of cancer in 2012. The living conditions of the cage Arturo resided in were controversial, as temperatures reach up to 40 °C (104 °F) in Argentina, and the pool in Arturo's cage was only 51 centimetres (20 in) deep. Animal rights activists had, in response, dubbed Arturo the \"world's saddest animal\" and promoted a petition to have him moved to Assiniboine Park Zoo, a zoo in Winnipeg, Manitoba, Canada. The petition was created by Laura Morales of Hamilton, Ontario. It gained considerable", "label": 1}
{"summary": "Based on the landmark case of Supriyo a.k.a Supriya Chakraborty & Abhay Dang v. Union of India and other connected cases being heard by a 5-judge Constitution Bench of the Supreme Court of India in 2023, imagine a scenario where the court is considering extending the right to marry and establish a family to queer Indians. Discuss the potential constitutional provisions and rights that support the petitioners' request, such as the right to equality, dignity, personal liberty, privacy, personal autonomy, and freedom of conscience. Consider also the societal and legal implications of such a decision on the landscape of marriage rights in India. How might these cases shape the future of LGBTQ+ rights in the country?", "input": "Supriyo a.k.a Supriya Chakraborty & Abhay Dang v. Union of India thr. Its Secretary, Ministry of Law and Justice & other connected cases (2023) is an ongoing collection of landmark cases of the Supreme Court of India, which are set to consider whether to extend right to marry and establish a family to queer Indians. A 5-judge Constitution Bench, consisting of Chief Justice of India D.Y. Chandrachud, Justice S.K. Kaul, Justice Ravindra Bhat, Justice Hima Kohli and Justice P.S. Narasimha, will hear 20 connected cases brought by 52 petitioners.The petitioners, consisting of queer couples and individuals, request recognition of the right to marry and establish a family based on protections from discrimination, the right to equality, dignity, personal liberty, privacy and personal autonomy, and freedom of conscience and", "label": 0}
{"summary": "Write a detailed history of the American band Cold Water Flat, including its formation, key members, significant events, recordings, and eventual disbandment. Highlight the connection between Paul Janovitz and Buffalo Tom, the band's opportunities with Play It Again Sam and MCA Records, and the impact of college radio airplay on their career. Mention what happened to Janovitz after the disbandment.", "input": "Cold Water Flat was an American band formed in 1990 by Paul Janovitz (vocals and guitar), Ted Silva (bass) and Paul Harding (drums) when the trio studied at University of Massachusetts Amherst. Paul Janovitz is the younger brother of Bill Janovitz, lead singer and songwriter of Buffalo Tom. They began playing shows in Boston before Janovitz moved to New York; the group nearly split up, but when European label Play It Again Sam offered to release an album, they reconsidered. In 1995, they signed with MCA Records and released a self-titled second album, recorded at Fort Apache Studios, but despite getting some airplay mainly in US college radio stations the band did not reach a wider audience. Soon after the group disbanded, Janovitz went on to join Dragstrip", "label": 0}
{"summary": "Write a detailed summary of the international human rights case, Karen Petrosyan v. Azerbaijan, highlighting the key events and allegations involved. Discuss the role of the European Court of Human Rights and the claims made by Artush Petrosyan regarding the treatment and death of his son while in Azerbaijani captivity. Include the implications of the case on international human rights law and any significant outcomes from the judgment in the application no. 32427/16.", "input": "Karen Petrosyan v. Azerbaijan was an international human rights case regarding the rights of Artush Petrosyan and his son Karen Petrosyan – an Armenian national from Chinari village, Tavush province of Armenia, who died while in captivity in Azerbaijan in 2014. The judgment of the European Court of Human Rights on the case originated in an application (no. 32427/16) against the Republic of Azerbaijan lodged with the Court under the Convention for the Protection of Human Rights and Fundamental Freedoms by the applicant, Artush Petrosyan, on 25 April 2016. He Submitted that his son had been publicly humiliated, tortured and killed by decapitation by Azerbaijani State agents and that \"his son’s body had not been repatriated in a timely manner, that there had been no effective investigation on", "label": 1}
{"summary": "In April 2023, a major leak of classified intelligence documents from the United States sparked widespread attention across social media platforms like Twitter, Telegram, and 4chan. Allegedly, Jack Teixeira, an airman first class with the Massachusetts Air National Guard, took photographs of these documents at his parents' home and initially shared them on Discord, specifically on a server called 'Thug Shaker Central.' The information, some of which dates back to October 2022, primarily concerns the ongoing Russo-Ukrainian War, along with intelligence evaluations on countries such as North Korea, China, Iran, and the United Arab Emirates. By late February and early March 2023, these documents had surfaced on other Discord servers, discussing diverse topics like YouTube content and Minecraft. With the story developing further, a user on 4chan escalated the leak in April, sharing more of the sensitive content online. Generate a continuation of this story, exploring the potential impacts and reactions from the global community.", "input": "In April 2023, two sets of classified foreign intelligence documents of the United States began circulating on Twitter, Telegram, and 4chan. Jack Teixeira, an airman first class of the Massachusetts Air National Guard, had allegedly photographed printouts of the documents at his parents' home in Dighton, Massachusetts and posted them to the instant messaging platform Discord on a server named \"Thug Shaker Central\". The earliest posts dated to October 2022. The documents are primarily related to the Russo-Ukrainian War, but also include foreign intelligence assessments concerning nations including North Korea, China, Iran, and the United Arab Emirates. A subset of documents were shared to Discord servers for a YouTuber and the sandbox video game Minecraft in late February and early March 2023. In April, a 4chan user posted", "label": 0}
{"summary": "Based on the information provided, consider the implications of the disappearance of Malaysia Airlines Flight 370. Discuss the role that satellite communications played in tracking the aircraft's location and events following its disappearance. How did the collaboration between Malaysia and the Australian Transport Safety Bureau contribute to the investigation?", "input": "The analysis of communications between Malaysia Airlines Flight 370 and Inmarsat's satellite telecommunication network provide the primary source of information about Flight 370's location and possible in-flight events after it disappeared from military radar coverage at 2:22 Malaysia Standard Time (MYT) on 8 March 2014 (17:22 UTC, 7 March), one hour after communication with air traffic control ended and the aircraft departed from its planned flight path while over the South China Sea. Flight 370 was a scheduled commercial flight with 227 passengers and 12 crew which departed Kuala Lumpur, Malaysia at 0:41 and was scheduled to land in Beijing, China at 6:30 China Standard Time (6:30 MYT; 22:30 UTC, 7 March). Malaysia has worked in conjunction with the Australian Transport Safety Bureau to co-ordinate the analysis, which", "label": 1}
{"summary": "Write a detailed analysis of the Salvadoran gang crackdown, known as the Régimen de Excepción (State of Exception) and the Guerra Contra las Pandillas (War Against the Gangs). Discuss its origins, including the crime spike in March 2022 that led to the crackdown, the government's response to the crisis, and the controversial measures implemented, such as the suspension of rights and expanded powers of law enforcement. Additionally, evaluate the social and legal consequences, including the arrest of over 67,203 individuals accused of gang affiliations and the resulting overcrowding in detention facilities. Provide insights into the broader implications for human rights, governance, and the rule of law in El Salvador.", "input": "The Salvadoran gang crackdown, referred to in El Salvador as the Régimen de Excepción (Spanish for State of Exception) and the Guerra Contra las Pandillas (Spanish for War Against the Gangs), began in March 2022 in response to a crime spike between 25 and 27 March 2022, when 87 people were killed in El Salvador. The Salvadoran government blamed the spike in murders on criminal gangs in the country, resulting in the country's legislature approving a state of emergency that suspended the rights of association and legal counsel, and increased the time spent in detention without charge, among other measures that expanded the powers of law enforcement in the country. As of 12 April 2023, 67,203 people accused of having gang affiliations have been arrested, which has overcrowded", "label": 0}
{"summary": "Write an article about the 19th British Academy Video Game Awards hosted by BAFTA on 30 March 2023. Include details about the location, the host, the livestream coverage, and significant achievements such as the most nominated game, God of War Ragnarök, and its awards. Mention highlights from the event, including red carpet coverage and the exclusive streaming platform.", "input": "The 19th British Academy Video Game Awards were hosted by the British Academy of Film and Television Arts on 30 March 2023 to honour the best video games of 2022. Held at the Queen Elizabeth Hall in London, the ceremony was hosted by esports presenter Frankie Ward, taking over from Elle Osili-Wood who hosted the previous two ceremonies. The ceremony was livestreamed exclusively on BAFTA's Twitch channel, hosted by games journalist Julia Hardy and comedian Inel Tomlinson. Red carpet coverage was presented by Eurogamer's Aoife Wilson. Sony Interactive's God of War Ragnarök received the most nominations, with fifteen, becoming the most nominated game in the history of the BAFTA Games Awards. While God of War Ragnarök won the most awards at the ceremony, with six, the top honour,", "label": 0}
{"summary": "Write a comprehensive explanation of the labour strikes and industrial disputes occurring in the United Kingdom since May–June 2022, focusing on the causes, industries affected, union involvement, key events like the railway strikes, public support campaigns such as Enough is Enough!, and the broader context of inflation and worker demands for pay increases.", "input": "Since May–June 2022, a series of labour strikes and industrial disputes have occurred in various industries of the United Kingdom's economy as workers walked out over pay and conditions. The strikes took place with rising inflation, and demands for pay increases that would keep pace with this inflation. The strikes began on 15 June 2022 after members of the National Union of Rail, Maritime and Transport Workers (RMT) voted to strike over planned changes to their pay and working conditions. They were soon joined by other railway unions, and a series of one-day strikes halted trains in many parts of the British mainland. Train services operated at 20% of normal capacity on strike days. Public support for the strikes was organised through the Enough is Enough! campaign. With", "label": 0}
{"summary": "Write a detailed account of the mysterious disappearance of Lars Joachim Mittank, a German man who vanished on July 8, 2014, near Varna Airport in Bulgaria. Include his background, the events leading to his disappearance, his strange behavior while in Bulgaria, his final documented movements at the airport, and the lasting impact and public interest surrounding his case. Highlight possible theories and unresolved questions.", "input": "Lars Joachim Mittank (born February 9, 1986) is a German man who disappeared on July 8, 2014, near Varna Airport in Varna, Bulgaria. Mittank was vacationing at the Golden Sands resort, where he was supposedly involved in a fight, and was subsequently unable to fly home with his friends for health reasons. Mittank was documented acting strangely while alone in Bulgaria. He called home to his mother claiming that people were trying to kill him. On the day when he was supposed to fly home, Mittank went to the Varna Airport to consult with a doctor. He was later seen on airport security footage running out of the airport and towards an adjacent forest. He has never been seen since. The case has generated intense interest, and the", "label": 1}
{"summary": "Provide an in-depth explanation of the concept of Targeted Poverty Alleviation as introduced by Xi Jinping, including its origins, purpose, and significance in China's broader poverty alleviation strategy. Discuss how this strategy contributes to the Chinese Communist Party's century goal of building a 'moderately prosperous society' and relate it to the Four Comprehensives. Additionally, explore the role of the Chinese government in officially adopting this strategy in 2014 and related remarks made by leaders like Chinese premier Li Keqiang regarding resource consolidation and implementation at the local government level.", "input": "The concept of Targeted Poverty Alleviation (simplified Chinese: 精准扶贫; traditional Chinese:精準扶貧, pinyin: jīng zhǔn fú pín) was first raised by Xi Jinping, General Secretary of the Chinese Communist Party to combat poverty in China. Targeted poverty alleviation plays into China's poverty alleviation strategy, and is to contribute to the Party's century goal of “comprehensively building a “moderately prosperous society” that is the first objective of Xi Jinping’s agenda of the Four Comprehensives. In his speeches, Xi Jinping emphasizes that without solving the poverty problem in rural areas, China cannot become a moderately prosperous society.The Targeted Poverty Alleviation Strategy was officially adopted by the Chinese government in 2014. Chinese premier, Li Keqiang, said in his government report in March 2014, “local governments need to merge poverty alleviation resources….and take", "label": 1}
{"summary": "Based on the historical context of the presidential elections held in Croatia on 28 December 2014 and 11 January 2015, describe the significance of the results, particularly noting the impact of having Kolinda Grabar-Kitarović become Croatia's first female president. Discuss the implications of such a development in a political landscape that saw only four candidates, the lowest since 1997, and the role of incumbency in Croatian elections. Consider the factors contributing to the close election results, including the necessity of a run-off due to no candidate securing 50% of the vote in the first round and how these dynamics might influence the future electoral processes in Croatia.", "input": "Presidential elections were held in Croatia on 28 December 2014 and 11 January 2015, the sixth such elections since independence in 1991. Only four candidates contested the elections, the lowest number since 1997. Incumbent President Ivo Josipović, who had been elected as the candidate of the Social Democratic Party in 2009–2010 but ran as an independent, was eligible to seek reelection for a second and final five-year term. As no candidate received 50% of the vote in the first round in December 2014, a run-off took place in January 2015 between the two candidates with the most votes; Josipović and Kolinda Grabar-Kitarović. Grabar-Kitarović went on to win the elections by a slim margin of 32,509 votes or 1.48%, making her Croatia's first female president.The elections were the second", "label": 1}
{"summary": "Create a detailed summary of the International Year of Basic Sciences for Sustainable Development, highlighting its proclamation by the United Nations, its goals and significance in advancing sustainable development, and the role of basic sciences in improving societal well-being and global peace. Include information on key events, such as the opening ceremony in Paris and the planned closure at CERN, and mention the involvement of the International Union of Pure and Applied Physics and other scientific unions.", "input": "The International Year of Basic Sciences for Sustainable Development was proclaimed by the 76th session of the United Nations General Assembly 2 December 2021 for 2022, stressing that the applications of basic sciences are vital for advances in medicine, industry, agriculture, water resources, energy planning, environment, communications and culture, and that basic sciences rupture technologies respond to the needs of humankind by providing access to information and increasing societal well-being, and promoting peace through improved collaboration toward Sustainable Development Goals (SDGs). The official opening ceremony of the year took place in UNESCO headquarters in Paris on 8 July 2022. The official closure is planned to take place at CERN in Geneva on 15 December 2023.The International Union of Pure and Applied Physics (IUPAP) and 28 other science unions", "label": 0}
{"summary": "Discuss the key components and impacts of the Brazilian Anti-Corruption Act, officially known as 'Law No. 12,846' or the Clean Company Act, enacted in 2014. What are the primary objectives of this law, and how does it target corrupt practices among business entities in Brazil? Explore the mechanisms for reducing penalties through leniency agreements and examine how this law differentiates between juridical persons and individuals in terms of legal accountability. Additionally, analyze the financial implications for the Brazilian Treasury, particularly focusing on significant cases such as the agreement with Odebrecht S.A. and its contributions to recovering billions of reals.", "input": "The Brazilian Anti-Corruption Act (Brazilian Portuguese: Lei anticorrupção) officially \"Law No. 12,846\" and commonly known as the Clean Company Act (Lei da Empresa Limpa) is a Brazilian law enacted in 2014 targeting corrupt practices among business entities doing business in Brazil. It defines civil and administrative penalties, as well as the possibility of reductions in penalties for cooperation with law enforcement under a written leniency agreement signed and agreed to between the business and the government. The law is directed only at juridical persons which includes corporations and other institutions, but not individuals, who are covered by other laws. The Act has been invoked numerous times, resulting in leniency agreements returning billions of reals to the Brazilian Treasury, notably the agreement with Odebrecht S.A., which by itself was", "label": 1}
{"summary": "Write a detailed news report about the 16th Asian Film Awards, which was held on March 12, 2023, at the Hong Kong Jockey Club Auditorium in the Hong Kong Palace Museum. Include information about the event, such as the nominations announced on January 6, 2023, the shortlisted films, and their countries or regions. Highlight that 30 films from 22 regions and countries competed for 81 nominations. Mention that the South Korean film Decision to Leave led with 10 nominations, followed by Drive My Car with eight nominations. Include details about Lin Min Chen being appointed as the Youth Ambassador, and the awards ceremony being hosted by Grace Chan and Sammy Leung. Provide additional information about international actors and celebrities walking the red carpet, including Japanese model and actor Hiroshi Abe being honored with the Excellence in Achievement award. Conclude with other noteworthy aspects of the prestigious event.", "input": "The 16th Asian Film Awards was held on March 12, 2023 at Hong Kong Jockey Club Auditorium in Hong Kong Palace Museum. The nominations were announced on January 6, 2023. At the 16th edition of the awards ceremony, 30 films from 22 regions and countries were shortlisted for 81 nominations. South Korean film Decision to Leave received 10 nominations most for any film whereas Drive My Car with eight nominations was second.Lin Min Chen, a Malaysian Chinese singer, actor and model was appointed as Youth Ambassador of the film awards.The award ceremony hosted by Grace Chan and Sammy Leung was held on 12 March 2023, where international actors and celebrities from Hong Kong walked the red carpet. Hiroshi Abe, Japanese model and actor, was presented with Excellence in", "label": 0}
{"summary": "Write a summary about the 38th Artios Awards, highlighting the event date, locations, categories, hosts, and the return to an in-person format.", "input": "The 38th Artios Awards, presented by the Casting Society of America, honoring the best originality, creativity and the contribution of casting to the overall quality of a film, television series, short film, short-form series and theatre production, were held on March 9, 2023, simultaneously at The Beverly Hilton in Los Angeles and Edison Ballroom in New York, being the first time in two years that the ceremony was an in-person event.The nominations for the television, short-form project, and theatre categories were announced on October 17, 2022. The nominees for the film categories were announced on January 10, 2023.Yvette Nicole Brown and Amber Ruffin both hosted the event simultaneously. The latter hosted in New York while the former hosted in Los Angeles; Brown previously hosted the first virtual awards", "label": 0}
{"summary": "Based on the 2014 Gaza Valley airstrike incident as described: Create a detailed narrative scenario that explores the complexities and challenges faced by military personnel and the tragic outcome of a friendly fire incident. Include perspectives from multiple characters involved, such as the air controller, the bomber crew, and the troops on the ground. Reflect on the broader implications for military operations and the personal impact on individuals affected by the tragedy.", "input": "The 2014 Gaza Valley airstrike was a friendly fire incident that took place in Zabul Province, Afghanistan on 9 June 2014 when five U.S. troops and one Afghan interpreter were killed when a B-1B Lancer bomber inadvertently dropped laser-guided bombs on their position during a firefight with Taliban forces. U.S. and Afghan government forces were in the Gaza Valley area of Arghandab District conducting security operations in advance of the 2014 Afghan presidential elections when they came under attack from Taliban militants, sparking a firefight. An American air controller on the ground requested close air support from a B-1B bomber flying in the vicinity to support a team of soldiers maneuvering on a ridge. The U.S. aircraft dropped two guided bombs on the position, killing the team of", "label": 1}
{"summary": "Provide a detailed description and analysis of Banksy's artwork 'Spy Booth,' including its location, the context of its creation, the significance of its critique on surveillance, and the timeline of events related to preservation attempts, legal protections, removal, destruction, and auctioning. Highlight the interplay between art, societal commentary, and heritage protection laws, and discuss the implications of turning physical art into NFT fragments.", "input": "Spy Booth was an artwork by Banksy in Cheltenham, England. The piece has been seen as a critique of the global surveillance disclosures of 2013.In 2014, Robin Barton and Bankrobber London helped with the preservation of the artwork, and attempted to broker the removal and sale of the piece. However the artwork was painted onto a Grade II listed building (153–159 Fairview Road) and the council prevented it from being removed, giving it retrospective listed building consent in 2015 and affording it some protection from removal. Despite this, the artwork was removed, destroying it in August 2016. Spy Booth was auctioned as nine stucco-faced brick fragments sawed from the wall and as an NFT.The GCHQ has used the picture, as a symbolic image for \"How does an analyst", "label": 1}
{"summary": "Write a detailed summary about the 2014 Nuclear Security Summit, including its location, key attendees, goals, and the overall purpose of the conference. Mention any relevant historical context about previous editions and the overarching aim of the summit, particularly regarding nuclear terrorism prevention.", "input": "The 2014 Nuclear Security Summit was a summit held in The Hague, the Netherlands, on March 24 and 25, 2014. It was the third edition of the conference, succeeding the 2012 Nuclear Security Summit. The 2014 summit was attended by 58 world leaders (5 of which from observing international organizations), some 5,000 delegates and some 3,000 journalists. The representatives attending the summit included US President Barack Obama and Chinese President Xi Jinping. The main goal of the conference was generally to improve international cooperation and more specifically to assess which of the objectives that were set at the previous summits in Washington, D.C., and Seoul had not been accomplished in the previous four years and proposing ways of achieving them.The Nuclear Security Summit aimed to prevent nuclear terrorism", "label": 1}
{"summary": "Write a detailed and factual summary about the 2023 German public transport strike, including its causes, the unions involved, the scale of the strike, the impact on transport services such as airports and railroads, and its historical significance as the largest transport workers' action since the 1990s.", "input": "The 2023 German public transport strike was a nationwide labor strike that occurred in March 2023 in Germany. The strike was organized by Ver.di and EVG, two major transport unions, who demanded a 10.5% pay increase for their members to offset rising food and energy costs. This strike was one of the largest to affect Germany in decades and impacted airports - including those in Munich, Frankfurt, and Hamburg - public transport, and the country's largest seaport. Railroad services, as well as early morning regional and commuter rail services, were suspended throughout the country.The strike involved over 400,000 transport workers, making it the largest transport workers' action since a series of strikes in the 1990s. Its aim was to serve as a warning to the government and employers", "label": 0}
{"summary": "Please analyze the 2014 Toronto Argonauts season in the Canadian Football League. Discuss their overall performance, challenges faced during the season, and the impact of the crossover rule on their playoff aspirations. Include details about their standing in the East Division, their final regular-season game, and how the outcomes of other teams' games affected their playoff hopes.", "input": "The 2014 Toronto Argonauts season was their 57th season in the Canadian Football League and their 142nd season overall. The Argonauts finished in third place in the East Division but missed out on a playoff spot due to the crossover rule. The 9–9 BC Lions, fourth place in the West Division, had a better record and therefore eliminated the Argos from the playoffs. Entering the final game of the season at 7–10 against the Ottawa Redblacks, the Argos needed to win to keep their playoff hopes alive, which they did. They also needed Hamilton to lose to Montreal for the Argos to finish second and make the playoffs ahead of the crossover team, the BC Lions. However, the Ti-Cats won that game, eliminating the Argos from the playoffs", "label": 1}
{"summary": "Describe the major events and weather patterns of the 2013–14 North American winter, including the breakdown of the polar vortex, the extended period of cold temperatures, and the significant winter storms that affected various regions of the United States.", "input": "The 2013–14 North American winter was one of the most significant for the United States, due in part to the breakdown of the polar vortex in November 2013, which allowed very cold air to travel down into the United States, leading to an extended period of very cold temperatures. The pattern continued mostly uninterrupted throughout the winter and numerous significant winter storms affected the Eastern United States, with the most notable one being a powerful winter storm that dumped ice and snow in the Southeastern United States and the Northeastern United States in mid-February. Most of the cold weather abated by the end of March, though a few winter storms did affect the Western United States towards the end of the winter. While there is no well-agreed-upon date", "label": 1}
{"summary": "Write a detailed summary or article about the events surrounding the arrest and trial of three journalists from Al Jazeera English—Peter Greste, Mohamed Fahmy, and Baher Mohamed—in Egypt on December 29, 2013. Include information about the accusations, the government's stance, the trial outcome in June 2014, and the reactions from the international community and human rights organizations.", "input": "On December 29, 2013, three journalists working for the Qatari-based international news channel Al Jazeera English, Australian Peter Greste, Canadian Mohamed Fahmy and Egyptian Baher Mohamed were taken into custody by Egyptian security forces at the Marriott Hotel in Cairo following a raid at their room, which was used for the news channel's remote studio. The Egyptian Interior Ministry confirmed the arrest and said the journalists were accused of reporting false news which was \"damaging to national security\".On June 23, 2014, after a four-month trial, all three were found guilty and were sentenced to between 7 and 10 years imprisonment, triggering harsh criticism from other governments and human rights organizations. A day later, Egyptian President Abdel Fattah el-Sisi declared that he would not interfere with judicial rulings.In February", "label": 1}
{"summary": "Generate a detailed summary about the 2023 U-17 Africa Cup of Nations, including information on its sponsorship, hosting decisions, format changes, qualification for the FIFA U-17 World Cup, and the defending champions.", "input": "The 2023 U-17 Africa Cup of Nations known as 2023 U17 AFCON for short and/or the TotalEnergies U-17 Africa Cup of Nations for sponsorship purposes is the 15th edition (20th if editions of the tournament without hosts are included) of the biennial international youth football tournament organized by the Confederation of African Football (CAF) its male national teams consisting of players aged 17 and below. In May 2021, it was decided that the tournament would be hosted by Algeria. This would have been the second edition of the tournament to have expanded to twelve teams instead of eight. The top four teams of the tournament will qualify for the 2023 FIFA U-17 World Cup as the CAF representatives. Cameroon are the defending champions, having won the 2019 edition", "label": 0}
{"summary": "Summarize the events surrounding the motion of no confidence against Spanish Prime Minister Pedro Sánchez tabled by the far-right Vox party, including the timing, motivations behind the motion, proposed candidate for leadership, and the stance of the opposition People's Party.", "input": "A motion of no confidence in the Spanish government of Pedro Sánchez was tabled by the far-right party Vox on 27 February 2023, and will be debated and voted in the Congress of Deputies between 21 and 22 March 2023. It was the sixth motion of no confidence in Spain since the country's transition to democracy.Vox announced the motion of no confidence on 9 December 2022, proposing it to be tabled under an independent candidate with government experience, voicing that Sánchez's proposed reforms of the Criminal Code to modify the embezzlement and sedition crimes were akin to a \"self-coup\" similar to \"that of Pedro Castillo in Peru\" two days earlier. The opposition People's Party (PP) under Alberto Núñez Feijóo stated that it would not vote against the motion,", "label": 0}
{"summary": "Write a detailed analysis of the 2014 unrest in Bosnia and Herzegovina, including its origins, spread across various cities, social factors, goals, and implications. Discuss why it was referred to by some news sources such as BBC and The New York Times as the 'Bosnian Spring' and compare this terminology to other historical uprisings. Highlight the difference in reactions between the Federation of Bosnia and Herzegovina and Republika Srpska during these events.", "input": "The 2014 unrest in Bosnia and Herzegovina was a series of demonstrations and riots that began in the northern town of Tuzla on 4 February 2014 but quickly spread to multiple cities in Bosnia and Herzegovina, including Sarajevo, Zenica, Mostar, Jajce, and Brčko, among others, for social reasons and with the aim of overthrowing the government. The riots were the most violent scenes the country had seen since the end of the Bosnian War in 1995. The rioting largely took place in the entity of Federation of Bosnia and Herzegovina, and the same level of unrest or activism did not occur in Republika Srpska.Some news sources, such as BBC and The New York Times, used the name Bosnian Spring when describing the riots, a terminology taken from other", "label": 1}
{"summary": "Write a comprehensive article on the 2023 Summer Metro Manila Film Festival, detailing its significance as the first edition after the cancellation of the inaugural 2020 event due to the pandemic. Discuss the partnership between the Metropolitan Manila Development Authority and the Cinema Exhibitors Association of the Philippines, as well as the chosen theme 'Tuloy-tuloy ang Saya' (The fun continues). Include information about the festival's scheduling from April 8 to 18, 2023, and its impact on Filipino cinema and culture.", "input": "The 2023 Summer Metro Manila Film Festival is an ongoing iteration of the annual Summer Metro Manila Film Festival held in Metro Manila and throughout the Philippines. It is to be organized by the Metropolitan Manila Development Authority (MMDA) in partnership with the Cinema Exhibitors Association of the Philippines. The theme of the film festival would be \"Tuloy-tuloy ang Saya\" (lit. 'The fun continues').The inaugural edition was supposed to be held in 2020, but was cancelled due to the COVID-19 pandemic. The 2023 edition is now considered to be the first iteration of the film festival. Following the organization of the 2022 Metro Manila Film Festival, the MMDA announced on January 9, 2023, that the summer film festival will be held from April 8 to 18, 2023. The", "label": 0}
{"summary": "Write a detailed account of the 31st Award Ceremony hosted by the World Cultural Council on November 17, 2014, at Aalto University in Espoo, Finland. Include information about the event's venue, its connection to the Aalto University Academic Summit, and highlight the notable achievements of the scientists who received awards: Professor Sir Philip Cohen for his research into cellular communication and Professor Federico Rosei for his excellence in university teaching. Additionally, mention any notable figures involved in the ceremony, such as Jussi Nuorteva, and the significance of their contributions to the event.", "input": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer of the event, which was the opening act prior to the Aalto University Academic Summit titled \"The Impact of Universities on Economic Growth.\"The WCC presented awards to two distinguished scientists. Acclaimed enzymologist Professor Sir Philip Cohen received the Albert Einstein World Award of Science for his forty-year research into cellular communication. Professor Federico Rosei accepted the José Vasconcelos World Award of Education, granted for his excellence in the field of university teaching. Jussi Nuorteva, Director of the National Archives of Finland and member of the WCC, presented the Winners' Book to the laureates. Professor Sir Philip", "label": 1}
{"summary": "Summarize the key events and decisions that took place during the 16th Congress of the Popular Front for the Liberation of Saguia El Hamra and Río de Oro held in January 2023.", "input": "The 16th Congress of the Popular Front for the Liberation of Saguia El Hamra and Río de Oro (Arabic: المؤتمر السادس عشر للجبهة الشعبية لتحرير الساقية الحمراء ووادي الذهب, Spanish: XVI Congreso del Frente Popular para la Liberación de Saguia El Hamra y Río de Oro) was held in the Dajla refugee camp in Tindouf, Algeria between 13 and 22 January 2023 to renovate the governing bodies of the POLISARIO Front and establish the movement's main lines of action and strategy for the next leadership term. The Congress was also used to elect a new General-Secretary for the POLISARIO Front, which would automatically become the President of the Sahrawi Arab Democratic Republic. For the first time ever, the candidate for general-secretary was not agreed upon before the Congress.", "label": 0}
{"summary": "Write an article or summary about the 28th Edition of Star Awards 2023 (Chinese: 红星大奖2023), a television award ceremony in Singapore, which honored the best in Singaporean television released between January and December 2022. Discuss how Star Awards 2023 embraced the theme 'Beyond | Celebrations,' redefining itself as a star-studded concert and a grand celebration of local Chinese entertainment talent. Highlight the key achievements, notable winners such as Felicia Chin and Rebecca Lim who earned their tenth Top 10 Most Favorite Artiste awards, and the venue of the ceremony held at Marina Bay Sands, Singapore on 9 April 2023.", "input": "The 28th Edition of Star Awards 2023 (Chinese: 红星大奖2023) is a television award ceremony that honoured the best in Singaporean television released between January and December 2022. Star Awards 2023 prepares for the largest celebration of local Chinese entertainment industry talent and content in Singapore! The Star Awards 2023, with the theme \"Beyond | Celebrations,\" have been redefined as a star-studded concert, bringing together the best performers from Singapore and the region for an exhilarating night of glitz, excitement, and celebrations unlike any other. The Ceremony was once again held at Marina Bay Sands, Singapore on 9 April 2023.The current All-Time Favorite Artiste Felicia Chin and Rebecca Lim earned their tenth Top 10 Most Favorite Artiste awards, in last years' ceremony, making Rebecca Lim the ninth celebrity to", "label": 0}
{"summary": "Write an informative and concise summary about the judicial reform efforts proposed in Israel in January 2023, led by Deputy Prime Minister Yariv Levin and Simcha Rothman. Explain the key elements of the reform, including changes to the Supreme Court's judicial review powers, government control over judicial appointments, and the mechanism for the Knesset to override Supreme Court rulings on legislation deemed unconstitutional.", "input": "A series of changes to the judicial system and the balance of powers in Israel was proposed in January 2023. The effort has been spearheaded by Deputy Prime Minister and Minister of Justice Yariv Levin and the Chair of the Knesset's Constitution, Law and Justice Committee, Simcha Rothman. It seeks to curb the judiciary's influence over lawmaking and public policy by limiting the Supreme Court's power to exercise judicial review, granting the government control over judicial appointments and limiting the authority of its legal advisors.If adopted, the reform would grant the Knesset the power to override Supreme Court rulings that deem legislation passed by the Knesset as unconstitutional, by reintroducing the legislation and approving it with a majority of Knesset members. The reform would additionally diminish the ability", "label": 0}
{"summary": "Write a detailed history of the MS Norman Atlantic, a roll-on/roll-off passenger ferry owned by Visemar di Navigazione, including its ownership, charter details, the fire incident in the Strait of Otranto on December 28, 2014, and the aftermath, specifically the number of passengers, crew, and casualties involved.", "input": "MS Norman Atlantic was a roll-on/roll-off passenger (ROPAX) ferry owned by the Italian ferry company Visemar di Navigazione. The ferry was chartered by ANEK Lines from December 2014. On 28 December 2014, she caught fire in the Strait of Otranto, in the Adriatic Sea. At the time of the fire there were an estimated 475 people on board the ship including 417 passengers, 55 crew and at least three illegal immigrants. Of these, 452 people were rescued and the bodies of 11 were recovered. It is known that 16 passengers died and it was estimated that there were 28 deaths overall, the uncertainty arising from estimates of the number of illegal immigrants on board. Additionally, two crewmembers of the Albanian tug Iliria were killed during the salvage operations", "label": 1}
{"summary": "Summarize the 2013–2014 Thai political crisis, highlighting the key events, the main objectives of the protests, the role of the People's Democratic Reform Committee (PDRC), and the outcomes of the crisis, including changes in government and the broader political implications.", "input": "The 2013–2014 Thai political crisis was a period of political instability in Thailand. Anti-government protests took place between November 2013 and May 2014, organised by the People's Democratic Reform Committee (PDRC), a political pressure group led by former Democrat Party parliamentary representative (MP) Suthep Thaugsuban. The crisis eventually resulted in the removal of incumbent Prime Minister Yingluck Shinawatra, a coup d'état, and the establishment of a military junta. The primary aim of the protests was the removal of former prime minister Thaksin Shinawatra's – the brother of Yingluck – influence on Thai politics and the creation of an unelected \"people's council\" to oversee reforms of the political system. Protesters viewed Thaksin as corrupt and damaging to Thailand's democracy, although he enjoyed strong support in many areas of Thailand,", "label": 1}
{"summary": "Explore the events and legal proceedings surrounding the Schellenberg smuggling incident, focusing on the arrest and conviction of Canadian citizen Robert Lloyd Schellenberg in China. Discuss the attempted drug smuggling operation involving methamphetamine from Dalian to Australia, and Schellenberg's flight attempt to Thailand after his translator informed the police. Consider the arguments from both the prosecution, which alleged the smuggling of over 222 kg of methamphetamine, and Schellenberg's defense, which claimed he was framed by drug dealer Xu Qing. Analyze the circumstances of Schellenberg's arrest during a stopover in Guangzhou and the coverage of his 2018 trial by the Dalian Intermediate Court.", "input": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to the prosecutors for the state, Schellenberg attempted to smuggle methamphetamine with a net weight of just over 222 kg (489 lb) from Dalian to Australia in November 2014, and after discovering that his translator had informed the police, he boarded a plane at Dalian Zhoushuizi International Airport with the intention of fleeing to Thailand. Schellenberg was arrested by Chinese police when the plane had a stopover at Guangzhou Baiyun International Airport. Schellenberg argued that he was framed by drug dealer Xu Qing and that he was an innocent tourist. On November 20, 2018, the Dalian Intermediate", "label": 1}
{"summary": "Write a detailed summary about the Suez Canal Corridor Area Project, which was initiated in 2014 in Egypt. Discuss its goals, the main developments involved in the project, and its impact on the region. Mention specific constructions, like new cities, industrial zones, and infrastructure enhancements, and describe how these changes are intended to benefit international trade and the regional economy.", "input": "The Suez Canal Corridor Area Project (Arabic: مشروع تطوير محور قناة السويس) is a megaproject in Egypt that was launched on 5 August 2014 by President Abdel Fattah el-Sisi and completed in 2015. The project aimed to increase the role of the Suez Canal region in international trade and to develop the canal cities of Suez, Ismailia, and Port Said. The project involved building a new city (Ismailia), an industrial zone, fish farms, encouraging the development of a tech industry, building seven new tunnels between Sinai and Ismailia and Port Said, improving five existing ports, creating new centers for logistics and ship services, and digging a new canal parallel to the Suez Canal. The new canal was constructed to increase capacity by allowing ships to sail in both", "label": 1}
{"summary": "Generate a comprehensive summary of ARSAT-1, highlighting its significance as the first geostationary satellite built in Latin America, and detailing its operational features, including its launch details, operational location, cost, and telecommunications capabilities. Also, explain the impact the satellite might have on telecommunications and broadcasting services in Argentina and neighboring countries.", "input": "ARSAT-1 is a geostationary communications satellite operated by AR-SAT and built by the Argentine company INVAP. ARSAT-1 was launched into orbit on October 16, 2014, from French Guiana alongside Intelsat-30 satellite using an Ariane 5 rocket. It is expected to be located at 72° West longitude geostationary slot. ARSAT-1 is the first geostationary satellite built in Latin America. Total cost of the satellite is 270 million US dollars.ARSAT-1 carries a total of 24 IEEE Ku band (NATO J-band) transponders. Twelve will be operating at 36 MHz, eight at 54 MHz and four at 72 MHz, for a total bandwidth of 1152 MHz. It will offer a wide range of telecommunications, data transmission, telephone and television services mainly across all of Argentina, Chile, Uruguay and Paraguay including direct broadcast", "label": 1}
{"summary": "Generate a detailed summary of events surrounding the 40th G7 summit held on 4–5 June 2014 in Brussels, Belgium, explaining how it was initially planned as the 40th G8 summit to be hosted by Russia in Sochi, but was shifted to Brussels due to the 2014 Crimean crisis and the subsequent Russian intervention in Crimea. Discuss the actions taken by G8 members, including the potential suspension or expulsion of Russia, and British Prime Minister David Cameron's announcement regarding the change in venue.", "input": "The 40th G7 summit was held 4–5 June, 2014 in Brussels, Belgium. It was originally scheduled to be held as the “40th G8 summit” and be hosted by Russia in the Black Sea resort of Sochi. However, the other seven countries decided on 24 March that the summit would be instead held without Russia in Brussels.Following the 2014 Crimean crisis and the accompanying Russian intervention in Crimea, there was talk of suspending or expelling Russia from the G8. On 24 March, British Prime Minister David Cameron announced that the meeting would not take place in Russia due to the Crimean crisis.The G8 is an unofficial forum which brings together the heads of major world powers: Germany, France, the United Kingdom, Italy, Japan, the United States, Canada (all since", "label": 1}
{"summary": "Write a detailed and factual summary about judicial reform proposals announced by Israeli Justice Minister Yariv Levin in January 2023. Highlight the proposed changes to the judiciary, executive, and legislative functions, along with the resulting controversy and criticisms from various groups, including opposition leaders, civil servants, economists, activists, jurists, and reservists in Israel's security forces. Discuss the concerns regarding judicial independence and the potential impact of the reform on the balance of powers in Israel.", "input": "On 4 January 2023, newly-appointed Israeli Justice Minister Yariv Levin announced his intention to make a number of major changes to the judicial system and the balance of powers in Israel. On 11 January, Levin published a draft of his proposed changes, which included significant changes to the judiciary, executive and legislative processes and functions. The government's proposed reform has sparked intense controversy in Israel. Opposition leaders, senior past civil servants, economists, activists, jurists and others have harshly criticized the proposed changes, arguing they will undermine judicial independence and effectively grant the government unchecked power. The opponents to the reform include reservists in Israel's security forces, with some stating they will stop conducting reserve duty service if the proposed reform is progressed through as legislation. They also include", "label": 0}
{"summary": "Discuss the significance of the Boston Bruins winning the Presidents' Trophy in the 2022–23 NHL regular season and analyze their prospects in the 2023 Stanley Cup playoffs. Additionally, reflect on the historical context and implications of the Pittsburgh Penguins failing to make the playoffs after sixteen consecutive seasons, and explore the impact on the NHL's longest active playoff streak now held by the Boston Bruins and Toronto Maple Leafs.", "input": "The 2023 Stanley Cup playoffs is the ongoing playoff tournament of the National Hockey League (NHL) for the 2022–23 season. The playoffs began on April 17, 2023, three days after the end of the regular season, and will end in June 2023 with the 2023 Stanley Cup Finals, to determine the winner of the Stanley Cup.The Boston Bruins made the playoffs as the Presidents' Trophy winners with the most points (i.e. best record) during the regular season. The Pittsburgh Penguins failed to make the playoffs for the first time since the 2005–06 NHL season, ending the NHL's longest active playoff streak at sixteen consecutive seasons. The longest active streak moved to the Boston Bruins and Toronto Maple Leafs at seven consecutive seasons after the Nashville Predators and Washington", "label": 0}
{"summary": "Write a detailed article about the 2023 Lucha Libre World Cup, a professional wrestling event organized by Lucha Libre AAA Worldwide (AAA). Include information about the event's date, location, format, participating teams from various international promotions, and the winners of the men's tournament. Provide context about how this event differed from its previous edition.", "input": "The Lucha Libre World Cup was a professional wrestling event and tournament organized by Mexican professional wrestling promotion Lucha Libre AAA Worldwide (AAA). The tournament took place on March 19, 2023 at Estadio de Béisbol Charros de Jalisco in Zapopan, near Guadalajara, Mexico. The 2023 edition of the tournament featured three-person teams, referred to as trios in Lucha Libre; this differed from the previous edition of the event which featured traditional two-person tag teams. The tournament showcased teams with wrestlers from numerous international promotions including Mexico's Nación Lucha Libre (NLL), America's All Elite Wrestling (AEW), Impact Wrestling (Impact), and the National Wrestling Alliance (NWA), Japan's Dragon Gate and Oz Academy (Oz), and Qatar Pro Wrestling (QPW). The men's tournament was won by Team Mexico (Taurus, Pentagón Jr., and", "label": 0}
{"summary": "Provide a detailed summary of the 2014 Burkina Faso uprising, including the events that led to the protests, the key players involved, and the outcomes of the demonstrations. Highlight the role of civil society and youth in driving political change, the key events on 30 October, and the eventual actions of President Blaise Compaoré in response to the unrest.", "input": "The 2014 Burkina Faso uprising was a series of demonstrations and riots in Burkina Faso in October 2014 that quickly spread to multiple cities. They began in response to attempts at changing the constitution to allow President Blaise Compaoré to run again and extend his 27 years in office. Pressure for political change came from civil society and in particular from the country's youth. Following a tumultuous day on 30 October, which included the involvement of former Defence Minister Kouamé Lougué and the burning of the National Assembly and other government buildings as well as the ruling Congress for Democracy and Progress party's headquarters, Compaoré dissolved the government and declared a state of emergency before eventually fleeing to Côte d'Ivoire with the support of President Alassane Ouattara. General", "label": 1}
{"summary": "Write a detailed summary discussing the significance of the Northern Rocky Mountains ecosystem in the United States, highlighting its status as one of the last relatively undeveloped areas able to support a functioning ecosystem. Explain the goals of the Northern Rockies Ecosystem Protection Act, including its efforts to protect threatened and endangered species such as grizzly bears, bull trout, sockeye salmon, and Canadian lynx. Additionally, discuss the initiatives to create jobs through ecological restoration, mentioning the role of the Alliance for the Wild Rockies and their efforts in advocating for this legislation with support from Congresspersons and celebrities.", "input": "The Northern Rocky Mountains ecosystem in the United States is known by ecologists, biologists, and naturalists as one of the last areas of the contiguous United States that is relatively undeveloped enough and large enough to support a functioning ecosystem. The Northern Rockies Ecosystem Protection Act is designed to protect this ecosystem and the many threatened and endangered species such as grizzly bears (threatened), bull trout (threatened), sockeye salmon (endangered only in Snake River Evolutionary Significant Unit, secure elsewhere), and Canadian lynx (threatened only in lower U.S. 48 states, secure elsewhere), while creating jobs that restore old roads and clear cuts. The Alliance for the Wild Rockies based in Helena, Montana has been campaigning for the legislation for two decades with the help of numerous Congresspersons, celebrities, and", "label": 0}
{"summary": "Write a detailed summary of Wrestle Kingdom 8 in Tokyo Dome, a professional wrestling pay-per-view event held by New Japan Pro-Wrestling (NJPW) on January 4, 2014. Describe its significance as NJPW's biggest event of the year, comparing it to WWE's WrestleMania. Highlight key details such as the event's location, its history as the 23rd Tokyo Dome Show and eighth under the 'Wrestle Kingdom' name, and its worldwide airing on internet pay-per-view (iPPV). Emphasize the ten matches on the card, including the six title matches, and note the historical significance of the National Wrestling Alliance (NWA) World Heavyweight Championship being defended for the first time in twenty years. Include details about NWA representative Rob Conway’s defense against Satoshi Kojima.", "input": "Wrestle Kingdom 8 in Tokyo Dome was a professional wrestling pay-per-view (PPV) event produced by the New Japan Pro-Wrestling (NJPW) promotion, which took place at the Tokyo Dome in Tokyo, Japan on January 4, 2014. It was the 23rd January 4 Tokyo Dome Show and the eighth held under the \"Wrestle Kingdom\" name. Like the previous year, the event aired worldwide on internet pay-per-view (iPPV). Wrestle Kingdom is traditionally NJPW's biggest event of the year and has been described as their equivalent to WWE's WrestleMania.The event featured ten matches, six of which were contested for championships. For the first time in twenty years, the National Wrestling Alliance (NWA) World Heavyweight Championship was defended during the event with NWA representative Rob Conway defending against Satoshi Kojima. The event was", "label": 1}
{"summary": "Write an in-depth analysis of Brazil's economic and political crisis beginning in 2014. Include the GDP contraction during 2015 and 2016, the subsequent economic recovery until 2020, and the impact of the COVID-19 pandemic. Discuss the causes of the crisis, such as the political turmoil leading to Dilma Rousseff's impeachment, the commodity price shock affecting exports and foreign investment, and the internal economic measures that failed to achieve expected results.", "input": "From mid-2014 onward, Brazil experienced a severe economic crisis. The country's Gross Domestic Product (GDP) fell by 3.5% in 2015 and 3.3% in 2016, after which a small economic recovery began. That recovery continued until 2020, when the COVID-19 pandemic began to impact the economy again. The economic crisis occurred alongside a political crisis that resulted in the impeachment of president Dilma Rousseff. These events combined caused mass popular dissatisfaction with the political system. The cause of the crisis was the aforementioned political crisis, as well as the 2014 commodity price shock, which negatively affected Brazil's exports and reduced the entrance of foreign capital into the economy. However, the most important cause was internal, which is associated with economic measures that didn't achieve the expected results. Adopted in", "label": 1}
{"summary": "Write a detailed and engaging summary about the Kasta Tomb, also known as the Amphipolis Tomb, the largest ancient burial mound ever discovered in Greece. Make sure to include its historical period, location, excavation history, and the significance of its contents. Highlight its relationship to the ancient city of Amphipolis and any comparisons to similar historical sites, such as the tomb of Philip II of Macedon in Vergina.", "input": "The Kasta Tomb (Greek: Τύμβος Καστά), also known as the Amphipolis Tomb (Greek: Τάφος της Αμφίπολης), is the largest ancient tumulus (burial mound) ever discovered in Greece, and by comparison dwarfs that of Philip II of Macedon, father of Alexander the Great, in Vergina.It is an ancient Macedonian tomb of the last quarter of the 4th c. BC, and is enclosed in the Kasta mound near the ancient city of Amphipolis, Central Macedonia, in northern Greece. The first excavations at the mound in 1964 led to exposure of the perimeter wall, and further excavations in the 1970s uncovered many other ancient remains. The inner tomb was first discovered in 2012 and entered in August 2014.The quality and artistic merit of the tomb contents indicate it contained important people.", "label": 1}
{"summary": "Write a detailed summary about The Reddings, an American funk, soul, and disco band founded by the sons of legendary musician Otis Redding. Include information about the band members, their most popular songs, significant albums, and notable performances, as well as their impact on the music industry. Highlight any collaborations or covers by other artists and their legacy in the music world.", "input": "The Reddings was an American funk, soul and disco band, founded by Otis Redding's sons Dexter (bass and vocals) and Otis Redding III (December 17, 1963 – April 18, 2023 age 59; guitar) together with Mark Lockett (drums, keyboards, and lead vocal).Their most well-known songs include \"Remote Control\" (1980) / \"Doin' it\" / \"Funkin on the One\" / \"Class (Is What You Got)\" (1981) / \"Sittin' on the Dock of the Bay\" (1982) / \"Hand Dance\" (1983) and \"The Awakening\" (1980), a bass-drums-duet which is often performed live by Les Claypool (Primus) and on his album Highball with the Devil. Their album The Reddings was released on November 26, 1988, and reached a peak position of #88 on the US Billboard album chart. It featured a hit single", "label": 0}
{"summary": "Write a detailed overview of the GSK China scandal, outlining the key events including the bribery allegations, involvement of the company's China head Mark Reilly, the role of investigator Peter Humphrey and his wife Yu Yingzeng, and the broader implications of China's judicial system characterized by its opacity and high conviction rate. Provide context, explore the consequences for the individuals involved, and evaluate the impact of the scandal on GSK's operations in China.", "input": "The GSK China scandal was an imbroglio where the China branch of the global drugmaker GlaxoSmithKline (GSK) pleaded guilty to paying bribes to doctors and hospitals to promote the company's products in China. The scandal started with sex tapes of the company's China head, Mark Reilly and his Chinese girlfriend at a Shanghai department, which were sent to several senior executives of the company. The company's investigations into the sex tapes led to imprisonment of the paid investigator Peter Humphrey and his wife Yu Yingzeng in China, a country which has an opaque judicial system with a 99% conviction rate, on allegations that they had breached privacy law. Humphrey and his wife maintain their innocence and Humphrey claims he was tortured and denied medical treatment due to his", "label": 1}
{"summary": "Generate a detailed summary of the historic diplomatic meetings in 2014 between Wang Yu-chi, the Minister of the Mainland Affairs Council (MAC) of the Republic of China (ROC), and Zhang Zhijun, the Minister of the Taiwan Affairs Office (TAO) of the People's Republic of China (PRC). Discuss the significance of their first meeting in Nanjing on 11 February 2014 as the first official contact since the end of the Chinese Civil War in 1949, Wang's visit to mainland China from 11–14 February, and Zhang's reciprocal visit to Taiwan on 25–28 June following the Sunflower Movement.", "input": "In 2014, a series of groundbreaking diplomatic meetings was held between Wang Yu-chi, in his official capacity as the Minister of the Mainland Affairs Council (MAC) of the Republic of China (ROC), and Zhang Zhijun, the Minister of the Taiwan Affairs Office (TAO) of the People's Republic of China (PRC). The first meeting took place in Nanjing on 11 February 2014 when Wang visited mainland China, the very first official contact between the two governments across the Taiwan Strait after the end of Chinese Civil War in 1949. The tour of Wang and his delegates lasted from 11 to 14 February in Nanjing and Shanghai.On 25–28 June 2014, Zhang paid a retrospective visit to Taiwan in order to rebuild ties in the aftermath of the Sunflower Movement. It", "label": 1}
{"summary": "Write an overview of the internal conflict in the Central African Republic (CAR) that began on 13 April 2013 under the government of President Michel Djotodia. Discuss the factions involved, their religious affiliations, and the international response, including actions taken by the United Nations and France. Highlight the implications and warnings issued by international organizations regarding potential genocide, and mention the role of the African-led International Support Mission to the Central African Republic (MISCA) following discussions by the Economic Community of Central African States.", "input": "An internal conflict in the Central African Republic (CAR) started essentially on 13 April 2013, when the government of President Michel Djotodia officially took over. The fighting was between the government of the Central African Republic's former Séléka coalition of rebel groups, who are mainly from the Muslim minority, and the mainly Christian anti-balaka coalition. The conflict was part of the ongoing Central African Republic Civil War (2012–present). International organisations, such as the United Nations, had warned of a possible genocide. UNSC resolution 2122 authorised the African-led International Support Mission to the Central African Republic (MISCA) to be deployed to the country, and France to lead operations with additional troops sent to bolster its force in the country. Following a summit of Economic Community of Central African States", "label": 1}
{"summary": "Write a factual and concise summary detailing Georgia's involvement in the war in Afghanistan, including key dates, personnel contributions, mission roles, and deployments within both combat and non-combat operations, such as the International Security Assistance Force and the Resolute Support Mission.", "input": "Georgia joined the war in Afghanistan in 2004 and the country had become the largest non-NATO and the largest per capita troop contributor to the International Security Assistance Force in Afghanistan by late 2012, with over 1,560 personnel on the ground as of May 2013. At its peak deployment, Georgia provided two full infantry battalions serving with the United States forces in the Helmand province. Since the beginning of their mission, more than 11,000 Georgian soldiers have served in Afghanistan.The Georgian mission in Helmand ended in July 2014. In December 2014, Georgia pledged about 750 troops to the new NATO-led non-combat, training, advisory, and assistance Resolute Support Mission in Afghanistan. At various times, the country has also deployed an infantry company serving with the French contingent in Kabul,", "label": 1}
{"summary": "Provide a detailed summary of the 7th Crunchyroll Anime Awards held on March 4, 2023. Include information about the location, significance as the first in-person ceremony since 2020, its shift to Japan as the host country, eligibility criteria for nominations, the hosts, special guests, and performances during the event.", "input": "The 7th Crunchyroll Anime Awards was held on March 4, 2023, at the Main Banquet Hall of the Grand Prince Hotel New Takanawa in Tokyo, Japan. It was the first ceremony to be held in person since 2020; both ceremonies in 2021 and 2022 were held virtually. Additionally, it was the first ceremony to be held in Japan, as previous physical ceremonies were held in the United States. Anime released on television or online in Japan from November 2021 to September 2022 were eligible for nominations for this edition. The ceremony was hosted by voice actress Sally Amaki and presenter Jon Kabira, with Sony CEO Kenichiro Yoshida opening the show. Previous winners ALI and AKLO, Yuki Kajiura, and Kohta Yamamoto performed at the ceremony, while singer Haruka Kaki", "label": 0}
{"summary": "Write a detailed summary of the 2014 presidential elections in Afghanistan, including key dates, notable events, the role of the Independent Election Commission, the number of confirmed candidates, disqualifications, and major contenders. Highlight the outcomes of the first round and identify the front-runners in the race.", "input": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The registration period for presidential nominations was open from 16 September 2013 until 6 October 2013. A total of 27 candidates were confirmed to be running for office. However, on 22 October Afghanistan's Independent Election Commission disqualified 16 of the candidates, leaving only 11 in the race. By April 2014 three candidates gave up the race and decided to support some of the eight remaining candidates. Opinion polls showed Abdullah Abdullah and Ashraf Ghani as the front-runners and indeed the results of the first round of the election had Abdullah in the lead and Ghani behind him.", "label": 1}
{"summary": "Generate a detailed summary of the Global Wars wrestling event, focusing on the collaboration between Ring of Honor and New Japan Pro-Wrestling. Include information about the event location, date, broadcast medium, and the involvement of wrestlers from both promotions. Describe the match arrangements and championships contested, highlighting the interpromotional aspects and any notable outcomes, such as The Young Bucks retaining their IWGP Junior title. Consider the historical context of the event's naming and the organizational structure employed during the show.", "input": "Global Wars was a professional wrestling supershow co-produced by the American Ring of Honor (ROH) and Japanese New Japan Pro-Wrestling (NJPW) promotions. The event took place on May 10, 2014, at the Ted Reeve Arena in Toronto, Ontario, Canada and aired live on internet pay-per-view (iPPV) through Ustream. The event was originally billed as \"Border Wars\", a name ROH had used for events in 2012 and 2013.With the exception of one interpromotional match, wrestlers from NJPW and ROH were kept separated from each other with the bookers from each promotion handling their own half of the show. The event featured nine matches with three championships on the line; two from ROH and one from NJPW. In the undercard of the event, The Young Bucks retained the IWGP Junior", "label": 1}
{"summary": "Generate a detailed and informative text about Dzhumaya Mosque, located in Plovdiv, Bulgaria. Include its historical background, architectural features, and significance. Mention its Bulgarian and Turkish names, construction history, and notable elements such as its dimensions, number of domes, minaret, and interior wall paintings.", "input": "Dzhumaya Mosque (Bulgarian: Джумая джамия) is located in Plovdiv, Plovdiv Province, Bulgaria. Its Turkish name is Hüdavendigâr Camii or Cuma Camii. The mosque is located in the centre of Plovdiv and was built in 1363–1364 on the site of the Sveta Petka Tarnovska Cathedral Church after the conquest of Plovdiv by the Ottoman army. During the reign of Sultan Murad I in the 15th century the old building was demolished and replaced by the modern-day mosque. It was called Ulu Dzhumaya Mosque, or Main Friday Mosque.The mosque is large, with nine domes and a 33 m × 27 m (108 ft × 89 ft) prayer hall. There is a minaret at the northeast corner of the main façade. Interior wall paintings date to the late 18th to early", "label": 1}
{"summary": "Generate a detailed overview of the ongoing refugee crisis in Europe that began after Russia's invasion of Ukraine in February 2022. Discuss the scale of displacement within Ukraine and across Europe, highlighting key statistics such as the approximately 8.1 million refugees recorded in Europe and the estimated 8 million displaced within Ukraine by late May 2022. Explore the demographic breakdown of the refugees, emphasizing that 90% are women and children, while Ukrainian men aged 18 to 60 are generally prohibited from leaving the country. Include information on the impact on children, including the fact that by 24 March, more than half of all children in Ukraine had left their homes, with a quarter of them having fled the country. Explain how the invasion has caused Europe’s largest refugee crisis since World War II and draw comparisons to previous refugee crises in Europe for context.", "input": "An ongoing refugee crisis began in Europe in late February 2022 after Russia's invasion of Ukraine. Over 8.1 million refugees fleeing Ukraine have been recorded across Europe, while an estimated 8 million others had been displaced within the country by late May 2022. Approximately one-quarter of the country's total population had left their homes in Ukraine by 20 March. 90% of Ukrainian refugees are women and children, while most Ukrainian men age 18 to 60 are banned from leaving the country. By 24 March, more than half of all children in Ukraine had left their homes, of whom a quarter had left the country. The invasion caused Europe's largest refugee crisis since World War II and its aftermath, is the first of its kind in Europe since the", "label": 0}
{"summary": "Write a detailed analysis of Tropical Cyclone Cheneso that hit Madagascar in January 2023. Include information about its development from a zone of disturbed weather, progression into a tropical depression, and further intensification into a severe tropical storm. Discuss its impact on landfall, weakening, and subsequent movement into the Mozambique Channel, culminating in its re-strengthening into a tropical cyclone. Mention the transition it underwent into a post-tropical depression and its final status according to the National Office for Risk. Provide insights into the meteorological patterns and effects related to the 2022–23 South-West Indian Ocean cyclone season.", "input": "Tropical Cyclone Cheneso was a strong tropical cyclone that affected Madagascar in January 2023. The fourth tropical storm and fifth tropical cyclone of the 2022–23 South-West Indian Ocean cyclone season, Cheneso developed out of a zone of disturbed weather status which was first monitored at RSMC La Réunion on 17 January. Despite convection wrapping into the curved band pattern, the system formed into a tropical depression on 18 January. The depression strengthened into Severe Tropical Storm Cheneso on the following day. Cheneso made landfall over northern Madagascar and weakened into an inland depression, before emerging into the Mozambique Channel. Cheneso later strengthened into a tropical cyclone on 25 January. The system continued moving southeast, before transitioning into a post-tropical depression on 29 January. The National Office for Risk", "label": 0}
{"summary": "Based on the provided information about Air Algérie Flight 5017, outline a comprehensive analysis of the events leading to the crash on 24 July 2014. Discuss the role of the French Bureau of Enquiry and Analysis for Civil Aviation Safety (BEA) in investigating the incident and their findings. Elaborate on the impact of ice accretion on the aircraft's engines and its contribution to the crash. Finally, explain the significance of the BEA's recommendations to Air Algérie and the broader implications for aviation safety.", "input": "Air Algérie Flight 5017 was a scheduled international passenger flight from Ouagadougou, Burkina Faso, to Algiers, Algeria, which crashed near Gossi, Mali, on 24 July 2014. The McDonnell Douglas MD-83 twinjet with 110 passengers and 6 crew on board, operated by Swiftair for Air Algérie, disappeared from radar about fifty minutes after take-off. There were no survivors. The French Bureau of Enquiry and Analysis for Civil Aviation Safety (BEA), assisting the Malian authorities, published an investigation report in April 2016, concluding that, while the aircraft was cruising on autopilot, ice accretion on the engines caused a reduction of thrust that led to a high-altitude stall. The crew was unable to recover from the stall, and the aircraft crashed to the ground. The BEA issued several recommendations to Air", "label": 1}
{"summary": "Generate a detailed summary of the 2023 Nigerian currency crisis, including its causes, the role of the central bank, public reaction, and potential political implications. Describe the central bank's motivations for introducing a central bank digital currency (CBDC) and redesigning the naira, focusing on issues such as inflation, counterfeit deterrence, vote-buying prevention, and promoting a cashless society. Address the broader social and economic impacts, including street protests and public dissent.", "input": "The 2023 Nigerian currency crisis was precipitated by a shortage of cash currency (the naira) and an attempt by the Nigerian government to force citizens to use a newly created government-sponsored central bank digital currency. This led to extensive street protests in mid-February 2023.Central Bank governor Godwin Emefiele initially cited Nigerians hoarding notes in their homes as the reason for the currency redesign. However, he later claimed that it would deter counterfeiters and those paying kidnappers' ransoms, and that it was a step towards a cashless society. He also argued that it would help reduce inflation. Some analysts and politicians have said that a motive of the CBDC introduction and deprecation of the old currency was to curb vote buying, by thwarting politicians who had amassed a stockpile", "label": 0}
{"summary": "Write a detailed summary of the 2014 DFB-Pokal Final, including information about the teams involved, the significance of the match, and its implications for European competition. Highlight how league positions affected the Europa League qualification and discuss the historical context regarding qualification rules for cup runners-up.", "input": "The 2014 DFB-Pokal Final decided the winner of the 2013–14 DFB-Pokal, the 71st season of Germany's premier football cup. It was played on 17 May at the Olympiastadion in Berlin. In the final, Borussia Dortmund played Bayern Munich. The winners would have earned a place in the group stage of the 2014–15 UEFA Europa League, but both teams had already qualified for the 2014–15 UEFA Champions League via their league positions. Because of this, the three Europa League spots were passed down through league positions. This was the last season in which the cup runners-up would have qualified for the Europa League if the winners had already qualified for the Champions League. The winners also earned the right to play in the 2014 DFL-Supercup; as Bayern had already", "label": 1}
{"summary": "Create a detailed historical account of the Knollys family, focusing on the genealogy and significant contributions of the Viscounts Knollys in the Peerage of the United Kingdom. Discuss the creation of the title in 1911, the roles assumed by Francis Knollys as Private Secretary to the Sovereign, and the subsequent accomplishments of his descendants, including the second Viscount who served as Governor of Bermuda and the challenges faced by the family. Examine the influence of the Knollys family in British aristocracy and their connection to other notable families, such as the sister of the third Viscountess Knollys who was the Vice Lord-Lieutenant of Norfolk. Analyze the implications of the recent succession in 2023 when the fourth Viscount inherited the title.", "input": "Viscount Knollys (), of Caversham in the County of Oxford, is a title in the Peerage of the United Kingdom. It was created in 1911 for the court official Francis Knollys, 1st Baron Knollys, Private Secretary to the Sovereign from 1901 to 1913. He had been previously created Baron Knollys, of Caversham in the County of Oxford, on 21 July 1902. His son, the second Viscount, served as Governor of Bermuda. As of 2023 the titles are held by the latter's grandson, the fourth Viscount, who succeeded in 2023. The third Viscountess Knollys (d. 2022) was a sister of Baron Farnham: she served as Vice Lord-Lieutenant of Norfolk.The Viscounts Knollys are members of the prominent Knollys family (pronounced \"Nohlz\") and are descended in the senior male line from", "label": 0}
{"summary": "Write a detailed account of the murder of Jacqueline Montgomery, a 15-year-old girl from Islington, North London, which occurred on 1 June 1975. Include information about the perpetrator, Dennis McGrory, describing his actions during the crime, the circumstances of the murder, and the discovery of Montgomery's body by her father. Discuss the legal proceedings that followed, including McGrory's 1976 trial where he was cleared of murder due to circumstantial evidence, and how advancements in DNA testing led to a retrial in 2022 under the double jeopardy rule. Explore the importance of forensic science and justice in this case.", "input": "The murder of Jacqueline Montgomery, a 15-year-old girl from Islington, North London, United Kingdom, occurred on 1 June 1975. She was murdered by Dennis McGrory, her aunt's 28-year-old estranged partner, who was described at his trial as being \"wild with rage\" when he sexually assaulted, stabbed and strangled Montgomery at her family home in Offord Road. Her body was discovered by her father in the early hours of 2 June on the floor of the living room of their house. McGrory was tried on circumstantial evidence in 1976, but cleared of murder. He faced trial again in 2022 under the rule of double jeopardy after swabs taken at the time of the murder were tested for his DNA and found to be a one-in-a-billion match. Following the second", "label": 0}
{"summary": "Write a summary or detailed account of the 2013–2014 chikungunya outbreak. Include information about the first recorded outbreak outside of tropical Africa and Asia, the specific timeline of events beginning in December 2013, the spread of the disease across the Caribbean, and the response from the Caribbean Public Health Agency (CARPHA), including the declaration of a Caribbean-wide epidemic.", "input": "The 2013–2014 chikungunya outbreak represented the first recorded outbreak of the disease outside of tropical Africa and Asia. In December 2013, the first locally transmitted case of chikungunya in the Americas was detected in Saint Martin. Shortly after the first case the disease began to spread rapidly throughout the Caribbean region. By the end of the year, it had spread to Martinique and Guadeloupe, with suspected cases in Saint Barthélemy. By the end of January 2014, cases had been confirmed in Saint Barthélemy, as well as the British Virgin Islands, Dominica, and French Guiana. On the basis of 4,000 confirmed cases and over 30,000 suspected cases, the Caribbean Public Health Agency (CARPHA) declared a Caribbean-wide epidemic of the virus in early May. By the end of May, four", "label": 1}
{"summary": "Summarize the details and significance of the 2014 United Nations Security Council election, including the allocation of non-permanent seats among regional blocs, the session during which the election took place, and the timeframe for the elected members' service on the council.", "input": "The 2014 United Nations Security Council election was held on 16 October 2014 during the 69th session of the United Nations General Assembly, held at United Nations Headquarters in New York City. The elections were for five non-permanent seats on the UN Security Council for two-year mandates commencing on 1 January 2015. In accordance with the Security Council's rotation rules, whereby the ten non-permanent UNSC seats rotate among the various regional blocs into which UN member states traditionally divide themselves for voting and representation purposes, the five available seats were allocated as follows: One for Africa One for the Asia-Pacific Group One for Latin America and the Caribbean Two for the Western European and Others GroupThe five members will serve on the Security Council for the 2015–16 period.", "label": 1}
{"summary": "Explain the concept of a news bureau and how it differs from a news desk. Include examples of specialized bureaus like a Tokyo bureau and foreign bureau to illustrate the geographic and operational scope of these offices. Also, describe the role of a bureau chief within a news bureau.", "input": "A news bureau is an office for gathering or distributing news. Similar terms are used for specialized bureaus, often to indicate a geographic location or scope of coverage: a ‘Tokyo bureau’ refers to a given news operation's office in Tokyo; 'foreign bureau' is a generic term for a news office set up in a country other than the primary operations center; a ‘Washington bureau’ is an office, typically located in Washington, D.C., that covers news related to national politics in the United States. The person in charge of a news bureau is often called the bureau chief. The term is distinct from a news desk, which refers to the editorial function of assigning reporters and other staff, and otherwise coordinating, news stories, and sometimes the physical desk where", "label": 0}
{"summary": "Write a detailed explanation about the United Nations High Seas Treaty, including its formal name, date of agreement, main objectives, and its significance within the framework of the United Nations Convention on the Law of the Sea (UNCLOS). Also, elaborate on how it impacts marine biodiversity, equitable access to research, and the commercialization of marine genetic resources.", "input": "The United Nations High Seas Treaty is an instrument of the United Nations Convention on the Law of the Sea (UNCLOS), agreed by an intergovernmental conference at the UN on 4 March 2023. Its full formal title is Agreement under the United Nations Convention on the Law of the Sea on the conservation and sustainable use of marine biological diversity of areas beyond national jurisdiction and is also known as the Biodiversity Beyond National Jurisdiction treaty.It has four main objectives: The establishment of marine protected areas to protect marine biodiversity. The regulation of commercialization of marine genetic resources, which can be used for the development of pharmaceuticals, in order to equitably share their benefits. The equitable access to research conducted in international waters. The setting of global standards", "label": 0}
{"summary": "On the afternoon of 24 May 2014, a gunman opened fire at the Jewish Museum of Belgium in Brussels, killing four people. Three of them, an Israeli couple on holiday and a French woman, died at the scene. The fourth victim, a Belgian employee of the museum, was taken to the hospital but died of his injuries on 6 June. A little less than a week later, on 30 May 2014, a suspect was arrested in the French city of Marseille in connection with the shooting. The suspect was Mehdi Nemmouche, a 29-year-old French national of Algerian origin. A second suspect, Nacer Bendrer, was identified and arrested later. Prior to the shooting, Nemmouche had already spent time in French prisons, where he became involved in radical Islam. After", "input": "On the afternoon of 24 May 2014, a gunman opened fire at the Jewish Museum of Belgium in Brussels, killing four people. Three of them, an Israeli couple on holiday and a French woman, died at the scene. The fourth victim, a Belgian employee of the museum, was taken to the hospital but died of his injuries on 6 June. A little less than a week later, on 30 May 2014, a suspect was arrested in the French city of Marseille in connection with the shooting. The suspect was Mehdi Nemmouche, a 29-year-old French national of Algerian origin. A second suspect, Nacer Bendrer, was identified and arrested later. Prior to the shooting, Nemmouche had already spent time in French prisons, where he became involved in radical Islam. After", "label": 1}
{"summary": "Write an informative summary about the results of the 2023 parliamentary elections in Estonia, including key details about the winning parties, changes in seat distribution, and notable political developments prior to the election.", "input": "Parliamentary elections were held in Estonia on 5 March 2023 to elect all 101 members of the Riigikogu. The officially published election data indicate the victory of the Reform Party, which won 37 seats in total, while the Conservative People's Party of Estonia (EKRE) placed second with 17 seats. The Centre Party won 16 seats, a loss of 10, while Estonia 200 won 14 seats, gaining representation in Riigikogu. After the previous parliamentary election in 2019, the Centre Party, led by Jüri Ratas, formed a government with Ratas serving as prime minister. His government was brought down in January 2021 after a corruption investigation, and Kaja Kallas of the Reform Party formed a coalition government with the Centre Party; which collapsed in June 2022. Kallas then formed a", "label": 0}
{"summary": "Can you summarize the events of the 2023 Princess Auto Players' Championship, focusing on the women's final between Isabella Wranå and Silvana Tirinzoni, and describe the key moments that led to Wranå's victory?", "input": "The 2023 Princess Auto Players' Championship was held from April 11 to 16 at the Mattamy Athletic Centre in Toronto, Ontario. It was the fifth Grand Slam event and final major of the 2022–23 curling season. In the women's final, Sweden's Isabella Wranå won her first Slam title, defeating the World Champion Silvana Tirinzoni rink from Switzerland 6–5. In the game, Wranå took a commanding lead in the fourth end, making an open hit for three to take a 4–1 lead. Tirinzoni scored a single in the fifth, but Wranå replied by getting a deuce in the sixth. The Tirinzoni rink had a chance to score three in the seventh to even the gap, but fourth thrower Alina Pätz missed a split attempt, but did end up getting", "label": 0}
{"summary": "Explain what the European Union's Fit for 55 package is and describe its main goals, proposed measures, and criticisms. Be sure to include details such as the target greenhouse gas emission reduction, key dates, specific initiatives like the Carbon Border Adjustment Mechanism, and any criticisms from organizations like Greenpeace.", "input": "Fit for 55 is a package by the European Union designed to reduce the European Union's greenhouse gas emissions by 55% by 2030. The package was proposed in July 2021 by the European Commission. Under an accelerated legislative process, the plans may become law in 2022. Measures include additional support for clean transport, renewables, and a tariff called the Carbon Border Adjustment Mechanism on emissions for high-carbon imports from countries lacking sufficient greenhouse gas reduction measures of their own. It proposes to extend the European Union Emissions Trading System to transport and heat. Compared to the net-zero scenario from the International Energy Agency, the plan contains more measures to ensure that energy remains affordable. The environmental organization Greenpeace criticized the package for not being suitable for halting global", "label": 0}
{"summary": "Write a comprehensive summary of the 2023 San Miguel Corporation (SMC) - Philippine Sportswriters Association (PSA) Annual Awards, detailing the significance of the ceremony, the location, notable attendees, and the athletes and organizations honored, including the Athlete of the Year, Hidilyn Diaz. Highlight the roles of key figures in attendance, such as Philippine Sports Commission Chairman Richard 'Dickie' Bachmann, Philippine Olympic Committee President Abraham 'Bambol' Tolentino, and guest speaker Michael Marcos Keon.", "input": "The 2023 San Miguel Corporation (SMC) - Philippine Sportswriters Association (PSA) Annual Awards was an annual awarding ceremony honoring the individuals (athletes, teams, officials and organizations) and organizations that made a significant impact to Philippine sports in 2022. The awarding ceremony was held at the March 6, 2023, at the Grand Ballroom of the Diamond Hotel in Manila. More than 100 sports personalities and entities will be bestowed in the awarding ceremony, highlighted by the crowing of Athlete of the Year to World Championships gold medalist Hidilyn Diaz.Philippine Sports Commission Chairman Richard \"Dickie\" Bachmann and Philippine Olympic Committee President Abraham \"Bambol\" Tolentino has been invited to witness the affair, while Project: Gintong Alay Director and Laoag, Ilocos Norte Mayor Michael Marcos Keon will serve as a guest speaker.The", "label": 0}
{"summary": "Provide a detailed summary of the Union Glacier Station, including its purpose, location, governance, historical milestones, and any notable collaborations or changes over time, based on the following text: The Estación Polar Científica Conjunta Glaciar Unión (or Union Glacier Joint Scientific Polar Station) or Union Glacier Station is a summer Antarctic base of Chile, situated on Union Glacier in the Ellsworth Mountains. It is jointly operated from November to January by the Chilean Antarctic Institute and the three armed forces of Chile. It was inaugurated on 4 January 2014 by Chilean President Sebastián Piñera Echeñique. In 2013, the Antarctic stations Teniente Arturo Parodi Alister and Antonio Huneeus were dismantled and their equipment was transferred to Union Glacier Station. This followed the relocation in November 2010 of the operations of the private American company Antarctic Logistics & Expeditions LLC, which has operated the landing strip on Union Glacier since December 2008 and also runs Union Glacier Camp. After the American", "input": "The Estación Polar Científica Conjunta Glaciar Unión (or Union Glacier Joint Scientific Polar Station) or Union Glacier Station is a summer Antarctic base of Chile, situated on Union Glacier in the Ellsworth Mountains. It is jointly operated from November to January by the Chilean Antarctic Institute and the three armed forces of Chile. It was inaugurated on 4 January 2014 by Chilean President Sebastián Piñera Echeñique.In 2013, the Antarctic stations Teniente Arturo Parodi Alister and Antonio Huneeus were dismantled and their equipment was transferred to Union Glacier Station. This followed the relocation in November 2010 of the operations of the private American company Antarctic Logistics & Expeditions LLC, which has operated the landing strip on Union Glacier since December 2008 and also runs Union Glacier Camp.After the American", "label": 1}
{"summary": "Generate a detailed description of the Wrestle Kingdom 17 event, including the collaboration between New Japan Pro-Wrestling and Pro Wrestling Noah, the significance of the Tokyo Dome and Yokohama Arena venues, and the tribute to NJPW founder Antonio Inoki. Highlight key matches and outcomes, such as Kazuchika Okada's victory over Jay White and Kenny Omega's match against Will Ospreay. Provide insights into the impact of these results and their importance within the professional wrestling world.", "input": "Wrestle Kingdom 17 was a two-day professional wrestling pay-per-view (PPV) event co-produced by the New Japan Pro-Wrestling (NJPW) and Pro Wrestling Noah (Noah) promotions. The first day of the event took place on January 4, 2023, at the Tokyo Dome in Tokyo, Japan and the second day of the event took place on January 21, 2023, at the Yokohama Arena in Yokohama, Japan. It is the 32nd January 4 Tokyo Dome Show and the 17th promoted under the Wrestle Kingdom name. The event was held in honor of the NJPW founder Antonio Inoki, who died on October 1, 2022. In the main event of night 1, Kazuchika Okada defeated Jay White to win the IWGP World Heavyweight Championship. In other prominent matches, Kenny Omega defeated Will Ospreay to", "label": 0}
{"summary": "Write a detailed summary of the Minsk agreements, highlighting their purpose, the entities involved, and the key events that led to their creation. Include information on the factions in the Donbas war, the role of international mediators, and the parties that signed the agreement, along with the geopolitical context of the negotiations in 2014.", "input": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing a central part. The first, known as the Minsk Protocol, was drafted in 2014 by the Trilateral Contact Group on Ukraine, consisting of Ukraine, Russia, and the Organization for Security and Co-operation in Europe (OSCE), with mediation by the leaders of France and Germany in the so-called Normandy Format. After extensive talks in Minsk, Belarus, the agreement was signed on 5 September 2014 by representatives of the Trilateral Contact Group and, without recognition of their status, by the then-leaders of the self-proclaimed Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). This agreement followed multiple previous", "label": 1}
{"summary": "Describe the unique characteristics of a hybrid solar eclipse and explain why it is considered rare. Also, include details of the specific regions where the totality of the hybrid solar eclipse on April 20, 2023, was visible.", "input": "A hybrid solar eclipse occurred on Thursday, April 20, 2023. A solar eclipse occurs when the Moon passes between Earth and the Sun thereby totally or partly obscuring the Sun for a viewer on Earth. A hybrid solar eclipse is a rare type of solar eclipse that changes its appearance from annular to total and back as the Moon's shadow moves across the Earth's surface. Totality occurs in a narrow path across the surface of the Earth, with the partial solar eclipse visible over a surrounding region thousands of kilometers wide. Hybrid solar eclipses are extremely rare, occurring in only 3.1% of solar eclipses in the 21st century.Totality for this eclipse was visible in the North West Cape peninsula and Barrow Island in Western Australia, eastern parts of", "label": 0}
{"summary": "Generate a detailed summary about the cross-border bus service that connects the two capitals, Delhi in India and Kathmandu in Nepal. Include the roles of the Delhi Transport Corporation and the Federation of Nepalese National Transport Entrepreneurs in operating this service. Additionally, describe the journey route starting from Dr. Ambedkar bus stand in Delhi and mention key locations in India that the bus travels through, as well as any unique features of the service like seating arrangements and amenities.", "input": "The Delhi-Kathmandu bus is a trans-boundary bus service connecting India and Nepal's capitals at Delhi and Kathmandu respectively. The service is operated by the Delhi Transport Corporation (DTC) and was launched in 2014.While Delhi Transport Corporation (DTC), a state run corporation, will run the bus service from Indian side, the Federation of Nepalese National Transport Entrepreneurs (FNNTE) is operating the bus service under supervision of the Ministry of Physical Infrastructure and Transport MoPIT. Likewise, there are other private organizations providing Kathmandu to Delhi bus service from Nepal. This bus service has a 2X2 seating arrangement and is an AC bus service. The service operates from Dr. Ambedkar bus stand near Delhi gate in Delhi. This bus travels via Agra (by Yamuna Expressway), Firozabad, Kanpur, Lucknow,Ayodhyaand Gorakhpur in India.", "label": 1}
{"summary": "Reflect on the tragic case of Eleanor Poppy Miranda de Freitas, who committed suicide three days before her trial for allegedly making a false rape accusation. Consider the ethical and societal implications of prosecuting individuals for such accusations, especially those with mental health vulnerabilities. Discuss how her case raises questions about whether such legal actions could discourage genuine victims from coming forward, and whether it is appropriate to pursue prosecution in these circumstances. Explore the roles and responsibilities of legal authorities, such as the Director of Public Prosecutions and the Attorney General, in making these complex decisions. Additionally, examine the response and accountability of the Metropolitan Police Service in situations like these.", "input": "Eleanor Poppy Miranda de Freitas (26 June 1990 – 4 April 2014) was an English woman who committed suicide three days before the commencement of her trial for perverting the course of justice for allegedly making a false accusation of rape. Her death prompted a debate over whether prosecuting people accused of making a false accusation of rape could deter rape victims from reporting the crime, as well as whether it was appropriate to prosecute vulnerable individuals (de Freitas had been diagnosed with bipolar disorder and depression and was judged by a psychiatrist to represent a suicide risk). The decision to prosecute de Freitas was ultimately upheld by both the Director of Public Prosecutions and the Attorney General for England and Wales, while the Metropolitan Police Service paid", "label": 1}
{"summary": "Write a detailed summary of the 2022 Uganda Ebola outbreak, focusing on the spread of the Sudan ebolavirus, the impact on regions within Uganda, and the measures taken by the Ugandan Ministry of Health. Include key statistics such as infection and mortality rates, affected districts, and notable events during the outbreak period from September 2022 to January 2023.", "input": "The 2022 Uganda Ebola outbreak was an outbreak of the Sudan ebolavirus, which causes Ebola, from 20 September 2022 until 10 January 2023 in the Western and Central Regions of Uganda. Over 160 people were infected, including 77 people who died. It was Uganda's fifth outbreak with Sudan ebolavirus. The Ugandan Ministry of Health declared the outbreak on 20 September 2022. As of 25 October 2022, there were confirmed cases in the Mubende, Kyegegwa, Kassanda, Kagadi, Bunyanga, Kampala and Wakiso districts. As of 24 October 2022, there were a total of 90 confirmed or probable cases and 44 deaths. On 12 October, the first recorded death in the capital of Kampala occurred; 12 days later on 24 October, there had been a total of 14 infections in the", "label": 0}
{"summary": "Compose a detailed summary about the United Nations Multidimensional Integrated Stabilization Mission in the Central African Republic (MINUSCA), including its initiation date, purpose, transformation from MISCA, scope of operations, and its role in protecting civilians under Chapter VII of the UN Charter.", "input": "United Nations Multidimensional Integrated Stabilization Mission in the Central African Republic (also called MINUSCA, which is an initialism of its French name Mission multidimensionnelle intégrée des Nations unies pour la stabilisation en Centrafrique) is a UN peacekeeping mission, which started on April 10, 2014, to protect Central African Republic civilians under Chapter VII of the UN Charter. It transformed the 6,000-strong African Union-led peacekeeping force known as MISCA into a UN peacekeeping mission and became operational on September 15, 2014. The UN deployed a transition team to set up MINUSCA and prepare for a seamless transition of authority from MISCA to MINUSCA. As of 30 September 2021, it has more than 15,000 troops, police and civilian personnel on the ground. Its role is to: support for the transition", "label": 1}
{"summary": "Write an informative article about Opération Chammal, a French military operation in Iraq and Syria, discussing its origins, objectives, key milestones, and the role of French forces in combating the expansion of the Islamic State of Iraq and the Levant. Include details about airstrikes, the deployment of French naval assets, and political decisions made during the operation.", "input": "Opération Chammal is a French military operation in Iraq and Syria launched to help curtail the expansion of the Islamic State of Iraq and the Levant and to support the Iraqi Army. Its name comes from the Shamal (Chammal in French), a northwesterly wind that blows over Iraq and the Persian Gulf states.Airstrikes over Iraq started 19 September 2014 and airstrikes over Syria started by the end of September 2015. The French operation was at first limited to airstrikes and French president François Hollande had stated that no ground troops would be deployed in the conflict. Additionally, the French frigate Jean Bart joined the United States Navy's Commander Task Force 50 (CTF 50) as an escort.On 14 November 2015, ISIS claimed that the terrorist attacks that took place", "label": 1}
{"summary": "Summarize the key events and reactions surrounding the escalation of tensions between Lebanon and Israel that took place in April, focusing on the rocket attacks, Israeli military response, and international reactions.", "input": "On April 6, dozens of rockets were fired from Lebanon into Israel, wounding 3 Israeli civilians. The IDF has said that it has intercepted 25 rockets fired from Lebanon. Warning sirens had sounded in the town of Shlomi and in Betzet in northern Israel. According to Israel, the rockets were fired by Palestinian factions Hamas and PIJ with Hezbollah's approval.On early morning April 7, the Israeli Air Force retaliated by striking targets in Tyre, Lebanon and in the Gaza Strip.In a written statement, the United Nations Interim Force in Lebanon (UNIFIL) described the situation as \"extremely serious\" and urged restraint. It said UNIFIL chief Aroldo Lazaro was in contact with authorities on both sides. The attacks are the largest escalation between the two countries since the 2006 Lebanon", "label": 0}
{"summary": "Write an in-depth analysis of the protests against the 2013 Egyptian coup d'état, focusing on the key events, including the removal of President Mohamed Morsi, the demonstrations that ensued, and the violent clashes such as the Rabaa massacre. Discuss the role of the Egyptian Armed Forces, the reactions of different factions, the impact of the month of Ramadan on the protests, Prime Minister Hazem al-Beblawy's warnings, and the eventual government crackdown on the Pro-Morsi sit-ins in Rabaa al-Adaweya and al-Nahda squares.", "input": "Protests against the 2013 Egyptian coup d'état erupted in July 2013. Immediately following the removal of President Mohamed Morsi by the Egyptian Armed Forces on 3 July 2013 amid demonstrations against Morsi's rule, many protesters amassed near the Rabia Al-Adawiya Mosque to call for Morsi's return to power and condemn the military, while others demonstrated in support of the military and interim government. Deadly clashes such as Rabaa massacre continued for several days, with three particularly bloody incidents being described by officials as \"massacres\" perpetrated by security forces. During the month of Ramadan (10 July – 7 August), prime minister Hazem al-Beblawy threatened to disperse the ongoing Pro-Morsi sit-ins in Rabaa al-Adaweya square and al-Nahda square. The government crackdown of these protests occurred in a violent dispersal on", "label": 1}
{"summary": "Discuss the concept of global news flow and its significance in international media coverage. What factors contribute to certain countries being more newsworthy than others, and how does economic power influence their prominence in global news? Provide examples of countries that are frequently mentioned in international news and analyze the implications of unequal representation in global news coverage, particularly focusing on the under-representation of developing countries.", "input": "Global news flow (also referred to as international news flow) is a field of study that deals with the news coverage of events in foreign countries. It describes and explains the flow of news from one country to another.Studies on global news flow typically attempt to understand why certain countries are more newsworthy than others.. Along the years it has been found that the economic power of countries plays a particularly crucial role in their news prominence as well as the presence of international news agencies. Thus, the US has been found to be very prominent in news mentions around the world (18%), followed by China, Western European and Middle Eastern countries (about 3-5% each).The unequal representation of the world and the under-representation of developing countries have been", "label": 0}
{"summary": "Write a detailed summary about the 2014–15 North American winter, highlighting the frigid conditions, early onset of wintry weather, significant snowfalls in regions like Arkansas and Oklahoma, and the role of the polar vortex. Be sure to include specific temperature drops and any records broken during this time.", "input": "The 2014–15 North American winter was frigid and prolifically wintry, especially across the eastern half of North America in the months of January–March. The season began early, with many places in North America experiencing their first wintry weather during mid-November. A period of below-average temperatures affected much of the contiguous United States, and several records were broken. An early trace of snowfall was recorded in Arkansas. There were greater accumulations of snow across parts of Oklahoma as well. A quasi-permanent phenomenon referred to as the polar vortex may have been partly responsible for the cold weather. Temperatures in much of the United States dropped 15 to 35 °F (8.3 to 19 °C) below average by November 19, following a southward \"dip\" of the polar vortex into the eastern", "label": 1}
{"summary": "Write a detailed description about the 29th Annual Screen Actors Guild Awards, including key information such as the date and location of the event, how and where it was streamed, and any significant changes to its broadcast format. Include details about the announcement of nominees and individuals involved in the ceremony.", "input": "The 29th Annual Screen Actors Guild Awards, honoring the best achievements in film and television performances for the year 2022, were presented on February 26, 2023 at the Fairmont Century Plaza in Century City, California. The ceremony streamed live on Netflix's YouTube channel, starting at 8:00 p.m. EST / 5:00 p.m. PST. The nominees were announced on January 11, 2023 by Ashley Park and Haley Lu Richardson via Instagram Live.In May 2022, it was confirmed that the ceremony would no longer air on TNT and TBS (the ceremony had aired on TNT since 1998 and had been also broadcast on TBS since 2006); a spokesperson insisted that finding a new home for the ceremony \"is not unusual and has occurred several times over the history of the SAG", "label": 0}
{"summary": "Write a detailed summary of the 19th Empire Awards ceremony, officially known as the Jameson Empire Awards. Include information such as the date, location, purpose, number of categories, any new awards introduced, special honorary awards, the event's host, and the sponsor. Mention any notable events related to Empire magazine or its partnership with Jameson Irish Whiskey.", "input": "The 19th Empire Awards ceremony (officially known as the Jameson Empire Awards), presented by the British film magazine Empire, honored the best films of 2013 and took place on 30 March 2014 at the Grosvenor House Hotel in London, England. During the ceremony, Empire presented Empire Awards in 14 categories as well as five honorary awards. The awards for Best Best Supporting Actor and Best Supporting Actress were first introduced this year. To celebrate the 25th anniversary of Empire magazine two special honorary awards were presented, the Action Hero of our Lifetime and the Legend of our Lifetime awards. Irish actor James Nesbitt hosted the show for the first time. The awards were sponsored by Jameson Irish Whiskey for the sixth consecutive year.In related events, Empire and Jameson", "label": 1}
{"summary": "Write a continuation of the following text:\n\nOn 10 January 2023, Constantine II of Greece, Head of the Royal House of Greece, who reigned as the last King of the Hellenes from 6 March 1964 to 1 June 1973, died in Athens at the age of 82. After suffering a stroke in hospital, Constantine was placed in intensive care, before dying days later. His death was initially announced by an Associated Press report, which referenced hospital staff, however Constantine's private office later released a formal death statement. The Greek government declined the royal family's request for a state funeral, although it was later decided that Constantine should have a lying-in-state and a funeral procession. On 16 January, Constantine's body was laid for public viewing in the Agios Eleftherios Chapel in Athens from 6:00 am to", "input": "On 10 January 2023, Constantine II of Greece, Head of the Royal House of Greece, who reigned as the last King of the Hellenes from 6 March 1964 to 1 June 1973, died in Athens at the age of 82. After suffering a stroke in hospital, Constantine was placed in intensive care, before dying days later. His death was initially announced by an Associated Press report, which referenced hospital staff, however Constantine's private office later released a formal death statement. The Greek government declined the royal family's request for a state funeral, although it was later decided that Constantine should have a lying-in-state and a funeral procession. On 16 January, Constantine's body was laid for public viewing in the Agios Eleftherios Chapel in Athens from 6:00 am to", "label": 0}
{"summary": "Explore the implications of the 38th Film Independent Spirit Awards being scheduled eight days prior to the 95th Academy Awards in 2023. Consider how this timing, occurring during the final Oscar voting period, might influence the decisions of Academy voters based on the Spirit Awards winners. Discuss the potential impact this separation might have on both ceremonies and the industry as a whole.", "input": "The 38th Film Independent Spirit Awards, honoring the best independent films and television series of 2022, were presented by Film Independent on March 4, 2023. The film nominations were announced live via YouTube on November 22, 2022 by Raúl Castillo and Taylour Paige, while the television nominations were announced on December 13, 2022 by Asia Kate Dillon. Like last year, the ceremony was separated from its previous longtime berth on the day before the Academy Awards. Instead, there were eight days separating the ceremonies, with the 95th Academy Awards taking place on March 12, 2023. This ceremony occurred during the middle of final Oscar voting, taking place between March 2 and March 7, meaning the winners of this year's Independent Spirit Awards may have had an impact on", "label": 0}
{"summary": "Generate detailed information and analysis about the genus Patagotitan, focusing on its discovery, naming, and the scientific significance of its size estimates. Include comparisons with other titanosaur relatives such as Argentinosaurus, and discuss the implications of revised estimates on our understanding of sauropod dinosaur biology.", "input": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals, Patagotitan mayorum, which was first announced in 2014 and then validly named in 2017 by José Carballido and colleagues. Preliminary studies and press releases suggested that Patagotitan was the largest known titanosaur and land animal overall, with an estimated length of 37 m (121 ft) and an estimated weight of 69 tonnes (76 short tons). Later research revised the length estimate down to 31 m (102 ft) and weight estimates down to approximately 50–57 tonnes (55–63 short tons), suggesting that Patagotitan was of a similar size to, if not smaller than, its closest relatives Argentinosaurus and", "label": 1}
{"summary": "Write a detailed article about the 54th NAACP Image Awards, focusing on its purpose, key highlights, and notable nominees. Include information about the hosts, airing platforms, and the timeframe of untelevised category presentations. Provide context about the leading nominations, such as Black Panther: Wakanda Forever in films, Abbott Elementary in television, and Beyoncé and Kendrick Lamar in music. Ensure to cover the significance of the event and its impact on recognizing the achievements of people of color in various creative industries.", "input": "The 54th NAACP Image Awards, presented by the NAACP, honored outstanding representations and achievements of people of color in motion pictures, television, music, and literature during the 2022 calendar year. The ceremony was hosted by Queen Latifah and aired on February 25, 2023, on BET and simulcast on several of its sister Paramount Global Networks along with Paramount+. Presentations of untelevised categories was livestreamed from February 20 to February 24, 2023, on the ceremony's website.The nominations were announced on January 12, 2023, with the film Black Panther: Wakanda Forever leading the nominations with twelve nods, followed by the television sitcom Abbott Elementary which led the television categories with nine nominations. In the recording categories, Beyoncé and Kendrick Lamar lead the nominations with five each. For the first time", "label": 0}
{"summary": "Create a detailed summary of the activities and exposure of Team Jorge, an organization known for using cyber tactics to interfere with elections worldwide. Highlight their primary tools, the geographical scope of their operations, and the investigative efforts that led to their uncovering in February 2023.", "input": "Team Jorge is the name given to an outfit of Israeli contractors specialized in the use of malign cyber activities including hacking, sabotage and bot farm-run social media disinformation campaigns to manipulate the outcomes of elections. One of the organization's primary tools is a software package called Advanced Impact Media Solutions, or Aims. The group was exposed in February 2023 after an undercover operation by journalists from Israel and France as part of consortium of investigative journalists coordinated by Forbidden Stories. The organization has been active since at least 2015 and boasts of having manipulated 33 presidential elections worldwide, many of them in Africa, and in 27 cases with successful results.Their activities were revealed following a 2022 sting operation in Tel Aviv, carried out by three undercover journalists,", "label": 0}
{"summary": "Write an informative article explaining the concept of local news in journalism, its core focus areas, and how it contrasts with national or international news. Discuss the key features that define local newsrooms, such as regional politics, weather, business, and human interest stories. Additionally, analyze the recent trends in local news readership and viewership, including the decline in its audience, and explore insights from experts like Nikki Usher regarding the industry's shifting landscape.", "input": "In journalism, local news refers to coverage of events, by the news, in a local context that would not be an interest of another locality, or otherwise be of national or international scope. Local news, in contrast to national or international news, caters to the news of their regional and local communities; they focus on more localized issues and events. Some key features of local newsrooms includes regional politics, weather, business, and human interest stories. Local news readership has been declining in recent years, according to a recent study. And as more and more television consumers tap into streamed programming, local news viewership is beginning to decline. Nikki Usher, an associate professor at the College of Media at the University of Illinois, argued in The Complicated Future of", "label": 0}
{"summary": "Write a detailed account of the incredible survival story of José Salvador Alvarenga, a Salvadoran fisherman who survived 14 months adrift in the Pacific Ocean from November 2012 to January 2014. Include details about his diet, the challenges he faced, where he was found, and how he was rescued. Mention the role of the two locals who discovered him and the aftermath of his survival, such as his treatment and return to his family. Be sure to address the initial skepticism surrounding his story and why it was widely reported globally.", "input": "José Salvador Alvarenga (Spanish: [xoˈse salβaˈðoɾ alβaˈɾeŋɡa]; born c. 1975) is a Salvadoran fisherman and author who was found on January 30, 2014, aged 36 or 37, on the Marshall Islands after spending 14 months adrift in a fishing boat in the Pacific Ocean beginning on November 17, 2012. He survived mainly on a diet of raw fish, turtles, small birds, sharks and rainwater. He swam to shore at Tile Islet, a small island that is part of Ebon Atoll, on January 30. Two locals, Emi Libokmeto and Russel Laikidrik, found him naked, clutching a knife and shouting in Spanish. He was treated in a hospital in Majuro before flying to his family home in El Salvador on February 10.Alvarenga's story was heavily reported worldwide despite initial criticism", "label": 1}
{"summary": "Write a detailed summary or article about the 2023 International Conference on Climate Resilient Pakistan (also referred to as the 2023 Geneva conference), focusing on its purpose, key attendees, the framework presented by Pakistan, and its significance in the context of the devastating floods in 2022. Describe the role of the Pakistani Government and the United Nations in co-hosting the event, highlight the contributions of notable participants such as Prime Minister Shehbaz Sharif and UN Secretary-General Antonio Guterres, and explain the importance of the 'Resilient, Recovery, Rehabilitation, and Reconstruction Framework' (4RF) along with the funding mechanism and institutional arrangements proposed for its implementation in an open and transparent manner.", "input": "2023 International Conference on Climate Resilient Pakistan, more commonly referred to as 2023 Geneva conference, was a one-day international conference on aid to Pakistani Government after the devastating floods in 2022. The conference was co-hosted by the Pakistani Government and the United Nations, held on 9 January 2023 in Geneva, Switzerland. Shehbaz Sharif, the Prime Minister of Pakistan, and Antonio Guterres, the Secretary-General of the United Nations, began the one-day conference, the more than 450 attendees including private donors, international financial organizations, and government representatives from around 40 countries.In the conference, Pakistan presented the “Resilient, Recovery, Rehabilitation, and Reconstruction Framework” (4RF) and seek international support and long-term partnerships for its implementation. The 4RF document covers the funding mechanism and institutional arrangements for its execution in an open, transparent,", "label": 0}
{"summary": "Social media newsrooms (SMNs) are transforming the way companies share information by expanding accessibility beyond traditional online newsrooms. How can companies effectively use SMNs to engage with diverse stakeholders like bloggers, prospects, customers, and business partners? Discuss the advantages of incorporating multimedia content and social streams from platforms like YouTube and Twitter, and explore strategies for facilitating dialogue and information sharing within SMNs.", "input": "A social media newsroom is a company resource, set up to increase the functionality and usability of the traditional online newsroom. Social media newsrooms (SMNs) are intended to encourage dialogue and information sharing. Unlike online newsrooms, content is accessible to more than just journalists, but to all those with whom the company engages such as bloggers, their prospects, customers, business partners and investors. It gives these stakeholders access to news, public relations announcements, images, audio, video and other multimedia files. In addition to posting press releases and corporate news, companies can integrate other social content from sites such as YouTube, Flickr and Slideshow as well as streams from corporate Twitter accounts. Traditional tools for journalists such as corporate fast facts, leadership information, a multimedia library, financial information, awards", "label": 0}
{"summary": "During the 2023 Sudan conflict, the outbreak of violence has resulted in many foreign governments closely monitoring the situation and initiating plans for the evacuation and repatriation of their citizens. Egypt, with over 10,000 nationals in Sudan, and the United States, with more than 16,000 citizens—most of whom hold dual nationality—are among the countries with significant expatriate communities in the nation. The fighting, particularly around the airport in the capital city, Khartoum, has complicated extraction efforts. Consequently, many evacuations have been conducted by road to Port Sudan on the Red Sea, located approximately 650 km (400 miles) northeast of Khartoum. From there, evacuees have been airlifted or ferried to their respective home countries or to third countries. Other evacuation scenarios to consider include...", "input": "During the 2023 Sudan conflict the outbreak of violence has led foreign governments to monitor the situation in Sudan and move towards the evacuation and repatriation of its nationals. Among some countries with a number of expatriates in Sudan are Egypt, which has more than 10,000 citizens in the country, and the United States, which has more than 16,000 citizens, most of whom are dual nationals.Efforts at extraction were hampered by the fighting within the capital Khartoum, particularly in and around the airport. This has forced evacuations to be undertaken by road via Port Sudan on the Red Sea, which lies about 650 km (400 miles) northeast of Khartoum. from where they were airlifted or ferried directly to their home countries or to third ones. Other evacuations were", "label": 0}
{"summary": "Based on the historical evolution and current practices of media monitoring services, explore how these services have adapted to the technological advancements from the 19th to the 21st century. Discuss the impact of innovations such as telegraphy, radio, television, the photocopier, and the World Wide Web on the scope and capabilities of media monitoring. Additionally, consider how these services have specialized their coverage in response to client needs and changing media landscapes.", "input": "A media monitoring service, a press clipping service or a clipping service as known in earlier times, provides clients with copies of media content, which is of specific interest to them and subject to changing demand; what they provide may include documentation, content, analysis, or editorial opinion, specifically or widely. These services tend to specialize their coverage by subject, industry, size, geography, publication, journalist, or editor. The printed sources, which could be readily monitored, greatly expanded with the advent of telegraphy and submarine cables in the mid- to late-19th century; the various types of media now available proliferated in the 20th century, with the development of radio, television, the photocopier and the World Wide Web. Though media monitoring is generally used for capturing content or editorial opinion, it", "label": 0}
{"summary": "Generate a detailed report on the impacts of Cyclones Judy and Kevin on the island nation of Vanuatu, including chronological events, responses, and the subsequent 6.5 magnitude earthquake. Highlight the role of international aid from Australia and New Zealand in the aftermath.", "input": "Cyclones Judy and Kevin were a pair of intense tropical cyclones that made landfall on the Pacific island nation of Vanuatu within 48 hours of each other in March 2023. They were the fourth and fifth named storms of the 2022–23 South Pacific cyclone season respectively, as well as the second and third severe tropical cyclones of the season. By the end of February, Judy had affected the Solomon Islands, and shortly after, Kevin began to affect the country. The nations were pounded by powerful winds and destructive seas. Vanuatu was heavily affected, being struck by both cyclones two days apart. The government asked Australia and New Zealand for aid shortly after Judy's passage. During 3 March, as Kevin was impacting the islands, a magnitude 6.5 earthquake hit", "label": 0}
{"summary": "Write a detailed summary or description of the Eurovision Song Contest 2014. Include information about its location, the reason for its hosting in that location, the organizing entities, the venue, the dates of the event, the presenters, the number of participating countries, and any notable returns or absences among the participants.", "input": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only Teardrops\" by Emmelie de Forest. Organised by the European Broadcasting Union (EBU) and host broadcaster Danish Broadcasting Corporation (DR), the contest was held at B&W Hallerne, and consisted of two semi-finals on 6 and 8 May, and a final on 10 May 2014. The three live shows were presented by Danish television presenter Lise Rønne, musician Nikolaj Koppel and actor Pilou Asbæk.Thirty-seven countries participated in the contest; this included the return of Poland and Portugal after absences of two years and one year respectively. Overall, there were two fewer countries competing compared to the previous year,", "label": 1}
{"summary": "Write an informative description of the War of 1812 Monument in Ottawa, Canada, officially titled Triumph Through Diversity (Triomphe grâce à la diversité in French). Include details about its location, design materials, figures represented on the monument, their significance, and its placement in relation to other landmarks such as the National War Memorial. Highlight the inclusion of the maple tree planted with soil from Canadian battlefield sites and its symbolic importance.", "input": "The War of 1812 Monument, officially titled Triumph Through Diversity (Triomphe grâce à la diversité in French), is a bronze and stone memorial, located at Parliament Hill in Ottawa, Ontario, Canada, Canada's capital. Seven figures—a First Nations fighter, a Métis militiaman, a regular infantryman from the Royal Newfoundland Regiment of Fencible Infantry, a Quebec soldier of the Canadian Voltigeurs being bandaged by a female figure, a Royal Navy marine, and a farmer—represent those who took part on the Canadian side of the War of 1812. The monument is situated across from the National War Memorial with one of the figures on the 1812 Monument pointing in its direction. Also part of the monument is a maple tree planted in soil taken from 10 Canadian battlefield sites and watered", "label": 1}
{"summary": "Write a detailed analysis of the Swedish anti-terrorism bill of 2023, including its historical context, key provisions, controversies surrounding human rights concerns, and evolving geopolitical factors, such as Sweden's NATO application and Turkey's opposition based on alleged ties to groups like the PKK, PYD, YPG, and Gülen movement. Discuss the implications of this legislation for Sweden's domestic and international policies.", "input": "The Swedish anti-terrorism bill of 2023 refers to the anti-terrorism legislation debated by the Swedish parliament. The new legislation has been first proposed in 2017 following the Stockholm truck attack and would criminalise \"the participation in a terrorist organisation\". Sweden has debated introducing anti-terrorism legislation before but those efforts has been hampered by human rights activists. The legislation has not been finalized but gained new momentum following the Russian invasion of Ukraine in 2022, after which Sweden applied to join NATO, only for the Swedish application to run into opposition from Turkey, on the grounds that Sweden and Finland (which also applied at the same time) \"host terrorist organisations which act against Turkey\", including the PKK, PYD, YPG and Gülen movement. While the PKK is recognised as a", "label": 0}
{"summary": "Explore the dynamics and causes of the anti-government protests in Cambodia from July 2013 to July 2014. Discuss the key factors that led to these demonstrations, including allegations of electoral fraud, demands for higher wages, and resentment towards Vietnamese influence. Examine the role of the opposition party and the impact of government actions, particularly the crackdown in January 2014. Consider how perceptions of corruption, lack of freedom, and poor quality of life may have contributed to the unrest.", "input": "Anti-government protests (Khmer: បាតុកម្មប្រឆាំងរាជរដ្ឋាភិបាល) were a series of protests in Cambodia from July 2013 to July 2014. Popular demonstrations in Phnom Penh took place against the government of Prime Minister Hun Sen, triggered by widespread allegations of electoral fraud during the Cambodian general election of 2013. Demands to raise the minimum wage to $160 a month and resentment at Vietnamese influence in Cambodia have also contributed to the protests. The main opposition party refused to participate in parliament after the elections, and major demonstrations took place throughout December 2013. A government crackdown in January 2014 led to the deaths of 4 people and the clearing of the main protest camp.Cambodian protests may have been partly precipitated by the perception of corruption, lack of freedom and poor quality of", "label": 1}
{"summary": "Discuss the geopolitical implications of the 2014 China-Vietnam oil rig crisis, focusing on the actions taken by both China and Vietnam regarding the Hai Yang Shi You 981 oil platform near the disputed Paracel Islands. Consider the impact of China's announcement to complete the drilling work earlier than initially planned and reflect on the broader context of territorial disputes in the South China Sea.", "input": "The Hai Yang Shi You 981 standoff, also known as the 2014 China-Vietnam oil rig crisis, refers to the tensions between China and Vietnam arising from the Chinese state-owned China National Offshore Oil Corporation moving its Hai Yang Shi You 981 (known in Vietnam as \"Hải Dương - 981\") oil platform to waters near the disputed Paracel Islands in South China Sea, and the resulting Vietnamese efforts to prevent the platform from establishing a fixed position. According to an announcement by the Hainan Maritime Safety Administration of China, the drilling work of the Hai Yang Shi You 981 would last from May 2 to August 15, 2014. On July 15, China announced that the platform had completed its work and withdrew it fully one month earlier than originally", "label": 1}
{"summary": "Write about the mysterious case of Malaysia Airlines Flight 370, which vanished on 8 March 2014 during its journey from Kuala Lumpur to Beijing. Why did the communication with air traffic control end abruptly, and what does the deviation from the planned flight path suggest? Explore the sequence of events, the role of the Malaysian military's radar tracking, and speculate on possible reasons behind the disappearance of the Boeing 777-200ER.", "input": "Malaysia Airlines Flight 370 (MH370/MAS370) was an international passenger flight operated by Malaysia Airlines that disappeared on 8 March 2014 while flying from Kuala Lumpur International Airport in Malaysia to its planned destination, Beijing Capital International Airport in China. The crew of the Boeing 777-200ER, registered as 9M-MRO, last communicated with air traffic control (ATC) around 38 minutes after takeoff when the flight was over the South China Sea. The aircraft was lost from ATC’s secondary surveillance radar screens minutes later, but was tracked by the Malaysian military’s primary radar system for another hour, deviating westward from its planned flight path, crossing the Malay Peninsula and Andaman Sea. It left radar range 200 nautical miles (370 km; 230 mi) northwest of Penang Island in northwestern Peninsular Malaysia. With", "label": 1}
{"summary": "Write a detailed article explaining the Rotherham child sexual exploitation scandal. Include information about the timeline of events, starting from the late 1980s up until the 2010s, and discuss the role of local authorities, their failures to act, and any warnings or reports that were ignored. Mention the contributions of researcher Angie Heal, her findings between 2002 and 2007, and why this scandal is considered the 'biggest child protection scandal in UK history'. Highlight early warnings from care home managers in the 1990s, the involvement of taxi drivers, and any other significant details, such as the identification of alleged perpetrators from at least 2001.", "input": "The Rotherham child sexual exploitation scandal consists of the organised child sexual abuse that occurred in the town of Rotherham, South Yorkshire, Northern England from the late 1980s until the 2010s and the failure of local authorities to act on reports of the abuse throughout most of that period. Researcher Angie Heal, who was hired by local officials and warned them about child exploitation occurring between 2002 and 2007, has since described it as the \"biggest child protection scandal in UK history\". Evidence of the abuse was first noted in the early 1990s, when care home managers investigated reports that children in their care were being picked up by taxi drivers. From at least 2001, multiple reports passed names of alleged perpetrators, several from one family, to the", "label": 1}
{"summary": "Describe the events of the Zhengzhou Airport riot that took place on 5–6 February 2014 in China, including the reasons behind the passengers' anger, the extent of their actions, and the broader issues this event highlighted about China's commercial airline industry.", "input": "The Zhengzhou Airport riot occurred on 5–6 February 2014. Passengers at the airport in Zhengzhou, capital of the Chinese province of Henan, angry over lengthy delays due to snowy weather, smashed computers at airline check-in counters and destroyed information kiosks. It has been estimated that as many as 2,000 people took part over two days before police were able to restore order.Some of the angry passengers had been waiting for as long as five days to catch flights back to their jobs in other cities after their annual trips to see family during the Chinese New Year holiday period. They were further frustrated by the lack of information from airline and airport staff while they waited. The mass incident highlighted the difficulties faced by China's commercial airline industry", "label": 1}
{"summary": "Generate an article discussing the evolution of world news coverage, considering the impact of technological advancements such as satellite TV and the internet. Analyze how foreign correspondents and news agencies contribute to international journalism. Explore the blurred lines between world news and national news in contexts like the United States, with examples such as US involvement in international conflicts.", "input": "World news or international news or even foreign coverage is the news media jargon for news from abroad, about a country or a global subject. For journalism, it is a branch that deals with news either sent by foreign correspondents or news agencies, or – more recently – information that is gathered or researched through distance communication technologies, such as telephone, satellite TV or the internet. Although in most of the English-speaking world this field is not usually regarded as a specific specialization for journalists, it is so in nearly all the world. Particularly in the United States, there is a blurred distinction between world news and \"national\" news when they include directly the national government or national institutions, such as wars in which the US are involved", "label": 0}
{"summary": "Write a summary about the 65th Annual Grammy Awards, highlighting key details such as the venue, date, purpose, host, notable nominations and wins, and any significant achievements or records set during the event.", "input": "The 65th Annual Grammy Awards ceremony was a music awards ceremony held at the Crypto.com Arena in Los Angeles on February 5, 2023. It recognized the best recordings, compositions, and artists of the eligibility year – October 1, 2021 to September 30, 2022 – as determined by the members of National Academy of Recording Arts and Sciences. The nominations were announced on November 15, 2022. South African comedian Trevor Noah, who hosted the 63rd and 64th ceremonies, returned again.Beyoncé received the most nominations (nine) and tied Maverick City Music for wins (four), followed by Kendrick Lamar with eight nominations and three wins, and Adele and Brandi Carlile with seven nominations each. With a career total of 88 nominations, Beyoncé tied with her husband Jay-Z as the most nominated", "label": 0}
{"summary": "Discuss the implications of the European Court of Human Rights' ruling in the S.A.S. v. France case regarding the French ban on face covering. How did the Court justify its decision in relation to the European Convention on Human Rights, and what were the dissenting opinions of the minority judges? Additionally, consider the broader societal and legal impact of the loi n° 2010-1192 du 11 octobre 2010 interdisant la dissimulation du visage dans l'espace public, particularly in its aim towards banning the niqab.", "input": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR) provisions on right to privacy or freedom of religion, nor other invoked provisions. On these two points, the Court held her decision by fifteen votes to two. The two judges in the minority expressed their partly dissenting opinion. The French ban against face covering, loi n° 2010-1192 du 11 octobre 2010 interdisant la dissimulation du visage dans l'espace public, was adopted on 11 October 2010 and went into effect on 11 April 2011. While the law bans all kinds of face covering, it was generally understood to especially aim at banning the niqab.On the same day", "label": 1}
{"summary": "Generate a detailed summary of the Brit Awards 2023, including the date, location, host, red carpet presenters, trophy designer, most-nominated artists, and key winners of the evening.", "input": "Brit Awards 2023, the 43rd edition of the ceremony, presented by the British Phonographic Industry (BPI), was held on 11 February 2023 to recognise the best in British and international music. The ceremony took place at The O2 Arena in London, and was hosted by British comedian Mo Gilligan, who returns after hosting the 2022 edition. Coverage of the red carpet was broadcast on ITV2 and presented by Clara Amfo, Maya Jama and Roman Kemp. The 2023 Brit Award trophy was designed by Nigerian-born London-based artist Oluola Slawn.Going into the ceremony, Harry Styles and Wet Leg were the most-nominated artists, with four each. Styles emerged as the night's big winner, winning in all four of the categories he was nominated in, with Wet Leg and Beyoncé also winning", "label": 0}
{"summary": "Generate an in-depth analysis of the 2023 France–China summit, focusing on the key outcomes and geopolitical implications of Emmanuel Macron's state visit to China. Discuss the significance of this visit for France-China relations in the post-COVID era, including the composition of Macron's delegation and the objectives of bringing over 50 CEOs along. Examine Macron's meetings with Xi Jinping and Ursula von der Leyen, with particular emphasis on their discussions about the ongoing war in Ukraine and the possibilities of China acting as a mediator. Reflect on how this summit reflects efforts to 'reconnect' with China after three years of pandemic-induced separation.", "input": "The 2023 France–China summit was a three-day state visit by Emmanuel Macron, the President of France, to China from April 5 to 7, 2023. It was Macron's first visit to China since the COVID-19 pandemic and his third since taking office in 2017. He was accompanied by a delegation of more than 50 CEOs and met with the French business community in China. He also met with Xi Jinping, the General Secretary of the Chinese Communist Party and President of China, and Ursula von der Leyen, the President of the European Commission, to discuss various issues, especially the ongoing war in Ukraine and China's potential role as a mediator between Russia and the West. The visit was seen as an attempt to \"reconnect\" with China after three years", "label": 0}
{"summary": "Generate a detailed summary of the Chang'e 5-T1 mission, highlighting its objectives, components, achievements, and significance in the context of the Chinese Lunar Exploration Program. Include a discussion on the capsule design tests for Chang'e 5, the naming and landing details of the return capsule Xiaofei, and the CE-5-T1 Service Module's entry into lunar orbit.", "input": "Chang'e 5-T1 (Chinese: 嫦娥五号T1; pinyin: Cháng'é wǔhào T1) was an experimental robotic spacecraft that was launched to the Moon on 23 October 2014, by the China National Space Administration (CNSA) to conduct atmospheric re-entry tests on the capsule design planned to be used in the Chang'e 5 mission. As part of the Chinese Lunar Exploration Program, Chang'e 5, launched in 2020, was a Moon sample return mission. Like its predecessors, the spacecraft is named after the Chinese Moon goddess Chang'e. The craft consisted of a return vehicle capsule and a service module orbiter.The return capsule of Chang'e 5-T1, named Xiaofei (Chinese: 小飞), meaning \"little flyer\" in Chinese, landed in Siziwang Banner, Inner Mongolia, on 31 October 2014, 22:42 UTC. The CE-5-T1 Service Module entered lunar orbit on 13", "label": 1}
{"summary": "Based on the provided text, generate a detailed discussion around the Global Pact for the Environment project. Include information about its inception, the key figures involved like Laurent Fabius, the major steps and resolutions in its development such as the United Nations General Assembly resolution in May 2018, and significant actions taken by international bodies like the nomination of co-facilitators by the United Nations Environment Programme in 2020. Explore the geopolitical dynamics reflected by the voting patterns and discuss the potential impacts and challenges faced in negotiating an international environmental agreement.", "input": "The Global Pact for the Environment project was launched in 2017 by a network of experts known as the \"International Group of Experts for the Pact\" (IGEP). The group is made up of more than a hundred legal experts in environmental law and is chaired by former COP21 President Laurent Fabius.On 10 May 2018, the United Nations General Assembly adopted, by 142 votes in favor, 5 votes against (United States, Russia, Syria, Turkey, and the Philippines) and 7 abstentions (Saudi Arabia, Belarus, Iran, Malaysia, Nicaragua, Nigeria, and Tajikistan), a resolution paving the way for the negotiation of a Global Pact for the Environment (Resolution A/72/L.51 of 10 May 2018, \"Towards a Global Pact for the Environment\").On 8 May 2020, the United Nations Environment Programme nominated two co-facilitators to", "label": 0}
{"summary": "Discuss the political landscape and negotiations following the simultaneous federal and regional elections in Belgium on 25 May 2014. Include details about the formation of the new Federal Government, the regional governments, and the ideological families involved. Highlight the composition and characteristics of the outgoing Di Rupo Government and the new Michel Government.", "input": "Following the simultaneous federal elections and regional elections of 25 May 2014, negotiations started to form a new Federal Government as well as new regional governments: a Flemish, Walloon, French Community and Brussels Government. A Government of the German-speaking Community was formed only a few days after the elections. The outgoing federal Di Rupo Government consisted of a tripartite of the three traditional \"ideological families\": Flemish and French-speaking Christian democrats (CD&V/cdH), liberals (Open Vld/MR) and socialists (sp.a/PS). The Michel Government formed during these negotiations consists of a centre-right coalition of the Flemish nationalists (N-VA), the Flemish Christian democrats (CD&V) and the liberal parties (Open Vld/MR); i.e. only one party at French-speaking side. The new Flemish Government reflects the same coalition, whereas the Walloon and French Community Governments are", "label": 1}
{"summary": "Summarize the key outcomes and notable matches of the 2023 Rebellion wrestling PPV event produced by Impact Wrestling, including the location and date of the event, the main event results, and other significant matches and their winners.", "input": "The 2023 Rebellion was a professional wrestling pay-per-view (PPV) event produced by Impact Wrestling. It took place on April 16, 2023, at the Rebel Entertainment Complex in Toronto, Ontario, Canada. It was the fifth event under the Rebellion chronology. Ten matches were contested at the event, including two on the pre-show and one taped as a digital exclusive. In the main event, Deonna Purrazzo defeated Jordynne Grace to win the vacant Impact Knockouts World Championship. In other prominent matches, Steve Maclin defeated Kushida to win the vacant Impact World Championship, Trey Miguel defeated Jonathan Gresham and Mike Bailey to retain for the Impact X Division Championship, and Team Dreamer (Tommy Dreamer, Bhupinder Gujjar, Frankie Kazarian, Killer Kelly, and Yuya Uemura) defeated Team Bully (Bully Ray, Brian Myers, Kenny", "label": 0}
{"summary": "Imagine you're tasked with creating an engaging narrative for a documentary film about Kate Bush's 'Before the Dawn' concert residency in 2014. Your story should capture the excitement of her return to live performances after decades, the anticipation leading up to the sold-out shows, and the impact it had on both her devoted fans and the music scene in London. How would you narrate the events, emotions, and atmosphere surrounding these historic performances?", "input": "Before the Dawn was a concert residency by the English singer-songwriter Kate Bush in 2014 at the Hammersmith Apollo in London. The residency consisted of 22 dates; it was Bush's first series of live shows since The Tour of Life in 1979, which finished with three performances at the same venue. A live recording of the same name was released in physical and digital formats in November 2016.On 21 March 2014, Bush announced via her website her plans to perform live. Pre-sale tickets were on sale for fans who had signed up to her website and an additional seven dates were added to the original 15, due to the high demand. Tickets were on sale to the general public on 28 March and were sold out within 15", "label": 1}
{"summary": "Mercedes-Benz Fashion Week Sydney is a prestigious event in the fashion industry, aligning with Australian Fashion Week, and takes place annually at Carriageworks. The 2014 edition, held from April 6 to 10, was especially noteworthy, featuring over 70 designers including local talents from cities like Sydney, Melbourne, Perth, Brisbane, and Adelaide, and international designers from Bali and China. Notably, Lan Yu made history as the first Chinese designer to participate in this event. Dive into the atmosphere of this industry-only showcase that highlights startup labels fresh out of fashion school and connects Australian designers with global fashion buyers, press, and consumers. Explore how the event fosters innovation and launches new voices in the world of fashion, and learn about its impact on the industry as it continues to evolve.", "input": "Mercedes-Benz Fashion Week is an annual fashion industry event held in Sydney, Australia. The event is a part of Australian Fashion Week and has taken place at Carriageworks for two consecutive years. The 2014 event was held from 6–10 April. The event focuses on providing Australian designers a platform to connect with a global audience of fashion buyers, press and consumers.The industry-only event showcased over 70 designers, including 25 designers from Sydney, four from Melbourne, four from Perth, two from Brisbane and one from Adelaide. There was also one designer from Bali and China. The 2014 designer showcase featured mostly start-up labels fresh from fashion school. Lan Yu became the first Chinese designer to showcase at Mercedes-Benz Fashion Week Australia. In 2013, Mercedes-Benz Fashion Week Sydney generated an", "label": 1}
{"summary": "Based on the details provided about the Anti-Homosexuality Bill, 2023 in Uganda, discuss the potential social and political implications of such legislation on the country's international relations, its LGBTQ+ community, and broader human rights issues. Consider the historical context of similar legislation and offer insights into how such laws could impact freedoms and societal dynamics. Further, evaluate the responses from international communities, human rights organizations, and local activists. What are the possible long-term consequences of this bill if it were to become law?", "input": "The Anti-Homosexuality Bill, 2023 is a Ugandan parliamentary bill that restricts freedom of speech on LGBT topics and criminalises homosexuality. On 21 March 2023, the bill was read a third time, and was then sent to President Yoweri Museveni for assent. Museveni returned the bill to parliament for reconsideration on 21 April 2023.Under the bill, persons convicted of gay sex are liable imprisonment for life. The bill additionally prescribes the death penalty for 'aggravated homosexuality'. The latter offence includes same-sex rape, sex in a position of authority or procured by intimidation, sex with persons older than seventy-five, and sex with the disabled and mentally ill. Further, under its provisions, promotion (including normalisation) of homosexuality is punishable by imprisonment and fines. The bill has been condemned by the United", "label": 0}
{"summary": "Write an informative and concise summary about the Geostationary Defense and Strategic Communications Satellite 2 (SGDC-2), including details about its purpose, operational status, procurement process, and relevant updates as of July 2019.", "input": "The Geostationary Defense and Strategic Communications Satellite 2 or SGDC-2 (in Portuguese: Satélite Geoestacionário de Defesa e Comunicações Estratégicas 2) is a Brazilian geostationary communication satellite that is currently in the planning stages. It will launched as a backup to SGDC-1. An open procurement period is being planned as of April 2019; a contract has yet to be signed for the satellite's construction. It will be operated by the Brazilian state-owned company Telebrás and launched no earlier than 2022.In August 2019, Brazil's federal audit court – the TCU – suspended the open procurement period due to financial and technical irregularities present within the procurement process. Telebrás was asked to address these concerns in order to proceed with the selection of a satellite construction supplier for SGDC-2.As of July", "label": 0}
{"summary": "Write a detailed account of the 2014 general elections in Fiji, including the date of the elections, the political parties that participated, the election results, the background and reasons for the delay, and any significant developments leading up to the elections. Be sure to include information about the electoral threshold, the new constitution, and the outcome for the winning party.", "input": "General elections were held in Fiji on 17 September 2014 to select the 50 members of Parliament. The FijiFirst party led by Prime Minister Frank Bainimarama won a landslide victory, winning 32 of the 50 seats. The Social Democratic Liberal Party and the National Federation Party were the only other two parties to cross the 5% electoral threshold and win seats.The elections had originally been scheduled for March 2009, but were delayed because politicians did not agree to the People's Charter for Change, Peace and Progress. Between 2009 and 2014 several public announcements and requests were made for elections, and on 23 March 2014 the interim government announced the elections would be held on 17 September 2014. The elections were to be held under the new constitution which", "label": 1}
{"summary": "Write a comprehensive summary and analysis of Azerbaijan's participation in the Eurovision Song Contest 2014. Discuss key details such as the selection process, the talent show Böyük Səhnə, the song 'Start a Fire,' and performer Dilara Kazimova. Include insights into the song's presentation to the public, its placement in the semi-final, and its performance order. Provide context on the significance of Azerbaijan's entry and its overall impact in the contest held in Copenhagen, Denmark.", "input": "Azerbaijan participated in the Eurovision Song Contest 2014 with the song \"Start a Fire\" written by Stefan Örn, Johan Kronlund and Alessandra Günthardt. The song was performed by Dilara Kazimova. The Azerbaijani Eurovision entrant for the 2014 contest in Copenhagen, Denmark was selected through Böyük Səhnə, a talent show organised by the Azerbaijani broadcaster İctimai Television (İTV). Following three elimination shows and a final on 2 March 2014, a five-member jury selected Dilara Kazimova as the winner. The song \"Start a Fire\" was internally selected and presented to the public on 16 March. Azerbaijan was drawn to compete in the first semi-final of the Eurovision Song Contest which took place on 6 May 2014. Performing during the show in position 8, \"Start a Fire\" was announced among the", "label": 1}
{"summary": "Discuss the implications of the civil unrest incidents in France that began on 19 January 2023, focusing on the opposition to the pension reform bill by the Borne government. How did the use of Article 49.3 to pass the bill impact the protests and subsequent political actions, such as the failed no confidence votes? Explore the role of various organizations, including human rights groups, in condemning the government's response to the protests, and the issues surrounding the treatment of journalists during this period.", "input": "A series of civil unrest incidents began in France on 19 January 2023, organised by opponents of the pension reform bill proposed by the Borne government, which would increase the retirement age from 62 to 64 years old. The strikes have led to widespread disruption, including garbage piling up in the streets and public transport cancellations. In March, the government used Article 49.3 of the Constitution to force the bill through the French Parliament, sparking more protests and two failed no confidence votes, contributing to an increase in violence in protests alongside the union-organised strike action. Several organizations, including human rights groups such as Reporters Without Borders and France's Human Rights League condemned France's crackdown on protests and also denounced the assault on journalists. In addition, the Council", "label": 0}
{"summary": "Write a news report on a series of bombings that took place in Weare, New Hampshire. Include details about the timing and location of the explosions, the involvement of ATF and FBI agents, and the response from local authorities. Mention the subsequent arrest of Dale Stewart in connection with the incidents, and the discovery of a pipe bomb in his car. Discuss the impact on the local community and any requests made to residents for assistance in the investigation.", "input": "At around 6:10 PM EDT on April 26, 2023, what was later determined to be an improvised explosive device exploded in Weare, New Hampshire at a home on NH Route 77. ATF and FBI agents responded to the scene. A second bomb exploded at 6:50 AM the next day inside a van parked along Sugar Hill Road. The driver of the van reported that he was driving when he noticed the bomb, pulled over to remove it, and it exploded in front of him, causing minor injuries. Residents within 2 miles of either bombing have been asked to review their surveillance tapes for anything suspicious.On 27 April 2023, Dale Stewart was arrested in Webster and a pipe bomb was found in his car and neutralized. He was arraigned", "label": 0}
{"summary": "Explore the unfolding of the Trojan Horse scandal, also known as 'Operation Trojan Horse' or the Trojan Horse affair, occurring in Birmingham, England. Delve into the claims of an alleged conspiracy to infuse an 'Islamist' or 'Salafist' ethos within several local schools. Examine the genesis of the scandal, stemming from an anonymous letter sent to Birmingham City Council in late 2013 by supposed Birmingham 'Islamists.' This letter outlined strategies to seize control of a school and pondered expanding the operation to other cities, subsequently leaked to the press in March 2014. In the following month, Birmingham City Council reported receiving hundreds of allegations of similar plots dating back over 20 years. Investigate the role of key figures, like Tahir Alam, the former chairman of Park School.", "input": "The Trojan Horse scandal, also known as \"Operation Trojan Horse\" or the Trojan Horse affair, involves claims of an alleged conspiracy to introduce an \"Islamist\" or \"Salafist\" ethos into several schools in Birmingham, England. The name, based on the Greek legend, comes from an anonymous letter sent to Birmingham City Council in late 2013, alleged to be from Birmingham \"Islamists\" detailing how to wrest control of a school, and speculating about expanding the scheme to other cities. The letter was leaked to the press in March 2014. Around a month later, Birmingham City Council revealed that following the letter release it had received hundreds of allegations of plots similar to those described in the letter, some claims dating back over 20 years.Tahir Alam, former chairman of the Park", "label": 1}
{"summary": "Generate a comprehensive summary of the Brit Awards 2014, including details about the event's date, venue, host, leading nominees, major winners, and notable innovations. Highlight significant aspects such as the backstage livestream and unique statistics or records associated with the event, like the oldest winner of an award.", "input": "Brit Awards 2014 was held on 19 February 2014. It was the 34th edition of the British Phonographic Industry's annual pop Brit Awards. The awards ceremony was held at The O2 Arena in London and was presented by James Corden for the fourth consecutive year. Leading the nominations was Ellie Goulding with five nominations. Arctic Monkeys and One Direction both won the most awards, winning two awards each. For the first time ever, a backstage livestream was broadcast on the internet, via YouTube. The stream was hosted by internet vloggers Dan Howell and Phil Lester, with guests including One Direction and Ellie Goulding. 67-year-old David Bowie became the oldest winner to date of the British Male Solo Artist award.A new glossy black finish design statue designed by fashion", "label": 1}
{"summary": "Write a concise summary about the 2014 general elections in Bahrain, mentioning key details such as the date of elections, voter turnout, political boycotts, the number of candidates and women participants, and the overall outcomes in terms of representation and independents' success. Additionally, highlight the Shiite opposition's stance and the impact on Shiite MPs.", "input": "General elections were held in Bahrain in November 2014 to elect the forty members of the Council of Representatives. The first round of voting took place on 22 November, with a second round on 29 November in the 34 constituencies in which no candidate received a majority.The elections were boycotted by the Shiite Islamist opposition Al-Wefaq. Of the 266 candidates, 22 were women. According to election officials, 349,713 Bahrainis, including 175,998 men and 173,175 women, were listed to vote. Although the government announced the voter turnout as 52.6%, the opposition claimed it was only 30%.Independents won 37 of the 40 seats with Sunni Islamists losing two of their five seats. The number of Shiite MPs fell to 14 as a result of the Al-Wefaq boycott. Female representation was", "label": 1}
{"summary": "Write an informative summary of the Battle of Shuja'iyya, which took place on 20 July 2014 during the 2014 Israel–Gaza conflict, involving clashes between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades in the Shuja'iyya neighborhood of Gaza City. Include details about the population density, the area's characterization by the IDF, rocket fire statistics, and casualty figures as reported by the UN Protection Cluster.", "input": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in the Gaza Strip.: 71 Shuja'iyya, with 92,000 people in 6 sq-kilometres, is one of the most densely populated areas of the Gaza Strip. According to the IDF, it had become a \"terrorist fortress\", that between 8 and 20 July had fired over 140 rockets into Israel after the outbreak of hostilities. Casualty figures are not known with precision, partly because bodies were recovered long after the fighting, and people had also died of injuries afterwards. The UN Protection Cluster states that between the 19-20th, 55 civilians, including 19 children and 14 women, were killed as a", "label": 1}
{"summary": "Write a detailed summary of the by-election held in the Cook Islands constituency of Mitiaro on 11 November 2014, including the circumstances that led to it, the candidates involved, legal challenges, and the final outcome.", "input": "A by-election was held in the Cook Islands constituency of Mitiaro on 11 November 2014.In the July 2014 general election, the contest for the Mitiaro seat resulted in a tie. Incumbent MP Tangata Vavia, of the Democratic Party, received 50 votes, but so did Cook Islands Party challenger Tuakeu Tangatapoto. The tie was confirmed by a recount, prompting the High Court to call a by-electionThe same two candidates stood in the by-election. The by-election took place, but counting was delayed due to a legal challenge by the Cook Islands Party. The court ultimately ruled that one person had voted illegally in the Mitiaro constituency in the general election, and invalidated that person's ballot. This resulted in Democratic Party candidate Tangata Vavia being declared elected by 50 votes to", "label": 1}
{"summary": "Provide a detailed summary of Typhoon Hagupit, also known as Typhoon Ruby in the Philippines, including its significance in 2014, its development, impacts on the Philippines, and comparison to Typhoon Haiyan. Use specific details such as its classification, peak intensity, landfall, fatalities, and economic damage caused.", "input": "Typhoon Hagupit (hə-goo-PEET, [hɐguˈpit]; Filipino word meaning \"lashing or flogging\"), known in the Philippines as Typhoon Ruby, was the second most intense tropical cyclone in 2014. Hagupit particularly impacted the Philippines in early December while gradually weakening, killing 18 people and causing $114 million (2014 USD) in the country. Prior to making landfall, Hagupit was considered the worst threat to the Philippines in 2014, but it was significantly smaller than 2013's Typhoon Haiyan.Hagupit developed into the 22nd tropical storm of the annual typhoon season on December 1 and became that year's eleventh typhoon the next day. Under a favorable environment, the typhoon underwent rapid deepening and reached peak intensity northwest of Palau on December 4, with a clear eye. Hagupit slightly weakened but restrengthened on December 5, but", "label": 1}
{"summary": "Compose a comprehensive summary of the third competition weekend of the 2014–15 ISU Speed Skating World Cup, held in Berlin, Germany at Sportforum Hohenschönhausen from December 5 to December 7, 2014. Include key highlights such as Artur Waś of Poland winning both men's 500 m races, Ireen Wüst of the Netherlands securing three gold medals in the 1500 m, 3000 m, and team pursuit events, Lee Sang-hwa of South Korea winning both women’s 500 m races, and Heather Richardson of the United States earning four silver medals. Additionally, mention that no world records were set but Christian Oberbichler of Switzerland set a new national record in the B division.", "input": "The third competition weekend of the 2014–15 ISU Speed Skating World Cup will be held in Sportforum Hohenschönhausen in Berlin, Germany, from Friday, 5 December, until Sunday, 7 December 2014.Artur Waś of Poland both men's 500 m races. In the women's competitions, Ireen Wüst of the Netherlands won three gold medals; in the 1500 m and 3000 m races, as well as in the team pursuit. Lee Sang-hwa of South Korea won both 500 m races. Heather Richardson of the United States managed to take no less than four silver medals; in both 500 m races, as well as the 1000 m and 1500 m races.No world records were set during the weekend, but Christian Oberbichler of Switzerland set a new national record on in the B division", "label": 1}
{"summary": "On 24 February 2022, Russia invaded and occupied parts of Ukraine in a major escalation of the Russo-Ukrainian War, which had begun in 2014. The invasion has resulted in tens of thousands of deaths on both sides, and instigated Europe's largest refugee crisis since World War II. About 8 million Ukrainians were displaced within their country by June, and more than 8.1 million had fled the country by March 2023. For months before the invasion, Russian troops massed around Ukraine's borders while Russian officials repeatedly denied plans to attack Ukraine. On 24 February 2022, Russian President Vladimir Putin announced a \"special military operation\" to support the Russian-controlled breakaway republics of Donetsk and Luhansk, whose military forces had been fighting Ukraine in the Donbas conflict. He said the goal", "input": "On 24 February 2022, Russia invaded and occupied parts of Ukraine in a major escalation of the Russo-Ukrainian War, which had begun in 2014. The invasion has resulted in tens of thousands of deaths on both sides, and instigated Europe's largest refugee crisis since World War II. About 8 million Ukrainians were displaced within their country by June, and more than 8.1 million had fled the country by March 2023. For months before the invasion, Russian troops massed around Ukraine's borders while Russian officials repeatedly denied plans to attack Ukraine. On 24 February 2022, Russian President Vladimir Putin announced a \"special military operation\" to support the Russian-controlled breakaway republics of Donetsk and Luhansk, whose military forces had been fighting Ukraine in the Donbas conflict. He said the goal", "label": 0}
{"summary": "Write a detailed summary about the 2014 Toronto municipal election, including the date, positions contested, voter turnout, candidate registration timeline, and any notable details about the election process.", "input": "The 2014 Toronto municipal election was held on October 27, 2014, to elect a mayor and 44 city councillors in Toronto, Ontario, Canada. In addition, school trustees were elected to the Toronto District School Board, Toronto Catholic District School Board, Conseil scolaire de district du Centre-Sud-Ouest and Conseil scolaire de district catholique Centre-Sud. The election was held in conjunction with those held in other municipalities in the province of Ontario. Candidate registration opened on January 2, 2014, and closed on September 12, 2014, at 2pm EST.The number of votes cast in the election of city councillors likely was similar to the more than 980,000 figure of votes that were cast for election of the mayor in this election – a record turnout of around 55 percent. Christin Carmichael", "label": 1}
{"summary": "Write about the 2014–2016 Croatian war veterans' tent protest, a 555-day-long demonstration often called 'The Tenters' (Croatian: šatoraši). Include details about its origins, such as the initial focus on the Ministry of Croatian Veterans and key figures like Bojan Glavašević and Predrag Matić. Describe how the protests evolved to demand the resignation of left-wing Prime Minister Zoran Milanović and then-President Ivo Josipović. Highlight significant escalations, including the May 2015 events where protesters in Zagreb's Upper Town clashed with police and barricaded themselves inside St. Mark Church. Additionally, describe the gas bottle standoff on Savska street near the central tent. Pay attention to the broader political and social context of these events.", "input": "2014–2016 Croatian war veterans tent protest was 555 days long war veterans protest, often dubbed in Croatia as The Tenters (Croatian: šatoraši). The protests were initially aimed against Ministry of Croatian Veterans deputy Bojan Glavašević and Minister Predrag Matić himself, however the protesters subsequently changed their demands and started demanding the resignation of left-wing Prime Minister Zoran Milanović and then President Ivo Josipović. The protests escalated in May 2015 when a group of protesters breached the riot police cordons in Zagreb Upper Town and barricaded themselves inside St. Mark Church, where they again clashed with the police. At the same time another group of protesters near the central tent blocked the traffic and brought out gas bottles on Savska street which they apparently threatened to blow if the", "label": 1}
